[
  {
    "pk": 1,
    "fields": {
      "name": "Pull-Up",
      "steps": "<ol><li>Begin by finding a sturdy horizontal bar high enough off the ground that you can hang from it with your feet off the floor.</li><li>Stand underneath the bar and jump up, grabbing onto the bar with an overhand grip (palms facing away from you) and your hands slightly wider than shoulder-width apart. Your arms should be fully extended.</li><li>Engage your core and retract your shoulder blades as you pull your body up towards the bar. Keep your elbows pointed downwards and your head in a neutral position.</li><li>Continue pulling your body up until your chin is above the bar. Keep your core tight and your shoulders engaged throughout the movement.</li><li>Pause briefly at the top of the movement, then slowly lower yourself back down to the starting position with control. Make sure to maintain a controlled descent and avoid letting your body swing or drop.</li><li>Repeat the movement for your desired number of repetitions.</li></ol>",
      "notes": "Try assisted variations using resistance bands or an assisted pull-up machine until you build the necessary strength.",
      "primary_muscles": [9],
      "secondary_muscles": [2, 5, 13, 14, 15]
    }
  },
  {
    "pk": 2,
    "fields": {
      "name": "Squat – Barbell",
      "steps": "<ol><li>Begin by standing with your feet shoulder-width apart and your toes pointing forward. Hold a barbell behind your neck, resting it on your shoulders with your elbows pointing down and your palms facing forward.</li><li>Engage your core and keep your chest lifted as you bend your knees and lower your hips back and down as if sitting in a chair. Make sure to keep your weight on your heels and your knees tracking in line with your toes.</li><li>As you descend into the squat, inhale and maintain proper form. Lean forward so that your chest is over your thighs. Keep your back straight and your core engaged. Lower your body until your thighs parallel the ground, and your hips should align with your knees.</li><li>Pause briefly at the bottom of the movement, then exhale and push through your heels to stand back up to the starting position. Keep your core engaged and your chest lifted until you're fully standing.</li><li>Repeat the movement for your desired number of repetitions.</li><li>Place the barbell on the rack after you've finished your set.</li></ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 3,
    "fields": {
      "name": "Push-Up",
      "steps": "<ol><li>Start in a plank position, with your hands shoulder-width apart and your fingers pointing forward.</li><li>Keep your core engaged, your back straight, and your hips in line with your shoulders.</li><li>Lower your body towards the ground by bending your elbows, keeping your upper arms close to your sides.</li><li>Keep your elbows at a 45-degree angle to your body, and continue lowering until your chest touches the ground.</li><li>Push back up to the starting position by straightening your arms, keeping your core engaged and your body in a straight line throughout the movement.</li><li>Repeat</li></ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  },
  {
    "pk": 4,
    "fields": {
      "name": "Romanian Deadlift – Barbell",
      "steps": "<ol><li>Stand with your feet shoulder-width apart and your toes pointing forward. Hold a barbell with an overhand grip in front of your thighs .</li><li>Brace your core, keep your chest up, and slowly bend your knees while hinging at your hips. As you hinge, push your hips back and lower the weight toward the floor. Keep your back straight and your shoulders down.</li><li>Continue lowering the weight until you feel a stretch in your hamstrings. Your knees should be slightly bent but not locked. You can lower the weight until it touches the floor or stops just below your knees.</li><li>Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall. As you stand up, squeeze your glutes and hamstrings.</li><li>Repeat.</li><ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 5,
    "fields": {
      "name": "Romanian Deadlift – Dumbbell",
      "steps": "<ol><li>Stand with your feet shoulder-width apart and your toes pointing forward. Hold a pair of dumbbells with an overhand grip in front of your thighs .</li><li>Brace your core, keep your chest up, and slowly bend your knees while hinging at your hips. As you hinge, push your hips back and lower the weight toward the floor. Keep your back straight and your shoulders down.</li><li>Continue lowering the weight until you feel a stretch in your hamstrings. Your knees should be slightly bent but not locked. You can lower the weight until it touches the floor or stops just below your knees.</li><li>Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall. As you stand up, squeeze your glutes and hamstrings.</li><li>Repeat.</li><ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 6,
    "fields": {
      "name": "Single-Leg Romanian Deadlift – Dumbbell",
      "steps": "<ol><li>Begin by standing on one leg, with a slight bend in the knee. Keep your other leg off the ground and behind you.</li><li>Hold a dumbbell or kettlebell in the opposite hand of the leg you are standing on.</li><li>Brace your core, keep your chest up, and slowly hinge forward at the hips, keeping your back straight and your shoulders down. As you hinge, lift your non-standing leg behind you, keeping it in line with your torso.</li><li>Continue lowering the weight until you feel a stretch in your hamstring. Your standing knee should be slightly bent but not locked.</li><li>Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall while bringing your lifted leg back down to the ground.</li><li>Repeat for the desired number of repetitions on one leg before switching to the other.</li><ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 7,
    "fields": {
      "name": "Squat – Bodyweight",
      "steps": "<ol><li>Stand with your feet shoulder-width apart and point your toes slightly outward.</li><li>Keep your chest up, shoulders back, and core engaged.</li><li>Lower your body by bending your knees and pushing your hips back as if you were sitting in a chair.</li><li>Keep your weight on your heels and your knees behind your toes.</li><li>Lower yourself until your thighs are parallel to the ground or as low as you can comfortably go while maintaining good form.</li><li>Pause briefly at the bottom of the squat.</li><li>Push through your heels to stand back up, driving your hips forward as you do.</li><li>Stand up straight and repeat.</li></ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 8,
    "fields": {
      "name": "Face Pull",
      "steps": "<ol><li>Start by attaching a rope to a high pulley on a cable machine.</li><li>Grasp the rope or cable with both hands using an overhand grip, with your palms facing each other.</li><li>Step back a few feet from the cable machine, so there is tension in the rope or cable.</li><li>Stand with your feet shoulder-width apart, and engage your core muscles to maintain good posture throughout the exercise.</li><li>Pull the rope or cable towards your face, leading with your elbows.</li><li>Keep your elbows high and out to the sides as you pull the rope towards your face until your hands reach your temples or the sides of your head.</li><li>Hold the position for a second, then slowly lower the rope back to the starting position.</li><li>Repeat for the desired number of repetitions.</li></ol>",
      "notes": "Focus on using your back muscles to perform the movement rather than relying on your arms or shoulders.",
      "primary_muscles": [13, 14, 15],
      "secondary_muscles": [17, 20]
    }
  },
  {
    "pk": 9,
    "fields": {
      "name": "Bench Press – Barbell",
      "steps": "<ol><li>Lie on a flat bench with your feet firmly planted on the ground.</li><li>Grip the barbell with your hands slightly wider than shoulder-width apart, with your palms facing away from your body.</li><li>Lift the bar off the rack and hold it directly above your chest with extended arms.</li><li>Slowly lower the bar down to your chest, keeping your elbows close to your body.</li><li>Pause briefly when the bar touches your chest.</li><li>Push the bar back up to the starting position by extending your arms.</li><li>Repeat.</li></ol>",
      "notes": "<ul><li>Ensure your back is flat against the bench, and your feet are firmly planted on the ground.</li><li>Keep your core tight, and your elbows close to your body throughout the movement.</li><li>Exhale as you push the bar away from your chest, and inhale as you lower it down.</li></ul>",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 10,
    "fields": {
      "name": "Squat – Dumbbell",
      "steps": "<ol><li>Stand with your feet shoulder-width apart, with your toes pointing slightly outward.</li><li>Hold a dumbbell in each hand by your sides, with your palms facing inward.</li><li>Engage your core and keep your chest lifted throughout the movement.</li><li>Lower your body by bending at the hips and knees as if sitting on a chair.</li><li>Keep your weight in your heels, and make sure your knees are tracking over your toes.</li><li>Lower your body until your thighs are parallel to the ground or until you reach your desired depth.</li><li>Push through your heels to stand back up to the starting position.</li><li>Repeat.</li></ol>",
      "notes": "Keep your knees in line with your toes throughout the movement.",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 11,
    "fields": {
      "name": "Deadlift – Barbell",
      "steps": "",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 12, 18, 20]
    }
  },
  {
    "pk": 12,
    "fields": {
      "name": "Plank",
      "steps": "",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 13,
    "fields": {
      "name": "Leg Press – Machine",
      "steps": "<ol><li>Adjust the seat of the leg press machine so that your knees are at a ~90-degree angle when your feet are on the footplate.</li><li>Sit on the machine and place your feet shoulder-width apart on the footplate.</li><li>Push the footplate away from your body by extending your legs.</li><li>Lower the footplate back towards your body by bending your legs and keeping your feet flat on the plate.</li><li>Repeat.</li></ol>",
      "notes": "<ol><li>Keep your back flat against the seat throughout the movement.</li><li>Keep your feet flat on the footplate, and make sure your knees are tracking in line with your toes.</li><li>Exhale as you push the footplate away from your body, and inhale as you lower it back down.</li><li>Avoid locking out your knees at the top of the movement, as this can put unnecessary stress on the joint.</li></ol>",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [8]
    }
  },
  {
    "pk": 14,
    "fields": {
      "name": "One-Handed Cross-body Curl",
      "steps": "<ol><li>Stand up, leaning slightly forward from a straight position, feet shoulder-width apart, and your knees slightly bent.</li><li>Hold a dumbbell in each hand, with your palms facing your body and arms fully extended at your sides.</li><li>Keeping your elbows close to your body, slowly curl one dumbbell up toward your opposite shoulder.</li><li>Pause at the top of the curl, squeezing your bicep before slowly lowering the weight to the starting position.</li><li>Repeat the curl on the opposite side, curling the other dumbbell toward the opposite shoulder while rotating your torso.</li><li>Continue alternating curls on each side for the desired number of repetitions.</li></ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 15,
    "fields": {
      "name": "Frog Pumps – Bodyweight",
      "steps": "<ol><li>Lie on your back with your knees bent and your feet flat on the ground. Keep your feet close together and your heels touching.</li><li>Bring your feet up towards your hips along the ground until they're about 6 inches apart, and then let your knees fall out to the sides so that your feet are touching each other. This is the starting position.</li><li>Engage your glutes and lift your hips up towards the ceiling as high as you can, making sure to keep your feet and knees in the same position.</li><li>Hold the top position for 1-2 seconds, then slowly lower your hips to the starting position.</li><li>Repeat.</li></ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 16,
    "fields": {
      "name": "Lying Windshield Wiper",
      "steps": "<ol><li>Lie flat on your back with your arms extended out to the sides, palms down, and your legs extended straight up towards the ceiling.</li><li>Keep your feet together and engage your core muscles by drawing your navel towards your spine.</li><li>Lower your legs to one side, keeping them straight and close to the floor without touching it.</li><li>Pause briefly and then lift your legs back up to the starting position.</li><li>Repeat the movement, this time lowering your legs to the opposite side.</li><li>Continue alternating sides for the desired number of reps or time.</li></ol>",
      "notes": "Avoid swinging or using momentum to perform the movement; instead, control the action with your core muscles.",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 17,
    "fields": {
      "name": "Dip – Bar",
      "steps": "<ol><li>Start by approaching a set of parallel bars or dip bars approximately shoulder-width apart. Grab each bar with an overhand grip and hoist yourself up so your arms are fully extended, and your feet are off the ground.</li><li>Slightly lean forward and keep your elbows slightly bent to engage your chest, shoulders, and triceps muscles.</li><li>Lower your body by bending your elbows and leaning forward while keeping your back straight and your legs behind you. Keep your elbows close to your body throughout the entire exercise.</li><li>Continue lowering yourself until your arms are parallel to the ground, or slightly below parallel, while inhaling.</li><li>Push back up by straightening your arms while exhaling. Be sure to push with your triceps, chest, and shoulder muscles to return to your starting position.</li><li>Repeat.</li></ol>",
      "notes": "You can also add variations to the dip, such as weighted dips or assisted dips, to increase or decrease the intensity of the exercise.",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 18,
    "fields": {
      "name": "Arnold Press",
      "steps": "<ol><li>Hold a dumbbell in each hand and sit or stand with your feet shoulder-width apart.</li><li>Start with your arms bent so that your palms face your body and the dumbbells are at shoulder height.</li><li>As you press the dumbbells overhead, rotate your palms to face forward.</li><li>Continue to press the dumbbells overhead until your arms are fully extended.</li><li>Lower the dumbbells back down to the starting position, rotating your palms back to face your body as you do so.</li><li>Repeat.</li></ol>",
      "notes": "",
      "primary_muscles": [15, 17],
      "secondary_muscles": []
    }
  },
  {
    "pk": 19,
    "fields": {
      "name": "Back Extension",
      "steps": "<ol><li>Adjust the back extension bench so that the pads at the thigh are snug against your thighs and your feet are securely held in place by the footpads.</li><li>Cross your arms over your chest or hold them behind your head.</li><li>Keep your back straight and your neck in a neutral position. Hang your body forward over the thigh pads. This is the starting position.</li><li>Engage your lower back muscles and slowly lift your upper body off the bench until it aligns with your legs.</li><li>Hold this position for up to a few seconds, squeezing your glutes and lower back muscles at the top of the movement.</li><li>Slowly lower your upper body back down to the starting position.</li><li>Repeat.</li></ol>",
      "notes": "Hold weights such as plates to your chest to increase the exercise difficulty.",
      "primary_muscles": [7, 10],
      "secondary_muscles": [8]
    }
  },
  {
    "pk": 20,
    "fields": {
      "name": "One-Legged Glute Bridge",
      "steps": "<ol>\n  <li>Start by lying on your back with your knees bent and feet flat on the ground.</li>\n  <li>Lift your right leg off the ground and extend it straight up towards the ceiling.</li>\n  <li>Press your left foot into the ground and lift your hips up towards the ceiling.</li>\n  <li>Pause at the top of the movement and squeeze your glutes.</li>\n  <li>Lower your hips back down to the ground and repeat for the desired number of reps.</li>\n  <li>Switch legs and repeat the exercise on the other side.</li>\n</ol>",
      "notes": "For increased difficult, hold your leg parallel with your torso instead of extending your leg to the ceiling.",
      "primary_muscles": [7, 8],
      "secondary_muscles": [18]
    }
  },
  {
    "pk": 21,
    "fields": {
      "name": "Curl – Bodyweight",
      "steps": "<ol>\n  <li>Adjust the height of the rings or TRX to waist height and stand facing them.</li>\n  <li>Hold the rings or TRX handles with an underhand grip and lean back, extending your arms straight in front of you.</li>\n  <li>Keep your feet shoulder-width apart and your body in a straight line from head to heels.</li>\n  <li>Engage your biceps and bend your elbows, pulling your body up towards the rings or TRX handles.</li>\n  <li>As you pull your body up, keep your elbows close to your body and your wrists straight.</li>\n  <li>When your hands reach your chest, pause for a moment and then slowly lower your body back down to the starting position.</li>\n  <li>Repeat the exercise for the desired number of reps.</li>\n  </ol>",
      "notes": "",
      "primary_muscles": [2, 9],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 22,
    "fields": {
      "name": "Hanging Leg Raise",
      "steps": "<ol>\n  <li>Hang from a pull-up bar with your arms straight and your feet off the ground.</li>\n  <li>Engage your core muscles and lift your legs up towards your chest, keeping them straight.</li>\n  <li>Pause briefly at the top of the movement, then slowly lower your legs back down to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 23,
    "fields": {
      "name": "Squat – Chair",
      "steps": "<ol>\n  <li>Start by standing in front of a chair with your feet shoulder-width apart.</li>\n  <li>Slowly lower your body towards the chair by bending your knees and pushing your hips back.</li>\n  <li>Keep your chest up and your weight on your heels.</li>\n  <li>Lower your body until your buttocks touch the chair.</li>\n  <li>Pause for a moment, then push through your heels to stand back up.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 24,
    "fields": {
      "name": "Burpee – BOSU",
      "steps": "<ol>\n  <li>Start in a standing position with the BOSU ball on the ground (inflated-side down) in front of you.</li>\n  <li>Grip the edges of the BOSU ball and jump your feet back into a plank position.</li>\n  <li>Perform a push-up while gripping the BOSU ball.</li>\n  <li>Jump your feet back towards the BOSU ball into a low squat position.</li>\n  <li>Complete the squat by standing up. As you rise, lift the BOSU ball overhead, extending your arms towards the ceiling.</li>\n  <li>Repeat the exercise for desired number of reps.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 12, 16, 17],
      "secondary_muscles": [1, 20]
    }
  },
  {
    "pk": 25,
    "fields": {
      "name": "Shoulder Press – Machine",
      "steps": "<ol>\n  <li>Adjust the seat height so that the handles are at shoulder level.</li>\n  <li>Sit on the machine with your back against the pad and your feet flat on the floor.</li>\n  <li>Grasp the handles with an overhand grip and push them upward until your arms are fully extended.</li>\n  <li>Slowly lower the handles back down to shoulder level, keeping your elbows slightly bent.</li>\n  <li>Repeat for desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 26,
    "fields": {
      "name": "Leg Extension",
      "steps": "<ol>\n  <li>Adjust the machine to fit your body and select the appropriate weight.</li>\n  <li>Sit on the machine with your back against the backrest and your feet or ankle flat against the supporting pad.</li>\n  <li>Grasp the handles on the side of the machine for stability.</li>\n  <li>Extend your legs out in front of you until they are parallel to the floor, keeping your feet flexed and your knees slightly bent.</li>\n  <li>Hold for a moment, then slowly lower the weight back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [12],
      "secondary_muscles": []
    }
  },
  {
    "pk": 27,
    "fields": {
      "name": "Close-Grip Feet-Up Bench Press – Barbell",
      "steps": "<ol>\n  <li>Lie flat on a bench with your feet up and your back pressed against the bench.</li>\n  <li>Grasp the barbell with a close grip, with your hands shoulder-width apart.</li>\n  <li>Unrack the barbell and hold it above your chest with your arms extended.</li>\n  <li>Lower the barbell to your chest, keeping your elbows close to your body.</li>\n  <li>Pause briefly at the bottom of the movement, then press the barbell back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": [4, 16]
    }
  },
  {
    "pk": 28,
    "fields": {
      "name": "Rear Delt Row – Barbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Hold a barbell with an overhand grip, hands shoulder-width apart.</li>\n  <li>Lean forward at the hips, keeping your back straight and your abs engaged.</li>\n  <li>Bring the barbell up towards your chest, keeping your elbows wide and out to the sides.</li>\n  <li>Squeeze your shoulder blades together at the top of the movement.</li>\n  <li>Lower the barbell back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [15],
      "secondary_muscles": [2, 5, 13, 20]
    }
  },
  {
    "pk": 29,
    "fields": {
      "name": "Hip Abduction – Machine",
      "steps": "<ol>\n  <li>Adjust the machine to fit your height and leg length.</li>\n  <li>Sit on the machine with your back against the backrest and your feet on the footrests.</li>\n  <li>Press your legs outward against the resistance of the machine.</li>\n  <li>With your knees at their farthest point, hold the weight for a moment before slowly releasing the resistance and returning to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [19],
      "secondary_muscles": [7]
    }
  },
  {
    "pk": 30,
    "fields": {
      "name": "Cable Curl – Rope",
      "steps": "<ol>\n  <li>Attach a rope to a low pulley cable machine.</li>\n  <li>Stand facing the machine with feet shoulder-width apart and knees slightly bent.</li>\n  <li>Grasp the rope with an underhand grip, palms facing each other.</li>\n  <li>Keep elbows close to your sides and curl the rope towards your shoulders.</li>\n  <li>Pause briefly at the top of the movement, then slowly lower the rope back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 31,
    "fields": {
      "name": "Plank - BOSU",
      "steps": "<ol>\n  <li>Place a BOSU ball on the ground with the flat side facing up.</li>\n  <li>Assume a plank position with your forearms on the BOSU ball and your toes on the ground.</li>\n  <li>Engage your core and keep your body in a straight line from head to heels.</li>\n  <li>Hold the position for the desired amount of time.</li>\n  <li>Release the position by lowering your knees to the ground.</li>\n</ol>",
      "notes": "Instead of placing your forearms on the flat side of the BOSU, you can grab the edges with both hands and plank from a straight-armed position.",
      "primary_muscles": [1],
      "secondary_muscles": []
    }
  },
  {
    "pk": 32,
    "fields": {
      "name": "Glute Kickback – Machine",
      "steps": "<ol>\n  <li>Adjust the machine to fit your body height</li>\n  <li>Position yourself in the machine with your hands on the handles and one ankle on the padding.</li>\n  <li>Keeping your core engaged, exhale and extend your leg back as far as possible while squeezing your glutes.</li>\n  <li>Inhale and slowly return your leg to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 33,
    "fields": {
      "name": "Pause Squat – Barbell",
      "steps": "<ol>\n  <li>Start with your feet shoulder-width apart, your toes pointing slightly outward, and the barbell on your shoulders.</li>\n  <li>Lower your body into a squat position, keeping your back straight and your knees tracking with your toes.</li>\n  <li>Pause at the bottom of the squat for 2-3 seconds.</li>\n  <li>Slowly rise back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 34,
    "fields": {
      "name": "Walking Lunge – Barbell",
      "steps": "<ol>\n  <li>Start with your feet hip-width apart and the barbell on your shoulders.</li>\n  <li>Take a large step forward with your right foot, lowering your body until your right thigh is parallel to the ground and your left knee is hovering just above the floor.</li>\n  <li>Push through your right heel to stand back up, bringing your left foot forward to meet your right foot.</li>\n  <li>Repeat the lunge on the other side by stepping forward with your left foot.</li>\n  <li>Continue alternating lunges for the desired number of reps or distance.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": []
    }
  },
  {
    "pk": 35,
    "fields": {
      "name": "Rotational Throw – Medicine Ball",
      "steps": "<ol>\n  <li>Start by standing about arms-length away from the wall with your feet shoulder-width apart.</li>\n  <li>Hold a medicine ball with both hands at chest height.</li>\n  <li>Rotating your core and upper body towards the wall, explosively throw the ball against the wall.</li>\n  <li>Catch the ball as it rebounds off the wall and rotate your body away from the wall.</li>\n  <li>Repeat for the desired number of reps and then switch sides.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1, 16]
    }
  },
  {
    "pk": 36,
    "fields": {
      "name": "Row – T-Bar",
      "steps": "<ol>\n  <li>Load the desired weight onto the T-Bar machine.</li>\n  <li>Lie down on the T-Bar machine with your feet securely planted.</li>\n  <li>Grasp the handles of the T-Bar with an overhand grip.</li>\n  <li>Pull the T-Bar towards your chest, keeping your elbows close to your body.</li>\n  <li>Pause briefly at the top of the movement, squeezing your shoulder blades together.</li>\n  <li>Slowly lower the T-Bar back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 10, 13, 14]
    }
  },
  {
    "pk": 37,
    "fields": {
      "name": "Standing Shoulder Press – Dumbbell",
      "steps": "<ol>\n  <li>Start by standing with your feet shoulder-width apart, holding a dumbbell in each hand by your thighs.</li>\n  <li>Raise the dumbbells to shoulder height, palms facing forward, and elbows bent.</li>\n  <li>Press the dumbbells upward until your arms are fully extended above your head.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower the dumbbells back down to shoulder height.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 38,
    "fields": {
      "name": "Upright Row – Barbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Grasp the barbell with an overhand grip, hands narrower than shoulder-width apart.</li>\n  <li>Hold the barbell in front of your thighs with your arms extended.</li>\n  <li>Exhale and lift the barbell straight up towards your chin, keeping it close to your body.</li>\n  <li>Pause for a moment at the top of the movement, then inhale and slowly lower the barbell back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [17],
      "secondary_muscles": [2, 16, 20]
    }
  },
  {
    "pk": 39,
    "fields": {
      "name": "Rear Delt Row – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell in each hand.</li>\n  <li>Bend your knees slightly and hinge forward at the hips, keeping your back straight.</li>\n  <li>Bring the dumbbells up to your chest, keeping your elbows wide and out to the sides.</li>\n  <li>Slowly lower the dumbbells back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [15],
      "secondary_muscles": [2, 5, 13, 20]
    }
  },
  {
    "pk": 40,
    "fields": {
      "name": "Floor Press – Dumbbell",
      "steps": "<ol>\n  <li>Lie flat on your back on the floor with your knees bent and feet flat on the ground.</li>\n  <li>Hold a dumbbell in each hand with your palms facing towards your feet.</li>\n  <li>Extend your arms straight up towards the ceiling, with your elbows slightly bent.</li>\n  <li>Slowly lower the dumbbells down towards your chest, keeping your elbows close to your body.</li>\n  <li>Pause when your upper arms touch the ground.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 41,
    "fields": {
      "name": "Incline Curl – Dumbbell",
      "steps": "<ol>\n  <li>Adjust the bench to a 45-degree angle.</li>\n  <li>Grab a pair of dumbbells and sit on the bench with your back straight.</li>\n  <li>Let your arms hang down by your sides with your palms facing forward.</li>\n  <li>Slowly curl the dumbbells up towards your shoulders while keeping your elbows close to your body.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower the dumbbells back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 42,
    "fields": {
      "name": "Eccentric Heel Drop",
      "steps": "<ol>\n  <li>Stand on a raised platform or step with the balls of your feet on the edge and your heels hanging off.</li>\n  <li>Raise your heels up as high as possible.</li>\n  <li>Shift your weight onto one foot and slowly lower your heel down below the platform.</li>\n  <li>Use your other foot to push yourself back up to the starting position.</li>\n  <li>Repeat for the desired number of repetitions on one leg before switching to the other.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [3],
      "secondary_muscles": []
    }
  },
  {
    "pk": 43,
    "fields": {
      "name": "Squat – Belt",
      "steps": "<ol>\n  <li>Add your desired weight to the machine.</li>\n  <li>Attach a belt or harness around your waist.</li>\n  <li>Attach a cable or chain to the belt or harness.</li>\n  <li>Stand on a platform or box with feet shoulder-width apart.</li>\n  <li>Hold onto a stable object for balance.</li>\n  <li>Squat by bending the knees and hips while keeping the back straight.</li>\n  <li>Pause at the bottom of the squat and then push up through the legs to return to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 44,
    "fields": {
      "name": "Hang Power Clean",
      "steps": "<ol>\n  <li>Start with feet shoulder-width apart, toes pointing forward, and grip a weighted barbell with an overhand grip just outside of your legs.</li>\n  <li>Lower your hips and bend your knees, keeping your back straight and your chest up.</li>\n  <li>Drive your hips forward and explosively pull the barbell up towards your shoulders, keeping it close to your body.</li>\n  <li>As the barbell reaches your chest, quickly drop your elbows underneath it and catch it on your shoulders in a front rack position.</li>\n  <li>Stand up straight, keeping the barbell close to your body, and then lower it back down to the starting position.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 18, 20]
    }
  },
  {
    "pk": 45,
    "fields": {
      "name": "Teaser Sit-Up",
      "steps": "<ol>\n  <li>Start by lying on your back with your arms extended above your head and your legs straight out in front of you.</li>\n  <li>Engage your core muscles and lift your legs up to a 45-degree angle while simultaneously lifting your upper body off the ground.</li>\n  <li>Reach your arms forward and try to touch your toes with your fingertips.</li>\n  <li>Hold the position for a few seconds, then slowly lower your body back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": []
    }
  },
  {
    "pk": 46,
    "fields": {
      "name": "Hack Squat – Barbell",
      "steps": "<ol>\n  <li>Stand in front of the barbell with your feet shoulder-width apart. The barbell will be by the back of your calves.</li>\n  <li>Bend down and grip the barbell with an overhand grip, with your palms facing behind you.</li>\n  <li>Stand up straight, lifting the barbell off the ground and holding it behind your legs.</li>\n  <li>Keeping your back straight, lower your body by bending your knees and hips, as if you were sitting down on a chair, until your thighs are parallel to the ground.</li>\n  <li>Push through your heels to stand back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [12],
      "secondary_muscles": [3, 5, 7, 10, 18, 20]
    }
  },
  {
    "pk": 47,
    "fields": {
      "name": "Straight Arm Lat Pulldown",
      "steps": "<ol>\n  <li>Adjust the cable machine to a high position and attach a straight bar to the cable.</li>\n  <li>Stand facing the machine with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Grasp the bar with both hands using an overhand grip, with your hands slightly wider than shoulder-width apart.</li>\n  <li>Engage your core and keep your arms straight as you pull the bar down towards your thighs, using your lats to initiate the movement.</li>\n  <li>Pause for a moment at the bottom of the movement, then slowly release the bar back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9],
      "secondary_muscles": [13, 14, 15]
    }
  },
  {
    "pk": 48,
    "fields": {
      "name": "Lying Internal Shoulder Rotation – Dumbbell",
      "steps": "<ol>\n  <li>Lie on your side on a flat bench. Rest the upper part of your top along your torso. Extend your forearm straight out in front of you with your elbow bent at a 90-degree angle.</li>\n  <li>Hold a dumbbell in your hand with your palm facing up towards the ceiling.</li>\n  <li>Slowly rotate your arm inwards towards your body, keeping your elbow bent and your upper arm stationary.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower the dumbbell back to the starting position.</li>\n  <li>Repeat for the desired number of repetitions, then switch sides and repeat the exercise with your other arm.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [14],
      "secondary_muscles": []
    }
  },
  {
    "pk": 49,
    "fields": {
      "name": "Landmine Squat",
      "steps": "<ol>\n  <li>Start by placing a barbell into a landmine attachment or securely anchor it into a corner.</li>\n  <li>Stand facing the barbell with your feet shoulder-width apart and your toes pointing slightly outward.</li>\n  <li>Grab the end of the barbell with both hands and lift it up to your chest.</li>\n  <li>Lower your hips down and back, keeping your chest up and your back straight.</li>\n  <li>Bend your knees and lower your body until your thighs are parallel to the ground.</li>\n  <li>Push through your heels and stand back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 50,
    "fields": {
      "name": "Push-Up – Feet in Rings",
      "steps": "<ol>\n  <li>Start in a plank position with your feet in the rings and your hands shoulder-width apart on the ground.</li>\n  <li>Lower your body towards the ground by bending your elbows and keeping your body straight.</li>\n  <li>Push yourself back up to the starting position by straightening your arms.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  },
  {
    "pk": 51,
    "fields": {
      "name": "Lateral Walk – Band",
      "steps": "<ol>\n  <li>Place a resistance band around your ankles and stand with your feet hip-width apart.</li>\n  <li>Take a step to the right with your right foot, keeping tension on the band.</li>\n  <li>Bring your left foot to meet your right foot, maintaining tension on the band.</li>\n  <li>Take another step to the right with your right foot, again keeping tension on the band.</li>\n  <li>Repeat this lateral movement for a desired number of steps to the right.</li>\n  <li>Then, reverse the movement and take the same number of steps to the left.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [19],
      "secondary_muscles": [7]
    }
  },
  {
    "pk": 52,
    "fields": {
      "name": "Sit-Up",
      "steps": "<ol>\n  <li>Start by lying on your back with your knees bent and feet flat on the ground.</li>\n  <li>Place your hands behind your head or cross them over your chest.</li>\n  <li>Engage your core muscles and lift your upper body off the ground towards your knees.</li>\n  <li>Exhale as you lift your body up and inhale as you lower it back down to the ground.</li>\n  <li>Lower your body back down to the ground with control, keeping your core engaged throughout the movement.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 53,
    "fields": {
      "name": "Incline Bench Press – Smith Machine",
      "steps": "<ol>\n  <li>Adjust the height of the Smith machine bar to a comfortable level for the incline bench press.</li>\n  <li>Select the desired weight and load it onto the bar.</li>\n  <li>Lie down on the incline bench and position yourself under the bar.</li>\n  <li>Grip the bar with a slightly wider than shoulder-width grip and lift it off the rack.</li>\n  <li>Lower the bar down to your chest while keeping your elbows tucked in.</li>\n  <li>Push the bar back up to the starting position, keeping your core engaged and your back flat on the bench.</li>\n  <li>Repeat.</li>\n  <li>When finished, carefully rack the bar back onto the Smith machine.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 54,
    "fields": {
      "name": "Chest Fly – Dumbbell",
      "steps": "<ol>\n  <li>Start by lying flat on a bench with your feet firmly on the ground and your head, shoulders, and buttocks touching the bench.</li>\n  <li>Hold a dumbbell in each hand with your palms facing each other and your arms extended above your chest.</li>\n  <li>Slowly lower the dumbbells out to the sides of your body, keeping your elbows slightly bent and your palms facing up.</li>\n  <li>Lower the dumbbells until your arms are parallel to the ground or until you feel a stretch in your chest muscles.</li>\n  <li>Pause for a moment, then slowly bring the dumbbells back up to the starting position, keeping your elbows slightly bent and your palms facing each other.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4],
      "secondary_muscles": [16]
    }
  },
  {
    "pk": 55,
    "fields": {
      "name": "Mountain Climbers",
      "steps": "<ol>\n  <li>Start in a high plank position with your hands shoulder-width apart and your wrists directly under your shoulders.</li>\n  <li>Engage your core and bring your right knee towards your chest, keeping your foot off the ground.</li>\n  <li>Quickly switch legs, bringing your left knee towards your chest while extending your right leg back.</li>\n  <li>Continue alternating legs at a quick pace, as if you are running in place while in a plank position.</li>\n  <li>Keep your hips low and your shoulders over your wrists throughout the exercise.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 56,
    "fields": {
      "name": "Tricep Pushdown – Cable With Bar",
      "steps": "<ol>\n  <li>Attach a straight bar to the high pulley of a cable machine.</li>\n  <li>Stand facing the machine with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Grasp the bar with an overhand grip, with your hands shoulder-width apart.</li>\n  <li>Keep your elbows close to your sides and your upper arms stationary.</li>\n  <li>Exhale and push the bar down until your arms are fully extended.</li>\n  <li>Pause for a moment, then inhale and slowly return the bar to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": []
    }
  },
  {
    "pk": 57,
    "fields": {
      "name": "Horizontal External Shoulder Rotation – Dumbbell",
      "steps": "<ol>\n  <li>Lie on your side on a bench or mat.</li>\n  <li>Bend your upper elbow 90-degrees to extend your forearm straight out in front of you, and hold a dumbbell in that upper hand.</li>\n  <li>Keep your elbow bent at a 90-degree angle and your upper arm pressed against your side.</li>\n  <li>Slowly rotate your arm outwards, away from your body, until your forearm points towards the ceiling.</li>\n  <li>Hold this position for a few seconds, then slowly lower your arm back to the starting position.</li>\n  <li>Repeat for the desired number of repetitions, then switch sides and repeat the exercise with your other arm.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [13],
      "secondary_muscles": []
    }
  },
  {
    "pk": 58,
    "fields": {
      "name": "Supinated Grip Lat Pulldown",
      "steps": "<ol>\n  <li>Adjust the weight on the lat pulldown machine to a comfortable level.</li>\n  <li>Stand facing the machine and grasp the bar with an underhand grip, with your hands shoulder-width apart.</li>\n  <li>Sit down on the bench and adjust the knee pad so that it fits snugly against your thighs.</li>\n  <li>Lean back slightly and keep your chest up and your shoulders down.</li>\n  <li>Exhale and pull the bar down towards your chest, keeping your elbows close to your body.</li>\n  <li>Pause for a moment and squeeze your shoulder blades together.</li>\n  <li>Inhale and slowly release the bar back to the starting position, keeping your arms straight but not locked.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9],
      "secondary_muscles": [2, 5, 13, 14, 15]
    }
  },
  {
    "pk": 59,
    "fields": {
      "name": "Wrist Curl Behind the Back – Barbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Hold a barbell with an overhand grip behind your back, with your palms facing away from your body.</li>\n  <li>Keep your elbows close to your body and your upper arms stationary.</li>\n  <li>Curl the barbell up towards your forearms, keeping your wrists straight.</li>\n  <li>Pause at the top of the movement and squeeze your forearms.</li>\n  <li>Slowly lower the barbell back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5],
      "secondary_muscles": []
    }
  },
  {
    "pk": 60,
    "fields": {
      "name": "Incline Push-Up",
      "steps": "<ol>\n  <li>Start in a plank position with your hands on an elevated surface, such as a bench or step.</li>\n  <li>Place your hands slightly wider than shoulder-width apart and keep your fingers pointing forward.</li>\n  <li>Engage your core and glutes to maintain a straight line from your head to your heels.</li>\n  <li>Lower your chest towards the bench, keeping your elbows close to your body.</li>\n  <li>Pause when your chest is just above the bench.</li>\n  <li>Push back up to the starting position, fully extending your arms.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  },
  {
    "pk": 61,
    "fields": {
      "name": "High to Low Wood Chop – Cable",
      "steps": "<ol>\n  <li>Attach a cable to a high pulley and select the desired weight.</li>\n  <li>Stand perpendicular to the cable with feet shoulder-width apart and knees slightly bent.</li>\n  <li>Grasp the handle with both hands and extend arms overhead, keeping them straight.</li>\n  <li>Engage core muscles and rotate torso diagonally downwards, pulling the cable down towards the opposite hip.</li>\n  <li>Bend knees and pivot back foot as needed to maintain balance and stability.</li>\n  <li>Pause briefly at the bottom of the movement, then reverse the motion and return to starting position.</li>\n  <li>Repeat for desired number of repetitions, then switch sides and repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 62,
    "fields": {
      "name": "Deadlift – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart, with a dumbbell in each hand.</li>\n  <li>Hold the dumbbells about halfway between the front and side of your quads, with your palms facing your body.</li>\n  <li>Bend your knees, hinge and lean forward at the hips, keeping your back straight and your chest up.</li>\n  <li>Lower the dumbbells towards the ground, keeping them close to your body.</li>\n  <li>Pause when your dumbbells are just below your knees.</li>\n  <li>Push through your heels and stand up, keeping your back straight and your chest up.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 12, 18, 20]
    }
  },
  {
    "pk": 63,
    "fields": {
      "name": "Block Snatch",
      "steps": "<ol>\n  <li>Start with feet shoulder-width apart and toes pointing slightly outward.</li>\n  <li>Place the barbell on blocks in front of you, with your hands wider than shoulder-width apart and palms facing down.</li>\n  <li>Lower your hips and bend your knees, keeping your back straight and chest up.</li>\n  <li>Drive through your legs and hips, explosively extending your knees and hips to lift the barbell off the ground.</li>\n  <li>As the barbell reaches your mid-thigh, shrug your shoulders and pull the barbell upward, keeping it close to your body.</li>\n  <li>As the barbell reaches its highest point, drop under the barbell and catch it in a squat position, with your arms fully extended overhead.</li>\n  <li>Stand up with the barbell extended over your head, maintaining a straight back.</li>\n  <li>Lower the barbell back to the blocks in a controlled manner.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3, 5, 8, 20]
    }
  },
  {
    "pk": 64,
    "fields": {
      "name": "Chest Fly – Machine",
      "steps": "<ol>\n  <li>Adjust the seat height and position on the machine to ensure proper alignment with the handles.</li>\n  <li>Extend your arms out to the sides, keeping a slight bend in your elbows. Grasp the handles and sit with your back flat against the pad.</li>\n   <li>Inhale and slowly bring your arms together in front of your chest, keeping them slightly bent.</li>\n  <li>Exhale and slowly return your arms to the starting position, maintaining a slight bend in your elbows.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4],
      "secondary_muscles": [16]
    }
  },
  {
    "pk": 65,
    "fields": {
      "name": "Chest Press – Cable",
      "steps": "<ol>\n  <li>Adjust the cable machine to chest height and attach the handles to the cables.</li>\n  <li>Stand facing away from the machine and grasp the handles with an overhand grip.</li>\n  <li>Step forward to create tension in the cables and position your feet shoulder-width apart.</li>\n  <li>Engage your core and keep your chest up as you push the handles forward until your arms are fully extended.</li>\n  <li>Hold the position for a moment and then slowly release the handles back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4],
      "secondary_muscles": [16, 21]
    }
  },
  {
    "pk": 66,
    "fields": {
      "name": "Kneeling Side Plank",
      "steps": "<ol>\n  <li>From a kneeling position on the ground, lean to the right until your right hand or elbow make contact with the ground directly under your right shoulder.</li>\n  <li>Your body should form a straight line from your left shoulder (pointing towards the ceiling) to your left knee that stacked on top of the right knee.</li>\n  <li>Hold this position, engaging your core, for the desired time.</li>\n  <li>Raise back up to a kneeling position and repeat on the other side.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 67,
    "fields": {
      "name": "Hip Thrust – Band",
      "steps": "<ol>\n  <li>Place a resistance band below your knees.</li>\n  <li>Sit on the ground with your back against a bench, your feet flat on the ground, and position a barbell across your hips.</li>\n  <li>Engage your core and glute muscles, and slowly lift your hips up off the ground until your body forms a straight line from your knees to your shoulders.</li>\n  <li>Hold for a second or two at the top of the movement, then lower your hips back down to the ground.</li>\n  <li>Repeat.</li>\n<ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 68,
    "fields": {
      "name": "Row – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell in each hand.</li>\n  <li>Bend your knees slightly and hinge forward at the hips, keeping your back straight.</li>\n  <li>Bring the dumbbells up towards your chest, keeping your elbows close to your body.</li>\n  <li>Pause at the top of the movement and squeeze your shoulder blades together.</li>\n  <li>Lower the dumbbells back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 13, 14]
    }
  },
  {
    "pk": 69,
    "fields": {
      "name": "Stiff-Legged Deadlift – Barbell",
      "steps": "<ol>\n  <li>Stand with feet hip-width apart and toes pointing forward.</li>\n  <li>Hold a barbell in front of your thighs with an overhand grip.</li>\n  <li>Engage your core and keep your back straight as you hinge forward at the hips, pushing your glutes back.</li>\n  <li>Lower the weight towards the ground, keeping your legs straight but not locked.</li>\n  <li>Pause when you feel a stretch in your hamstrings, then use your glutes and hamstrings to lift the weight back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 70,
    "fields": {
      "name": "Incline Bench Press – Dumbbell",
      "steps": "<ol>\n  <li>Set up an incline bench at a 45-degree angle.</li>\n  <li>Choose two dumbbells of equal weight and sit on the bench with them resting on your thighs.</li>\n  <li>Lie back on the bench and bring the dumbbells up to your chest, palms facing forward.</li>\n  <li>Push the dumbbells up and away from your chest, extending your arms fully but not locking your elbows.</li>\n  <li>Slowly lower the dumbbells back down to your chest, keeping your elbows at a 45-degree angle to your body.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 71,
    "fields": {
      "name": "Standing Calf Raise",
      "steps": "<ol>\n  <li>Stand on a raised surface or at a machine with the balls of your feet on the edge and your heels hanging off.</li>\n  <li>Slowly raise your heels as high as possible, keeping your knees straight.</li>\n  <li>Hold the position, then lower your heels back down below the level of the raised surface.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [3],
      "secondary_muscles": []
    }
  },
  {
    "pk": 72,
    "fields": {
      "name": "Squat – Smith Machine",
      "steps": "<ol>\n  <li>Adjust the bar height to your desired position.</li>\n  <li>Load the bar with an appropriate weight.</li>\n  <li>Stand facing the bar with your feet shoulder-width apart.</li>\n  <li>Step forward and position the bar on your shoulders, resting on the back of your neck.</li>\n  <li>Grasp the bar with both hands, keeping your elbows pointed down and your chest up.</li>\n  <li>Lower your body by bending at the knees and hips, keeping your back straight and your head up.</li>\n  <li>Lower until your thighs are parallel to the ground, then push back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 73,
    "fields": {
      "name": "Power Jerk",
      "steps": "<ol>\n  <li>Start with the barbell resting on your front shoulders, with your feet shoulder-width apart.</li>\n  <li>Bend your knees slightly and dip your hips down.</li>\n  <li>Quickly extend your legs and hips, driving the barbell upwards.</li>\n  <li>As the barbell reaches its highest point, quickly drop underneath it, in a small squat.</li>\n  <li>As you catch the barbell overhead, straighten your legs and stand up.</li>\n  <li>Lower the barbell back down to your front shoulders to complete the rep.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [7, 10, 12, 17, 18, 20, 21]
    }
  },
  {
    "pk": 74,
    "fields": {
      "name": "Preacher Curl – Barbell",
      "steps": "<ol>\n  <li>Set up a preacher curl bench with the appropriate weight on the barbell.</li>\n  <li>Adjust the seat height so that your armpits are resting comfortably on the top of the bench.</li>\n  <li>Grab the barbell with an underhand grip, hands shoulder-width apart.</li>\n  <li>Place your upper arms on the bench pad, keeping your elbows close to your body.</li>\n  <li>Exhale and curl the barbell up towards your shoulders, keeping your upper arms stationary.</li>\n  <li>Pause briefly at the top of the movement, squeezing your biceps.</li>\n  <li>Inhale and slowly lower the barbell back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 75,
    "fields": {
      "name": "Clean and Jerk",
      "steps": "<ol>\n  <li>Start with the barbell on the ground, feet shoulder-width apart and toes pointing forward.</li>\n  <li>Bend down and grip the bar with hands slightly wider than shoulder-width apart.</li>\n  <li>Stand up, keeping your back straight and the bar close to your body.</li>\n  <li>Once the bar reaches your hips, explosively extend your hips, knees, and ankles to propel the bar upward.</li>\n  <li>As the bar reaches your chest, drop your body underneath it and catch it on your shoulders in a front squat position.</li>\n  <li>Stand up from the front squat position and prepare for the jerk.</li>\n  <li>Dip your body slightly and then explosively drive the bar overhead by extending your arms and legs.</li>\n  <li>Lock out your arms and hold the bar overhead for a moment before lowering it back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 16, 18],
      "secondary_muscles": [3, 5, 8, 17, 20, 21]
    }
  },
  {
    "pk": 76,
    "fields": {
      "name": "Hang Clean",
      "steps": "<ol>\n  <li>Start with feet shoulder-width apart and grip the barbell with an overhand grip, hands slightly wider than shoulder-width apart.</li>\n  <li>Bend your knees and lower your hips, keeping your back straight and your chest up.</li>\n  <li>Begin the lift by explosively extending your hips, knees, and ankles, pulling the bar up towards your chest.</li>\n  <li>As the bar reaches chest height, quickly drop under the bar, rotating your elbows forward and catching the bar on your shoulders in a front squat position.</li>\n  <li>Stand up with the bar, keeping your elbows high and your chest up.</li>\n  <li>Lower the bar back down to the starting position by reversing the movement, bending your knees and lowering your hips.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3, 5, 8, 20]
    }
  },
  {
    "pk": 77,
    "fields": {
      "name": "Glute Bridge",
      "steps": "<ol>\n  <li>Start by lying on your back with your knees bent and feet flat on the ground.</li>\n  <li>Place your arms by your sides with your palms facing down.</li>\n  <li>Engage your core and glutes to lift your hips off the ground until your body forms a straight line from your shoulders to your knees.</li>\n  <li>Hold the position for a few seconds, squeezing your glutes at the top of the movement.</li>\n  <li>Lower your hips back down to the ground.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 8],
      "secondary_muscles": []
    }
  },
  {
    "pk": 78,
    "fields": {
      "name": "Incline Bench Press – Barbell",
      "steps": "<ol>\n  <li>Set up the incline bench at a 45-degree angle.</li>\n  <li>Lie down on the bench with your feet flat on the ground.</li>\n  <li>Grip the barbell with your hands slightly wider than shoulder-width apart.</li>\n  <li>Unrack the barbell and lower it towards your chest, keeping your elbows tucked in.</li>\n  <li>Pause briefly at the bottom of the movement, then press the barbell back up to the starting position.</li>\n  <li>Repeat for desired number of reps.</li>\n  <li>Rack the barbell once you have completed your set.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 79,
    "fields": {
      "name": "Lateral Raise – Machine",
      "steps": "<ol>\n  <li>Adjust the seat height so that the handles are at shoulder level.</li>\n  <li>Sit on the machine with your back against the pad and your feet flat on the floor.</li>\n  <li>Grasp the handles with an overhand grip and keep your elbows slightly bent.</li>\n  <li>Exhale and raise your arms out to the sides until they are parallel to the floor.</li>\n  <li>Pause for a moment and then inhale as you slowly lower the handles back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [17],
      "secondary_muscles": [16]
    }
  },
  {
    "pk": 80,
    "fields": {
      "name": "Plate Pinch",
      "steps": "<ol>\n  <li>Choose two weight plates of the same size and weight.</li>\n  <li>Stand facing the plates and place them on the ground.</li>\n  <li>Bend down and grip the top of each plate with your fingers and thumbs.</li>\n  <li>Lift the plates off the ground and hold them beside your body with your arms hanging, elbows straight, but not locked.</li>\n  <li>Squeeze your fingers and thumbs together to maintain a strong grip on the plates.</li>\n  <li>Hold the plates for a set amount of time or for a certain number of repetitions.</li>\n  <li>Lower the plates back to the ground and release your grip.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5],
      "secondary_muscles": []
    }
  },
  {
    "pk": 81,
    "fields": {
      "name": "Hip Thrust – Barbell",
      "steps": "<ol>\n  <li>Sit on the ground with your back against a bench, your feet flat on the ground, and position a barbell across your hips.</li>\n  <li>Engage your core and glute muscles, and slowly lift your hips up off the ground until your body forms a straight line from your knees to your shoulders.</li>\n  <li>Hold for a second or two at the top of the movement, then lower your hips back down to the ground.</li>\n  <li>Repeat.</li>\n<ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 82,
    "fields": {
      "name": "Preacher Curl – Dumbbell",
      "steps": "<ol>\n  <li>Adjust the preacher bench to the appropriate height and secure the weight plate at the bottom.</li>\n  <li>Choose the appropriate dumbbell weight and sit on the preacher bench with your chest against the pad and your arms extended over the pad.</li>\n  <li>Grasp the dumbbell with an underhand grip and curl it towards your shoulders, keeping your upper arms stationary against the pad.</li>\n  <li>Pause at the top of the movement and squeeze your biceps.</li>\n  <li>Lower the dumbbell back down to the starting position in a controlled manner.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 83,
    "fields": {
      "name": "External Shoulder Rotation – Band",
      "steps": "<ol>\n  <li>Attach a resistance band to a stable object at waist height.</li>\n  <li>Stand perpendicular to the anchor point with your right arm farthest away from it, and your feet shoulder-width apart.</li>\n  <li>Reach across your body with your right hand and grab the band.</li>\n  <li>Create resistance in the band by bringing your right elbow close to your right side where it hangs naturally.</li>\n  <li>This starting position has you with your right forearm across the front of your body, at a 90-degree angle to your right upper-arm.</li>\n  <li>Keep your core engaged and your shoulders relaxed.</li>\n  <li>Slowly rotate your arms outward, away from your body, until your right hand is in line with your right shoulder.</li>\n  <li>Pause for a moment, then slowly return to the starting position.</li>\n  <li>Repeat for the desired number of repetitions and then switch sides.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [13],
      "secondary_muscles": []
    }
  },
  {
    "pk": 84,
    "fields": {
      "name": "Internal Shoulder Rotation – Band",
      "steps": "<ol>\n  <li>Attach a resistance band to a stable object at waist height.</li>\n  <li>Stand perpendicular to the anchor point with your right arm closest to it, and your feet shoulder-width apart.</li>\n  <li>Reach your right hand and grab the band.</li>\n  <li>Create resistance in the band by side-stepping away from the anchor point.</li>\n  <li>This starting position has your right forearm at a 90-degree angle to your right upper-arm. Your right forearm points to your right.</li>\n  <li>Keep your core engaged and your shoulders relaxed.</li>\n  <li>Slowly rotate your arms inward, toward your body, until your right hand is in line with your right shoulder.</li>\n  <li>Pause for a moment, then slowly return to the starting position.</li>\n  <li>Repeat for the desired number of repetitions and then switch sides.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [14],
      "secondary_muscles": []
    }
  },
  {
    "pk": 85,
    "fields": {
      "name": "Good Morning",
      "steps": "<ol>\n  <li>Start by standing with your feet shoulder-width apart and your toes pointing forward.</li>\n  <li>Place your hands behind your head, or on a weighted barbell on your shoulders, with your elbows pointing out to the sides.</li>\n  <li>Keeping your back straight and your core engaged, hinge forward at your hips, pushing your butt back as far as possible.</li>\n  <li>Lower your torso until it is nearly parallel to the ground, or until you feel a stretch in your hamstrings.</li>\n  <li>Pause for a moment, then slowly return to the starting position by squeezing your glutes and pushing your hips forward.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [18]
    }
  },
  {
    "pk": 86,
    "fields": {
      "name": "Chin-Up",
      "steps": "<ol>\n  <li>Stand underneath a chin-up bar with your feet shoulder-width apart.</li>\n  <li>Reach up and grasp the bar with an underhand grip, with your palms facing towards you and your hands shoulder-width apart.</li>\n  <li>Hang from the bar with your arms fully extended and your shoulders relaxed.</li>\n  <li>Engage your back muscles and pull your body up towards the bar, keeping your elbows close to your body.</li>\n  <li>Continue pulling until your chin is above the bar.</li>\n  <li>Pause briefly at the top of the movement, then slowly lower yourself back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9],
      "secondary_muscles": [2, 5, 13, 14, 15]
    }
  },
  {
    "pk": 87,
    "fields": {
      "name": "Wrist Extension – Barbell",
      "steps": "<ol>\n  <li>Hold a barbell with an overhand grip, with your hands shoulder-width apart.</li>\n  <li>Sit on a bench with your feet shoulder-width apart.</li>\n  <li>Rest the barbell on the top of your thighs, with your palms facing down.</li>\n  <li>Slowly lift the barbell by extending your wrists, keeping your elbows stationary. Focus on bringing your knuckles back towards the top of your forearms.</li>\n  <li>Hold the barbell at the top of the movement for a moment.</li>\n  <li>Lower the barbell back down to the starting position by flexing your wrists.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [6],
      "secondary_muscles": []
    }
  },
  {
    "pk": 88,
    "fields": {
      "name": "Rack Pull",
      "steps": "<ol>\n  <li>Set up a barbell in a power rack at knee height or slightly above.</li>\n  <li>Stand with your feet shoulder-width apart and your shins touching the bar.</li>\n  <li>Grasp the bar with an overhand grip, slightly wider than shoulder-width apart.</li>\n  <li>Engage your core and lift the bar by extending your hips and knees.</li>\n  <li>Keep your back straight and your shoulders pulled back throughout the movement.</li>\n  <li>Lower the bar back down to the starting position by bending your hips and knees.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "With its elevated starting point, the Rack Pull is an easier version of the Deadlift.",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 18, 20]
    }
  },
  {
    "pk": 89,
    "fields": {
      "name": "Front Raise – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing your thighs.</li>\n  <li>Keeping your arms straight, lift the dumbbells in front of you until they reach shoulder height.</li>\n  <li>Hold the position for a second, then slowly lower the dumbbells back down to your thighs.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17]
    }
  },
  {
    "pk": 90,
    "fields": {
      "name": "Standing Glute Kickback – Machine",
      "steps": "<ol>\n  <li>Adjust the machine to the appropriate height for your body.</li>\n  <li>Stand facing the machine with your feet shoulder-width apart and your hands holding onto the handles.</li>\n  <li>Engage your glutes and lift one leg straight back behind you, keeping it in line with your body.</li>\n  <li>Pause at the top of the movement and squeeze your glutes.</li>\n  <li>Lower your leg back down to the starting position and repeat on the other side.</li>\n  <li>Complete the desired number of repetitions on each leg.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 91,
    "fields": {
      "name": "Hang Snatch",
      "steps": "<ol>\n  <li>Start standing up with the barbell in an overhand grip, hands slightly wider than shoulder-width apart, resting against your thighs.</li>\n  <li>Quickly drop down into a quarter squat, then explosively extend your hips, knees, and ankles to jump upwards.</li>\n  <li>As you jump, pull the bar upwards with your arms, keeping it close to your body and using your momentum to bring it up to shoulder height.</li>\n  <li>Rotate your elbows around and under the bar, catching it in an overhead squat position with your arms fully extended and your feet shoulder-width apart.</li>\n  <li>Stand up to complete the lift</li>\n   <li>Lower the bar back down to the ground with control.</li>\n   <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3, 5, 8, 20]
    }
  },
  {
    "pk": 92,
    "fields": {
      "name": "Kneeling Ab Wheel Roll-Out",
      "steps": "<ol>\n  <li>Kneel on the floor with an ab wheel in front of you.</li>\n  <li>Place your hands on the ab wheel handles, shoulder-width apart.</li>\n  <li>Engage your core and slowly roll the ab wheel forward, keeping your arms straight and your back flat.</li>\n  <li>Continue rolling out until your body is fully extended and your arms are overhead.</li>\n  <li>Pause for a moment, then slowly roll the ab wheel back towards your knees.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 93,
    "fields": {
      "name": "Pull-Apart – Band",
      "steps": "<ol>\n  <li>Stand with feet shoulder-width apart and hold a resistance band with both hands.</li>\n  <li>Extend your arms straight out in front of you, keeping your palms facing down.</li>\n  <li>Begin pulling the band apart by squeezing your shoulder blades together.</li>\n  <li>Continue pulling until your hands are at shoulder height and the band is stretched tight.</li>\n  <li>Hold for a moment, then slowly release the tension and return to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [13, 15],
      "secondary_muscles": [14]
    }
  },
  {
    "pk": 94,
    "fields": {
      "name": "Frog Pumps – Dumbbell",
      "steps": "<ol>\n  <li>Start by lying on your back with your knees bent and feet flat on the ground.</li>\n  <li>Place a dumbbell on your lower abdomen and hold it in place with both hands.</li>\n  <li>Bring the soles of your feet together and allow your knees to fall out to the sides, creating a diamond shape with your legs.</li>\n  <li>Press your feet together and lift your hips up towards the ceiling, squeezing your glutes at the top of the movement.</li>\n  <li>Lower your hips back down to the ground.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 95,
    "fields": {
      "name": "Monkey Row",
      "steps": "<ol>\n  <li>Start in a standing position with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Hold a dumbbell in each hand with your palms facing each other and your arms extended by your sides.</li>\n  <li>Bend your elbows and pull the dumbbells up towards your armpits, keeping your elbows close to your body.</li>\n  <li>Pause at the top of the movement and squeeze your shoulder blades together.</li>\n  <li>Lower the dumbbells back down to the starting position.</li>\n   <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [17],
      "secondary_muscles": [2, 16, 20]
    }
  },
  {
    "pk": 96,
    "fields": {
      "name": "Decline Bench Press – Dumbbell",
      "steps": "<ol>\n  <li>Set up a decline bench at a 45-degree angle.</li>\n  <li>Grab a pair of dumbbells and lie down on the bench with your feet secured at the end.</li>\n  <li>Hold the dumbbells at chest level with your palms facing forward.</li>\n  <li>Lower the dumbbells slowly towards your chest, keeping your elbows at a 45-degree angle.</li>\n  <li>Pause for a moment, then push the dumbbells back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 97,
    "fields": {
      "name": "Pullover – Barbell",
      "steps": "<ol>\n  <li>Start by lying flat on a bench with your feet firmly on the ground and your head at the end of the bench.</li>\n  <li>Hold a barbell with an overhand grip, with your hands shoulder-width apart and your arms extended straight up at an angle that brings the barbell above your head.</li>\n  <li>Slowly lower the barbell towards the top of your head by bending your elbows, keeping your upper arms stationary and tension on your triceps.</li>\n  <li>Pause when the barbell is just above the top of your head, then slowly raise it back to the starting position by extending your arms.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": []
    }
  },
  {
    "pk": 98,
    "fields": {
      "name": "One-Legged Hip Thrust",
      "steps": "<ol>\n  <li>Begin by lying on your back with your knees bent and feet flat on the ground.</li>\n  <li>Extend one leg straight out, keeping it in line with your hip.</li>\n  <li>Place your hands on the ground by your sides for support.</li>\n  <li>Engage your glutes and lift your hips up towards the ceiling, keeping your extended leg straight.</li>\n  <li>Pause at the top of the movement, then slowly lower your hips back down to the ground.</li>\n  <li>Repeat for the desired number of reps, then switch legs.</li>\n</ol>",
      "notes": "Consider variations of this exercises where your back is on a bench and your feet are still on the floor, or adding weight to your hips.",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 99,
    "fields": {
      "name": "Reverse Fly – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing each other.</li>\n  <li>Bend forward at your hips, keeping your back straight and your core engaged.</li>\n  <li>Extend your arms straight down towards the floor, with your elbows slightly bent.</li>\n  <li>Keeping your arms straight, lift the dumbbells out to the sides until they reach shoulder height.</li>\n  <li>Pause for a moment, then slowly lower the dumbbells back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [13, 14, 15],
      "secondary_muscles": [20]
    }
  },
  {
    "pk": 100,
    "fields": {
      "name": "Curl – Dumbbell",
      "steps": "<ol>\n  <li>Stand up straight with your feet shoulder-width apart and your arms at your sides, holding a dumbbell in each hand.</li>\n  <li>Keeping your elbows close to your sides, slowly lift the dumbbells up towards your shoulders, rotating your palms to face your shoulders as you lift.</li>\n  <li>Pause for a moment at the top of the movement, squeezing your biceps.</li>\n  <li>Slowly lower the dumbbells back down to the starting position, rotating your palms back to face your thighs as you lower.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 101,
    "fields": {
      "name": "Torso Rotation Machine",
      "steps": "<ol>\n  <li>Adjust the seat and chest pad of the machine.</li>\n  <li>Kneel on the knee pad with your chest against the chest pad.</li>\n  <li>Grasp the handles with both hands and keep your elbows bent.</li>\n  <li>Rotate your torso to the left as far as you comfortably can, while keeping your hips and legs stationary.</li>\n  <li>Pause briefly at the end of the range of motion, then rotate your torso back to the starting position.</li>\n  <li>Repeat the rotation to the right side, and continue alternating sides for the desired number of repetitions or time.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": []
    }
  },
  {
    "pk": 102,
    "fields": {
      "name": "Seated Row – Machine",
      "steps": "<ol>\n  <li>Adjust the seat height so that the handles are at chest level.</li>\n  <li>Sit on the machine with your feet flat on the footrests and your knees slightly bent.</li>\n  <li>Grasp the handles with an overhand grip and keep your back straight.</li>\n  <li>Pull the handles towards your chest while keeping your elbows close to your body.</li>\n  <li>Pause for a moment and then slowly release the handles back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 13, 14]
    }
  },
  {
    "pk": 103,
    "fields": {
      "name": "Pullover – Dumbbell",
      "steps": "<ol>\n  <li>Begin by lying flat on a bench with your feet firmly planted on the ground.</li>\n  <li>Hold a dumbbell by the weight on one side with both hands and extend your arms straight above your chest.</li>\n  <li>Slowly lower the dumbbell behind your head, keeping your arms straight and your core engaged.</li>\n  <li>Pause when the dumbbell is parallel to the ground, then slowly lift it back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4],
      "secondary_muscles": [9]
    }
  },
  {
    "pk": 104,
    "fields": {
      "name": "Farmers Walk",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your core engaged.</li>\n  <li>Pick up a heavy weight in each hand, such as dumbbells or kettlebells.</li>\n  <li>Keep your shoulders down and your chest up as you walk forward, taking small, quick steps.</li>\n  <li>Make sure to keep your back straight and avoid leaning forward or backward.</li>\n  <li>Continue walking for a set distance or time, then carefully set the weights down.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5, 7, 11, 20],
      "secondary_muscles": [1, 3, 10, 12, 17]
    }
  },
  {
    "pk": 105,
    "fields": {
      "name": "Lunge – Bodyweight",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your hands on your hips.</li>\n  <li>Step forward with one leg, bending your knee until your thigh is parallel to the ground.</li>\n  <li>Keep your back straight and your core engaged.</li>\n  <li>Push through your front heel to return to the starting position.</li>\n  <li>Repeat with the other leg.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": []
    }
  },
  {
    "pk": 106,
    "fields": {
      "name": "Curl – Barbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Hold the barbell with an underhand grip, palms facing up, and your hands shoulder-width apart.</li>\n  <li>Keep your elbows close to your sides and curl the barbell up towards your chest, exhaling as you lift.</li>\n  <li>Pause at the top of the movement and squeeze your biceps.</li>\n  <li>Lower the barbell back down to the starting position, inhaling as you lower.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 107,
    "fields": {
      "name": "Dip – Bench",
      "steps": "<ol>\n  <li>Find a stable bench or chair and sit on the edge with your hands next to your hips, fingers pointing forward.</li>\n  <li>Slide your feet forward and lower your hips off the bench. Straighten or bend your knees to make the exercise more or less difficult.</li>\n  <li>Lower your body by bending your elbows until your upper arms are parallel to the ground.</li>\n  <li>Push yourself back up to the starting position by straightening your arms.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": [4, 16]
    }
  },
  {
    "pk": 108,
    "fields": {
      "name": "Horizontal Internal Shoulder Rotation – Dumbbell",
      "steps": "<ol>\n  <li>Lie on your back on a flat surface with a dumbbell nearby.</li>\n  <li>Raise one arm at the shoulder joint to your side so that your upper arm is perpendicular to your body. Bend your elbow at a 90-degree angle bringing your forearm perpendicular to the upper arm so that your hand is above your head on your supporting surface. This position is commonly known as as a single-arm \"cactus pose\".</li>\n  <li>Hold a dumbbell in your hand with your palm facing up towards the ceiling.</li>\n  <li>Slowly rotate your arm up towards the ceiling until it's perpendicular to the ground, keeping your elbow bent and your upper arm stationary.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower the dumbbell back to the starting position.</li>\n  <li>Repeat for the desired number of repetitions, then switch sides and repeat the exercise with your other arm.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [14],
      "secondary_muscles": []
    }
  },
  {
    "pk": 109,
    "fields": {
      "name": "Bar Hang",
      "steps": "<ol>\n  <li>Find a sturdy horizontal bar that can support your body weight.</li>\n  <li>Stand facing the bar and reach up to grab it with both hands, palms facing away from your body.</li>\n  <li>Jump or step up to lift your feet off the ground and hang from the bar with your arms fully extended.</li>\n  <li>Engage your shoulder blades and core muscles to maintain a stable position.</li>\n  <li>Hold the position for a desired amount of time.</li>\n  <li>To release, slowly lower your body down and step or jump off the bar.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5],
      "secondary_muscles": []
    }
  },
  {
    "pk": 110,
    "fields": {
      "name": "Rear Delt Row – Cable",
      "steps": "<ol>\n  <li>Attach a straight bar to a cable machine.</li>\n  <li>Sit facing the cable machine with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Grasp the bar with an overhand grip, with your hands slightly more than shoulder-width apart.</li>\n  <li>Lean forward slightly, keeping your back straight and your core engaged.</li>\n  <li>Pull the bar towards your upper chest, keeping your elbows wide and out to the sides.</li>\n  <li>Squeeze your shoulder blades together at the top of the movement.</li>\n  <li>Slowly release the bar back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [15],
      "secondary_muscles": [2, 5, 13, 20]
    }
  },
  {
    "pk": 111,
    "fields": {
      "name": "Goblet Squat",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell or kettlebell vertically against your chest with both hands, elbows pointing down.</li>\n  <li>Brace your core and lower your body as far as you can by pushing your hips back and bending your knees.</li>\n  <li>Pause, then push yourself back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3, 10]
    }
  },
  {
    "pk": 112,
    "fields": {
      "name": "Seated Shoulder Press – Dumbbell",
      "steps": "<ol>\n  <li>Start by sitting on a bench with a backrest, holding a dumbbell in each hand at shoulder level.</li>\n  <li>Ensure that your feet are firmly planted on the ground and your back is straight.</li>\n  <li>Press the dumbbells up above your head, extending your arms fully.</li>\n  <li>Pause briefly at the top of the movement, then slowly lower the dumbbells back down to shoulder level.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 113,
    "fields": {
      "name": "Deadlift – Trap Bar High Handles",
      "steps": "<ol>\n  <li>Begin by standing in the center of the trap bar with your feet shoulder-width apart.</li>\n  <li>Grab the high handles of the trap bar with an overhand grip.</li>\n  <li>Brace your core and lift the trap bar by extending your hips and knees.</li>\n  <li>Keep your back straight and your shoulders pulled back throughout the lift.</li>\n  <li>Once you reach a standing position, slowly lower the trap bar back down to the ground.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 114,
    "fields": {
      "name": "Shallow Lunge – Bodyweight",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your hands on your hips.</li>\n  <li>Step forward with one leg, bending your knee until your thigh is parallel to the ground.</li>\n  <li>Keep your back straight and your core engaged.</li>\n  <li>Push through your front heel to return to the starting position.</li>\n  <li>Repeat with the other leg.</li>\n</ol>",
      "notes": "Remember to keep the lunge shallow. Your back knee should stay several inches above the ground. This exercise is an easier version of the Body Weight Lunge.",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [8]
    }
  },
  {
    "pk": 115,
    "fields": {
      "name": "Sumo Deadlift – Barbell",
      "steps": "<ol>\n  <li>Stand with feet wider than shoulder-width apart and toes pointed outwards.</li>\n  <li>Place hands on the barbell with a grip wider than shoulder-width apart and palms facing down.</li>\n  <li>Engage core and lift the barbell off the ground, keeping back straight and knees bent.</li>\n  <li>As you lift, push hips forward and straighten legs.</li>\n  <li>Lower the barbell back down to the ground, keeping back straight and knees bent.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 12, 18, 20]
    }
  },
  {
    "pk": 116,
    "fields": {
      "name": "Twist – Cable",
      "steps": "<ol>\n  <li>Stand with your left foot in front of your right, knees slightly bent, facing away from the cable machine.</li>\n  <li>Rotate and reach to your right, behind you, and grab the cable handle with both hands. Your left arm should be straight across your body and behind you.</li>\n  <li>Rotate your torso left until you're facing forward, pulling the cable across your body.</li>\n  <li>Pause briefly at the end of the movement, then slowly rotate back to the starting position.</li>\n  <li>Repeat for the desired number of reps and then switch sides.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 117,
    "fields": {
      "name": "Seated Leg Curl",
      "steps": "<ol>\n  <li>Adjust the machine to fit your body size and leg length.</li>\n  <li>Sit on the machine with your back against the backrest and your legs straight out in front of you.</li>\n  <li>Place your ankles over the padded bar and grasp the handles on the sides of the seat for support.</li>\n  <li>Bend your knees and curl your legs towards your buttocks, keeping your back straight and your feet flexed.</li>\n  <li>Pause briefly at the bottom of the movement, then slowly straighten your legs back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [8],
      "secondary_muscles": []
    }
  },
  {
    "pk": 118,
    "fields": {
      "name": "Hanging Knee Raise",
      "steps": "<ol>\n  <li>Hang from a pull-up bar with your arms straight and your palms facing away from your body.</li>\n  <li>Engage your core muscles and lift your knees up towards your chest, keeping your legs together.</li>\n  <li>Pause briefly at the top of the movement, squeezing your abs.</li>\n  <li>Slowly lower your legs back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 119,
    "fields": {
      "name": "Push Press – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell in each hand at shoulder level with your palms facing your head.</li>\n  <li>Bend your knees slightly and dip your body down.</li>\n  <li>Quickly straighten your legs and use the momentum to push the dumbbells overhead.</li>\n  <li>Lock out your arms at the top of the movement.</li>\n  <li>Lower the dumbbells back down to shoulder level and repeat for desired number of reps.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [1, 7, 9, 10, 12, 20, 21]
    }
  },
  {
    "pk": 120,
    "fields": {
      "name": "Push Press – Barbell",
      "steps": "<ol>\n  <li>Start with the barbell resting on your front shoulders, with your feet shoulder-width apart.</li>\n  <li>Bend your knees slightly and dip your hips down, then explosively extend your legs and push the barbell up overhead.</li>\n  <li>As the barbell reaches the top of the movement, press it up and lock out your arms.</li>\n  <li>Lower the barbell back down to your shoulders and repeat for the desired number of reps.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [7, 10, 12, 17, 20, 21]
    }
  },
  {
    "pk": 121,
    "fields": {
      "name": "Tricep Extension – Bodyweight",
      "steps": "<ol>\n  <li>Set a stationary bar (ex. Smith Machine) at hip height</li>\n  <li>Stand with your feet shoulder-width, lean forward, and grab the bar with your arms in front of you.</li>\n  <li>Bend your elbows and lower your head forward and below the bar. Keep your elbows close to your ears.</li>\n  <li>Squeeze your triceps to extend your arms to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": []
    }
  },
  {
    "pk": 122,
    "fields": {
      "name": "Horizontal Wood Chop – Band",
      "steps": "<ol>\n  <li>Attach a resistance band to a sturdy anchor point at waist height.</li>\n  <li>Stand perpendicular to the anchor point with feet shoulder-width apart and knees slightly bent.</li>\n  <li>Hold the resistance band with both hands and extend arms out in front of the body.</li>\n  <li>Rotate the torso and pull the band across the body towards the opposite hip.</li>\n  <li>Keep the arms straight and engage the core muscles throughout the movement.</li>\n  <li>Slowly return to the starting position</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": []
    }
  },
  {
    "pk": 123,
    "fields": {
      "name": "Kneeling Push-Up",
      "steps": "<ol>\n  <li>Start on your hands and knees, with your hands shoulder-width apart and your knees hip-width apart.</li>\n  <li>Extend your legs behind you, so that your body forms a straight line from your head to your heels.</li>\n  <li>Engage your core and glutes to keep your body in a straight line.</li>\n  <li>Lower your body towards the ground by bending your elbows, keeping them close to your body.</li>\n  <li>Pause when your chest is just above the ground.</li>\n  <li>Push yourself back up to the starting position by straightening your arms.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  },
  {
    "pk": 124,
    "fields": {
      "name": "Side Kicks – Band",
      "steps": "<ol>\n  <li>Stand with your feet hip-width apart and a resistance band around your ankles.</li>\n  <li>Engage your core and lift one leg out to the side, keeping it straight and the foot flexed.</li>\n  <li>Pause at the top of the movement, then slowly lower the leg back down to the starting position.</li>\n  <li>Repeat for the desired number of reps, then switch sides.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [19],
      "secondary_muscles": [7]
    }
  },
  {
    "pk": 125,
    "fields": {
      "name": "Lateral Raise – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing inward.</li>\n  <li>Keep your arms straight and lift them out to the sides until they are parallel to the floor.</li>\n  <li>Pause for a moment, then slowly lower the dumbbells back down to your sides.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [17],
      "secondary_muscles": [16]
    }
  },
  {
    "pk": 126,
    "fields": {
      "name": "Front Raise – Barbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Hold a barbell with an overhand grip, hands shoulder-width apart, and the bar resting on your thighs.</li>\n  <li>Keeping your arms straight, lift the barbell up in front of you until it reaches shoulder height.</li>\n  <li>Pause for a moment, then slowly lower the barbell back down to your thighs.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17]
    }
  },
  {
    "pk": 127,
    "fields": {
      "name": "One-Handed Row – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Hold a dumbbell in one hand with your palm facing your body.</li>\n  <li>Bend forward at the waist, keeping your back straight and your abs engaged.</li>\n  <li>Let the dumbbell hang straight down towards the floor.</li>\n  <li>Exhale and pull the dumbbell up towards your chest, keeping your elbow close to your body.</li>\n  <li>Squeeze your shoulder blades together at the top of the movement.</li>\n  <li>Inhale and slowly lower the dumbbell back down towards the floor.</li>\n  <li>Repeat for the desired number of reps, then switch sides and repeat.</li>\n</ol>",
      "notes": "Brace yourself against a bench with your free hand to take some of the effort off your lower back.",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 13, 14]
    }
  },
  {
    "pk": 128,
    "fields": {
      "name": "Roll-Up",
      "steps": "<ol>\n  <li>Lie on your back with your arms extended overhead and your legs straight.</li>\n  <li>Engage your core and slowly lift your head, neck, and shoulders off the ground.</li>\n  <li>Continue to roll up, reaching your arms towards your toes and keeping your legs straight.</li>\n  <li>Pause at the top of the movement, then slowly roll back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": []
    }
  },
  {
    "pk": 129,
    "fields": {
      "name": "Inverted Row",
      "steps": "<ol>\n  <li>Set up a bar at waist height on a squat rack or Smith machine.</li>\n  <li>Grab the bar with an overhand grip, hands shoulder-width apart.</li>\n  <li>Hang from the bar with your arms fully extended and your body in a straight line.</li>\n  <li>Pull your chest up to the bar while keeping your body straight.</li>\n  <li>Lower yourself back down to the starting position with control.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 13, 14]
    }
  },
  {
    "pk": 130,
    "fields": {
      "name": "Crunch",
      "steps": "<ol>\n  <li>Start by lying flat on your back with your knees bent and feet flat on the ground.</li>\n  <li>Place your hands behind your head, with your elbows pointing outwards.</li>\n  <li>Engage your core muscles by pulling your belly button towards your spine.</li>\n  <li>Lift your head, neck, and shoulders off the ground, while keeping your lower back pressed into the floor.</li>\n  <li>Hold the contraction for a few seconds, then slowly lower yourself back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 131,
    "fields": {
      "name": "One-Handed Tricep Extension – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell in one hand.</li>\n  <li>Extend your arm straight up, holding the dumbbell above your head.</li>\n  <li>Bend your elbow and lower the dumbbell behind your head, keeping your upper arm stationary.</li>\n  <li>Pause for a moment, then extend your arm back up to the starting position.</li>\n  <li>Repeat for the desired number of reps, then switch to the other arm.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": []
    }
  },
  {
    "pk": 132,
    "fields": {
      "name": "Close-Grip Push-Up",
      "steps": "<ol>\n  <li>Start in a plank position with your hands under your shoulders and your fingers pointing forward.</li>\n  <li>Lower your body towards the ground, keeping your elbows close to your sides.</li>\n  <li>Push back up to the starting position, keeping your core engaged and your body in a straight line.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": [1, 4, 16]
    }
  },
  {
    "pk": 133,
    "fields": {
      "name": "Behind the Neck Press – Barbell",
      "steps": "<ol>\n  <li>Start by standing at a barbell rack with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Grasp the barbell with a wide grip, with your palms facing forward and your hands slightly wider than your shoulders.</li>\n  <li>Lift the barbell up and bring it behind your head, resting it on your upper traps.</li>\n  <li>Press the barbell up towards the ceiling, keeping your elbows pointed out to the sides.</li>\n  <li>Lower the barbell back down to the starting position behind your head.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16, 17],
      "secondary_muscles": [20, 21]
    }
  },
  {
    "pk": 134,
    "fields": {
      "name": "Power Clean",
      "steps": "<ol>\n  <li>Start with feet shoulder-width apart and grip the barbell with an overhand grip, hands slightly wider than shoulder-width apart.</li>\n  <li>Lower your hips and bend your knees, keeping your back straight and your chest up.</li>\n  <li>Explosively extend your hips and knees, pulling the barbell up towards your shoulders.</li>\n  <li>As the barbell reaches your chest, drop your elbows and rotate your wrists, catching the barbell on your shoulders in a front squat position.</li>\n  <li>Stand up with the barbell, keeping your core tight and your chest up.</li>\n  <li>Lower the barbell back down to the starting position, either by dropping it or by reversing the movement.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 12, 18, 20]
    }
  },
  {
    "pk": 135,
    "fields": {
      "name": "Deficit Deadlift",
      "steps": "<ol>\n  <li>Begin by standing on a raised platform or weight plates of optional height, with your feet hip-width apart and your toes pointing forward.</li>\n  <li>Position the barbell in front of you, with your hands shoulder-width apart and your palms facing down.</li>\n  <li>Engage your core and hinge at the hips, lowering your torso towards the ground while keeping your back straight and your chest lifted.</li>\n  <li>As you lower your torso, grip the barbell and lift it off the ground, keeping your arms straight and your shoulders pulled back.</li>\n  <li>Drive through your heels and lift the barbell up towards your hips, keeping your back straight and your core engaged.</li>\n  <li>Lower the barbell back down to the ground with control</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 12, 18, 20]
    }
  },
  {
    "pk": 136,
    "fields": {
      "name": "Wrist Curl – Barbell",
      "steps": "<ol>\n  <li>Start by sitting on a bench with your forearms resting on your knees and your palms facing up.</li>\n  <li>Hold a barbell with an underhand grip, with your hands shoulder-width apart.</li>\n  <li>Slowly lift the barbell towards your forearms by curling your wrists.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower the barbell back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5],
      "secondary_muscles": []
    }
  },
  {
    "pk": 137,
    "fields": {
      "name": "Crunch – Cable",
      "steps": "<ol>\n  <li>Attach a rope handle to a high pulley cable machine.</li>\n  <li>Adjust the weight to a comfortable level.</li>\n  <li>Kneel on a mat facing the machine and grab the rope handle with both hands.</li>\n  <li>Position yourself so that your hands hold the rope by each ear and the cable is behind your neck, above you.</li>\n  <li>Engage your core and pull the rope towards your knees.</li>\n  <li>Hold the contraction for a few seconds and slowly release back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 138,
    "fields": {
      "name": "Decline Sit-Up",
      "steps": "<ol>\n  <li>Position yourself on a decline bench with your feet securely locked in place.</li>\n  <li>Place your hands behind your head or across your chest.</li>\n  <li>Engage your core and slowly lift your upper body towards your knees.</li>\n  <li>Pause briefly at the top of the movement, then slowly lower your upper body back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 139,
    "fields": {
      "name": "Flutter Kick",
      "steps": "<ol>\n  <li>Lie on your back with your legs straight and your arms by your sides or underneath your lower back.</li>\n  <li>Lift both legs off the ground.</li>\n  <li>Begin rapidly fluttering your legs up and down.</li>\n  <li>Keep your core engaged and your gaze towards the ceiling.</li>\n  <li>Continue fluttering for the desired amount of time or repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [10, 12]
    }
  },
  {
    "pk": 140,
    "fields": {
      "name": "Dead Bug",
      "steps": "<ol>\n  <li>Start by lying on your back with your arms extended towards the ceiling.</li>\n  <li>Bend your knees and lift your legs up so that your knees are directly above your hips and your shins are parallel to the floor.</li>\n  <li>Engage your core muscles and slowly lower your right arm and left leg towards the floor, keeping them hovering just above the ground.</li>\n  <li>Return your arm and leg to the starting position and repeat on the opposite side.</li>\n  <li>Continue alternating sides for the desired number of repetitions or time.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 141,
    "fields": {
      "name": "Chest Press – Machine",
      "steps": "<ol>\n  <li>Adjust the seat height so that the handles are at chest level.</li>\n  <li>Select the appropriate weight on the weight stack.</li>\n  <li>Sit on the machine with your back flat against the backrest and your feet flat on the floor.</li>\n  <li>Grasp the handles with an overhand grip and push them away from your chest until your arms are fully extended.</li>\n  <li>Slowly lower the handles back towards your chest, keeping your elbows at a 90-degree angle.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 142,
    "fields": {
      "name": "Gripper",
      "steps": "<ol>\n  <li>Adjust the gripper machine to the desired resistance level.</li>\n  <li>Hold the gripper in one hand with a firm grip, making sure your fingers are comfortably positioned on the handles.</li>\n  <li>Keep your wrist and forearm in a neutral position to avoid unnecessary strain.</li>\n  <li>Start by squeezing the handles together using your hand strength.</li>\n  <li>Continue to squeeze the handles as forcefully as you can, engaging your grip muscles.</li>\n  <li>Hold the maximum contraction for a few seconds to fully activate your muscles.</li>\n  <li>Slowly release the tension and allow the handles to return to the starting position.</li>\n  <li>Repeat the squeezing and releasing motion for the desired number of repetitions.</li>\n  <li>Switch to the other hand and repeat the exercise to work both hands equally.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5],
      "secondary_muscles": []
    }
  },
  {
    "pk": 143,
    "fields": {
      "name": "Lying External Shoulder Rotation – Dumbbell",
      "steps": "<ol>\n  <li>Lie on your side on a flat bench. Rest the upper part of your top along your torso. Extend your forearm straight out in front of you with your elbow bent at a 90-degree angle.</li>\n  <li>Hold a dumbbell in your top hand with your palm facing down.</li>\n  <li>Keeping your elbow against your side, slowly rotate your arm upward as far as possible without removing your elbow from your side.</li>\n  <li>Pause for a moment, then slowly lower the dumbbell back down to the starting position.</li>\n  <li>Repeat for the desired number of repetitions, then switch sides and repeat with the other arm.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [13],
      "secondary_muscles": []
    }
  },
  {
    "pk": 144,
    "fields": {
      "name": "Overhead Tricep Extension – Cable With Rope",
      "steps": "<ol>\n  <li>Attach a rope to a cable machine at a low setting.</li>\n  <li>Face the machine and grab the rope with an overhand grip.</li>\n  <li>Twist away from the machine while raising the rope over your head. End facing away from the machine with your elbows near your ears and the cable parallel with your spine./li>\n  <li>Keep your elbows close to your head and your upper arms stationary.</li>\n  <li>Extend your forearms down until your arms are fully extended.</li>\n  <li>Pause for a moment and then slowly return to the starting position.</li>\n  <li>Repeat for desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": []
    }
  },
  {
    "pk": 145,
    "fields": {
      "name": "Snatch Grip Deadlift",
      "steps": "<ol>\n  <li>Begin by standing with your feet shoulder-width apart and the barbell on the ground in front of you.</li>\n  <li>Take a wide grip on the barbell, with your hands outside of your shoulders.</li>\n  <li>Lower your hips and bend your knees, keeping your back straight and your chest up.</li>\n  <li>Engage your core and lift the barbell off the ground, keeping it close to your body.</li>\n  <li>As you lift the barbell, extend your hips and knees to stand up straight.</li>\n  <li>Once you are standing, pause briefly and then lower the barbell back down to the ground, keeping it close to your body.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 12, 18, 20]
    }
  },
  {
    "pk": 146,
    "fields": {
      "name": "Towel Pull-Up",
      "steps": "<ol>\n  <li>Find a sturdy horizontal bar that can support your body weight.</li>\n  <li>Fold a single large towel or two hand towels in half and drape them over the bar.</li>\n  <li>Grab the ends of the towel with both hands, palms facing each other.</li>\n  <li>Hang from the bar with your arms fully extended and your feet off the ground.</li>\n  <li>Pull yourself up towards the bar by bending your elbows and squeezing your shoulder blades together.</li>\n  <li>Pause at the top of the movement, with your chin above the bar.</li>\n  <li>Lower yourself back down to the starting position with control.</li>\n  <li>Repeat for desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5, 9],
      "secondary_muscles": [2, 13, 14, 15]
    }
  },
  {
    "pk": 147,
    "fields": {
      "name": "Oblique Crunch",
      "steps": "<ol>\n  <li>Start by lying on your back with your knees bent and feet flat on the ground.</li>\n  <li>Place your hands behind your head, with your elbows pointing out to the sides.</li>\n  <li>Engage your core muscles and lift your shoulders off the ground, twisting your torso to the right.</li>\n  <li>Bring your right elbow towards your left knee.</li>\n  <li>Lower your shoulders back down to the ground and repeat on the other side, twisting your torso to the left and bringing your left elbow towards your right knee.</li>\n  <li>Continue alternating sides for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 148,
    "fields": {
      "name": "Lying Windshield Wiper with Bent Knees",
      "steps": "<ol>\n  <li>Start by lying flat on your back with your arms extended out to the sides and your palms facing down.</li>\n  <li>Bend your knees and lift your feet off the ground, keeping your shins parallel to the floor.</li>\n  <li>Slowly lower your legs to one side, keeping your knees bent and your feet together.</li>\n  <li>Pause for a moment, then use your core muscles to lift your legs back to the starting position.</li>\n  <li>Repeat the movement to the other side, alternating sides for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 149,
    "fields": {
      "name": "Push-Up – Hands in Rings",
      "steps": "<ol>\n  <li>Start in a plank position with your hands placed inside suspended rings.</li>\n  <li>Engage your core and glutes to keep your body in a straight line.</li>\n  <li>Lower your body towards the ground by bending your elbows.</li>\n  <li>Keep your elbows close to your body and your shoulders down and back.</li>\n  <li>Push yourself back up to the starting position by straightening your arms.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  },
  {
    "pk": 150,
    "fields": {
      "name": "One-Handed Bar Hang",
      "steps": "<ol>\n  <li>Find a sturdy bar that can support your weight.</li>\n  <li>Jump up and grab the bar with one hand.</li>\n  <li>Hold the position for as long as you can.</li>\n  <li>Slowly lower yourself down and release your grip on the bar.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5],
      "secondary_muscles": []
    }
  },
  {
    "pk": 151,
    "fields": {
      "name": "Standing Shoulder Press – Barbell",
      "steps": "<ol>\n  <li>Start by standing with your feet shoulder-width apart, looking at a racked, weighted barbell.</li>\n  <li>Raise the barbell to shoulder height, palms facing forward, and elbows bent.</li>\n  <li>Press the barbell upward until your arms are fully extended above your head.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower the barbell back down to shoulder height.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 152,
    "fields": {
      "name": "Close Grip Seated Row",
      "steps": "<ol>\n  <li>Adjust the cable machine to the appropriate weight and attach a V-bar handle to the cable.</li>\n  <li>Sit on the machine with your feet flat on the footrests and your knees slightly bent.</li>\n  <li>Grasp the V-bar handle with an overhand grip, with your hands close together.</li>\n  <li>Keep your back straight and your shoulders down and back.</li>\n  <li>Pull the V-bar handle towards your abdomen, keeping your elbows close to your body.</li>\n  <li>Squeeze your shoulder blades together at the end of the movement.</li>\n  <li>Slowly release the handle back to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 13, 14]
    }
  },
  {
    "pk": 153,
    "fields": {
      "name": "Power Clean and Press",
      "steps": "<ol>\n  <li>Start with feet shoulder-width apart and the barbell on the floor in front of you.</li>\n  <li>Bend down and grip the barbell with hands slightly wider than shoulder-width apart.</li>\n  <li>Stand up, keeping your back straight, the barbell close to your shins, and lifting with your legs.</li>\n  <li>As the barbell reaches your chest, quickly drop into a high squat position. The crease of your hips should be above the top of your thighs. Catch the barbell at shoulder height.</li>\n  <li>Stand up from the squat position, lifting the barbell overhead with arms fully extended.</li>\n  <li>Lower the barbell back down to shoulder height.</li>\n  <li>Reverse the movement and lower the barbell back down to the floor and release your grip.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 16, 18],
      "secondary_muscles": [3, 5, 8, 17, 20, 21]
    }
  },
  {
    "pk": 154,
    "fields": {
      "name": "Snatch",
      "steps": "<ol>\n  <li>Start with feet shoulder-width apart and toes pointing slightly outward.</li>\n  <li>Place hands on the barbell with a wide grip, palms facing down.</li>\n  <li>Lower your hips and bend your knees, keeping your back straight.</li>\n  <li>Drive through your legs and hips, pulling the barbell up to your chest.</li>\n  <li>As the barbell reaches chest height, quickly extend your arms and legs, pulling the barbell up and overhead.</li>\n  <li>Lock out your arms and stand up straight, holding the barbell overhead.</li>\n  <li>Lower the barbell back down to the starting position by reversing the movement.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3, 5, 8, 20]
    }
  },
  {
    "pk": 155,
    "fields": {
      "name": "Hammer Curl",
      "steps": "<ol>\n  <li>Stand up straight with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing your body.</li>\n  <li>Keep your elbows close to your torso and exhale as you lift both dumbbells towards the shoulder of their holding hand, until your bicep is fully contracted and the dumbbell is at shoulder level..</li>\n  <li>Pause for a second at the top of the movement and squeeze your biceps.</li>\n  <li>Lower the dumbbells back down to the starting position in a controlled manner.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 156,
    "fields": {
      "name": "Hip Abduction – Band",
      "steps": "<ol>\n  <li>Start by placing an exercise band around both of your knees. Make sure the band is secure and does not slip during the exercise.</li>\n  <li>Sit on a bench with your feet hip-width apart and your toes pointing forward.</li>\n  <li>Exhale as you slowly press your knees outward, against the resistance of the exercise band.</li>\n  <li>Continue pressing until you feel a comfortable stretch in your outer hip and thigh muscles.</li>\n   <li>Pause for a brief moment at the outwardmost position, feeling the tension in the exercise band.</li>\n  <li>Inhale as you release the pressure and bring your knees back together, returning to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [19],
      "secondary_muscles": [7]
    }
  },
  {
    "pk": 157,
    "fields": {
      "name": "Seated One-Handed Row – Cable",
      "steps": "<ol>\n<li>Sit facing a cable machine with your feet flat on the ground or footrests.</li>\n<li>Grasp the handle with one hand, palm facing inward.</li>\n<li>Use your feet to push your body back, creating tension on the cable, keeping your arm fully extended.</li>\n<li>Engage your core while leaning slightly forward.</li>\n<li>Pull the handle towards your torso, keeping your elbow close to your body.</li>\n<li>Squeeze your shoulder blades together while leaning slightly back.</li>\n<li>Pause for a moment at the top of the movement, feeling the contraction in your back muscles.</li>\n<li>Slowly extend your arm back to the starting position, maintaining control throughout the movement.</li>\n<li>Repeat for the desired number of repetitions, then switch to the other hand.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 13, 14]
    }
  },
  {
    "pk": 158,
    "fields": {
      "name": "Lunge – Dumbbell",
      "steps": "<ol>\n<li>Stand with your feet hip-width apart and hold a dumbbell in each hand, palms facing your body.</li>\n<li>Take a big step forward with your right foot, keeping your torso upright.</li>\n<li>Bend both knees to lower your body towards the floor, making sure your right knee is directly above your ankle.</li>\n<li>Push through your right heel to return to the starting position.</li>\n<li>Repeat on the other side, stepping forward with your left foot.</li>\n<li>Continue alternating legs for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 159,
    "fields": {
      "name": "Cable Curl – Bar",
      "steps": "<ol>\n  <li>Stand facing a cable machine with your feet shoulder-width apart.</li>\n  <li>Attach a straight bar to the low pulley of the cable machine.</li>\n  <li>Grasp the bar with an underhand grip, hands shoulder-width apart.</li>\n  <li>Keep your elbows close to your sides and your upper arms stationary throughout the exercise.</li>\n  <li>Exhale and curl the bar up towards your shoulders, contracting your biceps.</li>\n  <li>Pause for a moment at the top of the movement, squeezing your biceps.</li>\n  <li>Inhale and slowly lower the bar back to the starting position, fully extending your arms.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 160,
    "fields": {
      "name": "Landmine Hack Squat",
      "steps": "<ol>\n<li>Stand with your feet shoulder-width apart, toes slightly turned out.</li>\n  <li>Place the end of a barbell into a landmine attachment or securely anchor it in a corner.</li>\n  <li>Hold the other end of the barbell with both hands, palms facing inwards. Lift the end up and over one shoulder while you turn away from the weight. Rest the barbell on your shoulder with the weight at your back.</li>\n  <li>Keep your core engaged, chest lifted, and back straight.</li>\n<li>Lower your body by bending at the knees and hips, as if sitting back into a chair.</li>\n<li>Continue lowering until your thighs are parallel to the ground or slightly below.</li>\n<li>Push through your heels and extend your knees and hips to return to the starting position.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": []
    }
  },
  {
    "pk": 161,
    "fields": {
      "name": "Concentration Curl",
      "steps": "<ol>\n  <li>Start by sitting on a bench with your feet flat on the floor and your knees slightly bent.</li>\n  <li>Hold a dumbbell in one hand and place your elbow on the inside of your thigh, just above the knee.</li>\n  <li>Extend your arm fully, allowing the dumbbell to hang down towards the floor.</li>\n  <li>Keeping your upper arm stationary, exhale and curl the dumbbell towards your shoulder while contracting your biceps.</li>\n  <li>Pause for a moment at the top of the movement, squeezing your biceps.</li>\n  <li>Inhale and slowly lower the dumbbell back to the starting position, fully extending your arm.</li>\n  <li>Repeat for the desired number of repetitions and then switch arms.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 162,
    "fields": {
      "name": "One-Handed Tricep Pushdown – Cable",
      "steps": "<ol>\n  <li>Stand facing a cable machine with your feet shoulder-width apart.</li>\n  <li>Grasp the cable attachment with one hand, palm facing down.</li>\n  <li>Position your elbow at a 90-degree angle and keep it close to your side.</li>\n  <li>Engage your core and maintain a neutral spine.</li>\n  <li>Exhale and extend your arm down, fully straightening your elbow.</li>\n  <li>Pause for a moment, squeezing your tricep muscle.</li>\n  <li>Inhale and slowly return your arm to the starting position, maintaining control.</li>\n  <li>Repeat for the desired number of repetitions and then switch arms.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": []
    }
  },
  {
    "pk": 163,
    "fields": {
      "name": "Hip Thrust – Machine",
      "steps": "<ol>\n  <li>Adjust the machine to the appropriate height and resistance level.</li>\n<li>Sit on the machine with your back against the backrest and your feet flat on the foot platform.</li>\n  <li>Engage your core and glutes, then press through your heels to extend your hips forward.</li>\n  <li>Continue to drive your hips forward until your body is in a straight line from your knees to your shoulders.</li>\n  <li>Hold the position for a brief moment, focusing on squeezing your glutes.</li>\n  <li>Slowly lower your hips back down to the starting position, maintaining control throughout the movement.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 164,
    "fields": {
      "name": "Weighted Crunch",
      "steps": "<ol>\n  <li>Start by lying on your back on a mat or bench with your knees bent and feet flat on the ground.</li>\n  <li>Hold a weight plate, dumbbell, or medicine ball against your chest with both hands.</li>\n  <li>Engage your core muscles by drawing your belly button in towards your spine.</li>\n  <li>Slowly lift your head, neck, and shoulders off the ground, while keeping your lower back pressed into the mat.</li>\n  <li>Exhale as you crunch up, focusing on contracting your abdominal muscles.</li>\n  <li>Hold the crunch position for a brief moment, squeezing your abs.</li>\n  <li>Inhale as you slowly lower your upper body back down to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": []
    }
  },
  {
    "pk": 165,
    "fields": {
      "name": "Squat Jerk",
      "steps": "<ol>\n  <li>Start with your feet shoulder-width apart and toes slightly turned out.</li>\n  <li>Get into position by cleaning the barbell or lifting it from a rack at shoulder height with an overhand grip.</li>\n  <li>Drop your body into a deep squat position, keeping your chest up and back straight, while pushing the barbell above your head, extending your arms fully.</li>\n  <li>As you reach the bottom of the squat, explosively drive through your legs and hips to stand up.</li>\n  <li>Lock out your elbows and stabilize the weight overhead.</li>\n  <li>Lower the weight back down to shoulder height and repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 16, 18],
      "secondary_muscles": [3, 17, 20, 21]
    }
  },
  {
    "pk": 166,
    "fields": {
      "name": "Seated Calf Raise",
      "steps": "<ol>\n  <li>Adjust the seat height and position yourself on the calf raise machine with your feet flat on the foot platform.</li>\n  <li>Place your thighs under the leg pad and ensure that your knees are slightly bent.</li>\n  <li>Grasp the handles or sides of the machine for stability.</li>\n  <li>Slowly raise your heels by extending your ankles as far as possible while keeping your toes on the foot platform.</li>\n  <li>Hold the contracted position for a brief moment, feeling the stretch in your calves.</li>\n  <li>Lower your heels back down to the starting position, allowing your calves to stretch.</li>\n  <li>Repeat the movement for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [3],
      "secondary_muscles": []
    }
  },
  {
    "pk": 167,
    "fields": {
      "name": "Split Jerk",
      "steps": "<ol>\n  <li>Start with the barbell resting on your shoulders, hands slightly wider than shoulder-width apart.</li>\n  <li>Bend your knees and lower your body into a partial squat, keeping your back straight and core engaged.</li>\n  <li>Drive through your legs and explosively push the barbell overhead, extending your arms fully.</li>\n  <li>As the barbell reaches its peak, quickly split your legs, with one foot moving forward and the other moving backward into a high lunge position.</li>\n  <li>Stabilize your body and hold the split position for a moment.</li>\n  <li>Stand back up by bringing your front and back feet back to the position where they started.</li>\n  <li>Lower the barbell back to your shoulders and repeat the movement for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [7, 10, 12, 17, 18, 20, 21]
    }
  },
  {
    "pk": 168,
    "fields": {
      "name": "Seated Snatch Grip Behind the Neck Press",
      "steps": "<ol>\n  <li>Start by sitting on a bench with a backrest, next to a racked, weighted barbell.</li>\n  <li>Grip the barbell with a wide snatch grip.</li>\n  <li>Position the barbell behind your neck, resting it on your upper traps.</li>\n  <li>Engage your core and keep your back straight.</li>\n  <li>Press the barbell overhead by extending your arms and pushing the weight up.</li>\n  <li>Lock out your elbows at the top of the movement.</li>\n  <li>Lower the barbell back down to the starting position behind your neck.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16, 17],
      "secondary_muscles": [20, 21]
    }
  },
  {
    "pk": 169,
    "fields": {
      "name": "Standing Snatch Grip Behind the Neck Press",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and grip the barbell with a wide snatch grip.</li>\n  <li>Position the barbell behind your neck, resting it on your upper traps.</li>\n  <li>Engage your core and keep your back straight.</li>\n  <li>Press the barbell overhead by extending your arms and pushing the weight up.</li>\n  <li>Lock out your elbows at the top of the movement.</li>\n  <li>Lower the barbell back down to the starting position behind your neck.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16, 17],
      "secondary_muscles": [20, 21]
    }
  },
  {
    "pk": 170,
    "fields": {
      "name": "Close-Grip Bench Press",
      "steps": "<ol>\n<li>Set up the bench press station with the appropriate weight on the barbell.</li>\n  <li>Lie down on the bench with your feet flat on the ground and your back pressed against the bench.</li>\n  <li>Grip the barbell with your hands placed closer together than shoulder-width apart, palms facing towards your feet.</li>\n  <li>Unrack the barbell and hold it directly above your chest, arms fully extended.</li>\n  <li>Lower the barbell towards your chest by bending your elbows, keeping them close to your body.</li>\n  <li>Pause briefly with the barbell barely above your chest.</li>\n  <li>Push the barbell back up to the starting position by extending your arms, keeping your elbows close to your body.</li>\n  <li>Repeat the movement for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": [4, 16]
    }
  },
  {
    "pk": 171,
    "fields": {
      "name": "Clean",
      "steps": "<ol>\n  <li>Start with feet hip-width apart and hands gripping the barbell just outside the legs.</li>\n  <li>Lower into a squat position, keeping the back straight and the chest up.</li>\n  <li>Explosively extend the hips, knees, and ankles, driving the barbell upwards.</li>\n  <li>As the barbell reaches chest level, quickly drop underneath it in a squat position, rotating the elbows forward.</li>\n  <li>Catch the barbell on the front of the shoulders, with the elbows pointing forward and the chest up.</li>\n  <li>Stand up by extending the hips and knees, keeping the barbell close to the body.</li>\n  <li>Lower the barbell back to the starting position by reversing the movement.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3, 5, 8, 20]
    }
  },
  {
    "pk": 172,
    "fields": {
      "name": "One-Handed Wrist Curl – Dumbbell",
      "steps": "<ol>\n  <li>Sit on a bench, resting your forearm on your knee, gripping a dumbbell in one hand with your palm facing up.</li>\n  <li>Bending at the wrist, extend your knuckles towards the floor.</li>\n  <li>Curl your wrist upward, bringing the dumbbell towards your forearm.</li>\n  <li>Pause for a moment at the top of the movement, squeezing your forearm muscles.</li>\n  <li>Slowly lower the dumbbell back to the starting position, fully extending your wrist.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n  <li>Switch hands and repeat the exercise with the other hand.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5],
      "secondary_muscles": []
    }
  },
  {
    "pk": 173,
    "fields": {
      "name": "Standing Chest Fly – Cable",
      "steps": "<ol>\n  <li>Stand in front of a cable machine, facing away from the machine, with your feet shoulder-width apart and knees slightly bent.</li>\n  <li>Grasp the handles of the cables with your palms facing forward and your arms extended out to the sides at shoulder height.</li>\n  <li>Engage your core and maintain a slight bend in your elbows throughout the exercise. Try not to change the degree of elbow bend during the repetitions.</li>\n  <li>Exhale and slowly bring your arms forward, until your hands touch, while maintaining the same level of shoulder height.</li>\n  <li>Inhale and slowly return your arms back to the starting position, keeping them extended and at shoulder height.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4],
      "secondary_muscles": [16]
    }
  },
  {
    "pk": 174,
    "fields": {
      "name": "Floor Back Extension",
      "steps": "<ol>\n  <li>Lie face down on the floor with your legs extended and your arms by your sides.</li>\n  <li>Place your hands on the back of your head, or keep them out in a \"cactus pose\".</li>\n  <li>Engage your core muscles by drawing your navel towards your spine.</li>\n  <li>Slowly lift your upper body off the floor, using your lower back muscles.</li>\n  <li>Keep your neck in a neutral position and avoid straining or arching it.</li>\n  <li>Hold the lifted position for a few seconds, focusing on squeezing your lower back muscles.</li>\n  <li>Lower your upper body back down to the starting position in a controlled manner.</li>\n  <li>Repeat the exercise for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [10],
      "secondary_muscles": []
    }
  },
  {
    "pk": 175,
    "fields": {
      "name": "Side Plank",
      "steps": "<ol>\n<li>Start by lying on your side with your legs extended and stacked on top of each other.</li>\n<li>Place your forearm on the ground directly below your shoulder, with your elbow bent at a 90-degree angle.</li>\n<li>Engage your core muscles and lift your hips off the ground, creating a straight line from your head to your feet.</li>\n<li>Keep your body in a straight line and avoid sagging or letting your hips drop.</li>\n<li>Hold the position for the desired amount of time.</li>\n<li>Repeat on the other side.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 176,
    "fields": {
      "name": "Pec Deck",
      "steps": "<ol>\n  <li>Sit on the Pec Deck machine with your back flat against the backrest and your feet firmly on the floor.</li>\n  <li>Adjust the seat height so that the handles are at chest level.</li>\n  <li>Grasp the handles with an overhand grip, keeping your elbows slightly bent.</li>\n  <li>Exhale and push the handles together in front of your chest, squeezing your chest muscles.</li>\n  <li>Hold the contraction for a second, then slowly release the handles back to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4],
      "secondary_muscles": [16]
    }
  },
  {
    "pk": 177,
    "fields": {
      "name": "Pronated Grip Lat Pulldown",
      "steps": "<ol>\n<li>Adjust the seat height and position yourself on the lat pulldown machine.</li>\n<li>Grab the bar with an overhand grip, palms facing away from you, slightly wider than shoulder-width apart.</li>\n<li>Sit down and position your thighs under the thigh pads, keeping your feet flat on the floor.</li>\n<li>Keep your back straight and lean back slightly, engaging your core muscles.</li>\n<li>Exhale and pull the bar down towards your upper chest, leading with your elbows.</li>\n<li>Squeeze your shoulder blades together at the bottom of the movement.</li>\n<li>Inhale and slowly release the bar back to the starting position, extending your arms fully.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9],
      "secondary_muscles": [2, 5, 13, 14, 15]
    }
  },
  {
    "pk": 178,
    "fields": {
      "name": "Decline Bench Press – Barbell",
      "steps": "<ol>\n  <li>Set up the decline bench at a decline angle of your choice.</li>\n  <li>Lie down on the bench with your feet secured under the foot pads.</li>\n  <li>Grip the barbell with an overhand grip slightly wider than shoulder-width apart.</li>\n  <li>Lift the barbell off the rack and hold it directly above your chest with your arms fully extended.</li>\n  <li>Inhale and slowly lower the barbell towards your lower chest.</li>\n  <li>Pause for a moment when the barbell is just above your chest.</li>\n  <li>Exhale and push the barbell back up to the starting position, fully extending your arms.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4],
      "secondary_muscles": [16, 21]
    }
  },
  {
    "pk": 179,
    "fields": {
      "name": "Standing Cable Leg Curl",
      "steps": "<ol>\n  <li>Stand facing a cable machine with your feet hip-width apart.</li>\n  <li>Attach an ankle cuff to your right ankle.</li>\n  <li>Hold onto the machine for support and balance.</li>\n  <li>Bend your right knee and bring your heel towards your glutes, keeping your upper leg stationary.</li>\n  <li>Squeeze your hamstring at the top of the movement.</li>\n  <li>Slowly lower your leg back to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n  <li>Switch sides and perform the exercise with your left leg.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [8],
      "secondary_muscles": []
    }
  },
  {
    "pk": 180,
    "fields": {
      "name": "Cable Pull Through",
      "steps": "<ol>\n  <li>Attach a rope to a cable machine and stand facing away from the machine with your feet shoulder-width apart.</li>\n  <li>Grab the rope with both hands and position it between your legs, just above your knees.</li>\n  <li>Hinge forward at the hips and push your glutes back, keeping your back straight and chest up.</li>\n  <li>Lower your torso until it is parallel to the floor, feeling a stretch in your hamstrings.</li>\n  <li>Engage your glutes and hamstrings to drive your hips forward, standing up straight.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 10, 18]
    }
  },
  {
    "pk": 181,
    "fields": {
      "name": "Shrug – Barbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a barbell in front of your thighs with an overhand grip.</li>\n  <li>Keep your arms fully extended and your shoulders relaxed.</li>\n  <li>Slowly raise your shoulders as high as possible, as if you are trying to touch your ears with them.</li>\n  <li>Hold the contracted position for a brief pause, squeezing your shoulder muscles.</li>\n  <li>Lower your shoulders back down to the starting position in a controlled manner.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [20],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 182,
    "fields": {
      "name": "Bulgarian Split Squat",
      "steps": "<ol>\n  <li>Stand with your back facing a bench or step.</li>\n  <li>Place the top of one foot on the bench or step behind you.</li>\n  <li>Bend your front knee and lower your body down towards the ground, keeping your back straight.</li>\n  <li>Pause when your front thigh is parallel to the ground.</li>\n  <li>Push through your front heel to return to the starting position.</li>\n  <li>Repeat for the desired number of repetitions, then switch legs.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": []
    }
  },
  {
    "pk": 183,
    "fields": {
      "name": "Crunch – Machine",
      "steps": "<ol>\n  <li>Adjust the seat height and foot pad position on the crunch machine to ensure proper alignment.</li>\n  <li>Sit on the machine with your back against the backrest and your feet secured under the foot pads.</li>\n  <li>Place your hands lightly on the sides of your head, avoiding pulling on your neck.</li>\n  <li>Engage your core muscles by drawing your belly button in towards your spine.</li>\n  <li>Exhale and slowly curl your upper body forward, contracting your abdominal muscles.</li>\n  <li>Pause for a moment at the top of the movement, feeling the contraction in your abs.</li>\n  <li>Inhale and slowly lower your upper body back to the starting position, maintaining control throughout the movement.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 184,
    "fields": {
      "name": "Shrug – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell in each hand, palms facing your body.</li>\n  <li>Keep your arms straight and allow the dumbbells to hang at your sides.</li>\n  <li>Engage your core and lift your shoulders towards your ears, squeezing your shoulder blades together.</li>\n  <li>Hold the contraction for a second, then slowly lower your shoulders back down to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [20],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 185,
    "fields": {
      "name": "One-Legged Balance",
      "steps": "<ol>\n  <li>Stand tall with your feet hip-width apart.</li>\n  <li>Shift your weight onto one leg and lift the other leg off the ground.</li>\n  <li>Engage your core muscles to maintain balance.</li>\n  <li>Keep your standing leg slightly bent and your knee aligned with your toes.</li>\n  <li>Find a focal point to help you maintain balance and focus.</li>\n  <li>Hold the position for a desired amount of time.</li>\n  <li>Switch legs and repeat the exercise.</li>\n</ol>",
      "notes": "Try this exercise with closed eyes for increased difficulty.",
      "primary_muscles": [3],
      "secondary_muscles": []
    }
  },
  {
    "pk": 186,
    "fields": {
      "name": "Feet-Up Bench Press – Barbell",
      "steps": "<ol>\n<li>Lie flat on a bench with your feet up in the air, knees bent at a 90-degree angle.</li>\n<li>Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.</li>\n<li>Engage your core and press your lower back into the bench.</li>\n<li>Unrack the barbell and hold it directly above your chest, arms fully extended.</li>\n<li>Inhale and slowly lower the barbell towards your chest, keeping your elbows tucked in.</li>\n<li>Pause for a brief moment when the barbell touches your chest.</li>\n<li>Exhale and push the barbell back up to the starting position, fully extending your arms.</li>\n<li>Repeat the movement for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 187,
    "fields": {
      "name": "Curl – Machine",
      "steps": "<ol>\n  <li>Adjust the seat height and position yourself comfortably on the machine.</li>\n  <li>Grasp the handles with an underhand grip, palms facing up.</li>\n  <li>Keep your back straight and your elbows close to your sides.</li>\n  <li>Exhale and slowly curl the handles towards your shoulders, contracting your biceps.</li>\n  <li>Pause for a moment at the top of the movement, squeezing your biceps.</li>\n  <li>Inhale and slowly lower the handles back to the starting position, fully extending your arms.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 188,
    "fields": {
      "name": "Reverse Fly – Machine",
      "steps": "<ol>\n  <li>Adjust the seat height and chest pad of the machine to your comfort level.</li>\n<li>Sit on the machine with your chest against the pad and grasp the handles with an overhand grip.</li>\n<li>Keep your back straight and engage your core muscles.</li>\n<li>Exhale and slowly pull the handles back and away from your body, squeezing your shoulder blades together.</li>\n<li>Pause for a moment at the fully contracted position.</li>\n<li>Inhale and slowly return the handles to the starting position, maintaining control throughout the movement.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [13, 15],
      "secondary_muscles": [20]
    }
  },
  {
    "pk": 189,
    "fields": {
      "name": "Hang Power Snatch",
      "steps": "<ol>\n  <li>Stand with feet hip-width apart, holding a barbell with an overhand grip just outside of your thighs.</li>\n  <li>Lower into a quarter squat position, keeping your back straight and chest up.</li>\n  <li>Explosively extend your hips, knees, and ankles, jumping upward.</li>\n  <li>As you jump, pull the barbell upward, keeping it close to your body.</li>\n  <li>As the barbell reaches chest height, quickly drop into a quarter squat position and rotate your elbows under the barbell, keeping your arms straight.</li>\n  <li>Catch the barbell overhead with arms fully extended, in a quarter squat position.</li>\n  <li>Stand up, fully extending your hips and knees, while keeping the barbell overhead.</li>\n  <li>Lower the barbell back down to the starting position, and repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 18, 20]
    }
  },
  {
    "pk": 190,
    "fields": {
      "name": "One-Handed Plate Wrist Curl",
      "steps": "<ol>\n  <li>Start by sitting on a bench or chair with your feet flat on the ground.</li>\n  <li>Hold a weight plate with an underhand grip, placing your hand on the inside rim of the plate.</li>\n  <li>Rest your forearm on your thigh, with your wrist hanging off the edge and pointing to the ceiling.</li>\n  <li>Lower the weight plate towards the ground by flexing your wrist, keeping your forearm stationary.</li>\n  <li>Pause for a moment at the bottom of the movement, feeling the stretch in your wrist.</li>\n  <li>Slowly curl the weight plate back up towards your body.</li>\n  <li>Repeat for the desired number of reps and then switch sides.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5],
      "secondary_muscles": []
    }
  },
  {
    "pk": 191,
    "fields": {
      "name": "Kettlebell Swing",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and place the kettlebell on the floor in front of you.</li>\n  <li>Bend your knees and hinge at the hips to lower your body into a squat position, reaching down to grab the kettlebell with both hands.</li>\n  <li>Engage your core and lift the kettlebell off the ground, swinging it back between your legs.</li>\n  <li>Drive your hips forward and explosively swing the kettlebell up to shoulder height, using the momentum generated by your hips.</li>\n  <li>As the kettlebell reaches its peak, allow it to swing back down between your legs, keeping your arms straight and your core engaged.</li>\n  <li>Repeat the swinging motion for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 18, 20]
    }
  },
  {
    "pk": 192,
    "fields": {
      "name": "Seated Oblique Twist",
      "steps": "<ol>\n  <li>Sit on a workout mat or bench with your knees bent and feet flat on the floor.</li>\n  <li>Engage your core muscles by drawing your navel towards your spine.</li>\n  <li>Hold a dumbbell or medicine ball with both hands close to your chest.</li>\n  <li>Keeping your back straight, lean slightly back to engage your abdominal muscles.</li>\n  <li>Exhale and rotate your torso to the right, bringing the weight towards your right hip.</li>\n  <li>Inhale as you return to the starting position.</li>\n  <li>Exhale and rotate your torso to the left, bringing the weight towards your left hip.</li>\n  <li>Inhale as you return to the starting position.</li>\n  <li>Repeat the twisting motion for the desired number of repetitions on each side.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 193,
    "fields": {
      "name": "Lying Leg Curl",
      "steps": "<ol>\n  <li>Lie face down on a leg curl machine with your legs fully extended and your ankles against the padded lever.</li>\n  <li>Grasp the handles on the machine for stability.</li>\n  <li>Engage your core and squeeze your glutes.</li>\n  <li>Bend your knees to curl the lever towards your glutes, keeping your upper legs stationary.</li>\n  <li>Pause for a moment at the top of the movement, feeling the contraction in your hamstrings.</li>\n  <li>Slowly lower the lever back to the starting position, fully extending your legs.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [8],
      "secondary_muscles": []
    }
  },
  {
    "pk": 194,
    "fields": {
      "name": "Hack Squat – Machine",
      "steps": "<ol>\n<li>Adjust the seat height and foot platform of the machine to your desired position.</li>\n<li>Sit on the machine with your back against the pad and grasp the handles with an overhand grip.</li>\n<li>Engage your core throughout the exercise.</li>\n<li>Bend your knees and lower your body down, keeping your back straight and your heels on the foot platform.</li>\n<li>Continue descending until your thighs are parallel to the foot platform or as low as your flexibility allows.</li>\n<li>Push through your heels and extend your legs to return to the starting position.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": []
    }
  },
  {
    "pk": 195,
    "fields": {
      "name": "One-Handed Wrist Extension – Dumbbell",
      "steps": "<ol>\n  <li>Hold a dumbbell with an overhand grip.</li>\n  <li>Sit on a bench with your feet shoulder-width apart.</li>\n  <li>Rest your forearm on the top of your thigh, with your palm facing down.</li>\n  <li>Slowly lift the dumbbell by extending your wrist, keeping your elbows stationary. Focus on bringing your knuckles back towards the top of your forearm.</li>\n  <li>Hold the dumbbell at the top of the movement for a moment.</li>\n  <li>Lower the dumbbell back down to the starting position by flexing your wrist towards the floor.</li>\n  <li>Repeat for the desired number of reps and then switch sides.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [6],
      "secondary_muscles": []
    }
  },
  {
    "pk": 196,
    "fields": {
      "name": "Seated Overhead Press – Barbell",
      "steps": "<ol>\n<li>Start by sitting on a back-supporting bench with your feet firmly planted on the ground.</li>\n<li>Hold the barbell with an overhand grip, slightly wider than shoulder-width apart.</li>\n<li>Bring the barbell to shoulder level, resting it on your upper chest and front shoulders.</li>\n<li>Engage your core and keep your back straight throughout the exercise.</li>\n<li>Press the barbell overhead by extending your arms fully, but without locking your elbows.</li>\n<li>Pause briefly at the top of the movement, then slowly lower the barbell back to the starting position.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 197,
    "fields": {
      "name": "Overhead Press – Barbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a barbell at shoulder level, palms facing forward.</li>\n  <li>Engage your core and press the weight directly overhead, fully extending your arms without locking your elbows.</li>\n  <li>Keep your head and chest up, and avoid leaning back or arching your lower back.</li>\n  <li>Pause briefly at the top, then slowly lower the weight back to shoulder level.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 198,
    "fields": {
      "name": "Seated Overhead Press – Dumbbell",
      "steps": "<ol>\n<li>Start by sitting on a back-supporting bench with your feet firmly planted on the ground.</li>\n<li>Hold a dumbbell in each hand with an overhand grip.</li>\n<li>Bring the dumbbells to shoulder level.</li>\n<li>Engage your core and keep your back straight throughout the exercise.</li>\n<li>Press the dumbbells overhead by extending your arms fully, but without locking your elbows.</li>\n<li>Pause briefly at the top of the movement, then slowly lower the dumbbells back to the starting position.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 199,
    "fields": {
      "name": "Overhead Press – Dumbbell",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold dumbbells at shoulder level, palms facing forward.</li>\n  <li>Engage your core and press the weight directly overhead, fully extending your arms without locking your elbows.</li>\n  <li>Keep your head and chest up, and avoid leaning back or arching your lower back.</li>\n  <li>Pause briefly at the top, then slowly lower the weight back to shoulder level.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 200,
    "fields": {
      "name": "Lunge – Barbell",
      "steps": "<ol>\n<li>Start by standing with your feet hip-width apart and your back straight.</li>\n<li>Hold a barbell across your upper back, resting it on your shoulders.</li>\n<li>Take a step forward with your right foot, keeping your core engaged and your chest lifted.</li>\n<li>Bend both knees to lower your body towards the ground, making sure your front knee does not go past your toes.</li>\n<li>Lower your body until your front thigh is parallel to the ground, and your back knee is hovering just above the floor.</li>\n<li>Push through your front heel to return to the starting position.</li>\n<li>Repeat the movement on the other side by stepping forward with your left foot.</li>\n<li>Continue alternating legs for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": []
    }
  },
  {
    "pk": 201,
    "fields": {
      "name": "Kneeling Incline Push-Up",
      "steps": "<ol>\n<li>Start by kneeling on the ground with your hands placed slightly wider than shoulder-width apart on an elevated surface, such as a bench or step.</li>\n<li>Engage your core and lower your chest towards the elevated surface, bending your elbows and keeping them close to your body. Keep your body in a straight line from head to knee.</li>\n<li>Pause briefly when your chest is just above the surface, then push through your hands to extend your arms and return to the starting position.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  },
  {
    "pk": 202,
    "fields": {
      "name": "Plate Front Raise",
      "steps": "<ol>\n<li>Stand with your feet shoulder-width apart and hold a weight plate with both hands in front of your thighs.</li>\n<li>Keep your arms straight and slowly raise the weight plate up to shoulder level, making sure to keep your core engaged and your back straight.</li>\n<li>Pause for a moment at the top of the movement, then slowly lower the weight plate back down to the starting position.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17]
    }
  },
  {
    "pk": 203,
    "fields": {
      "name": "Row – Barbell",
      "steps": "<ol>\n  <li>Stand in front of a barbell with your feet shoulder-width apart.</li>\n  <li>Bend your knees slightly and hinge forward at the hips, keeping your back straight.</li>\n  <li>Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.</li>\n  <li>Engage your core and pull the barbell towards your upper abs or lower chest, keeping your elbows close to your body.</li>\n  <li>Pause and squeeze your shoulder blades together for a moment at the top of the movement.</li>\n  <li>Slowly lower the barbell back to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 10, 13, 14]
    }
  },
  {
    "pk": 204,
    "fields": {
      "name": "One-Handed Lat Pulldown",
      "steps": "<ol>\n<li>Adjust the seat height and position yourself in the lat pulldown machine.</li>\n<li>Grasp the lat pulldown bar with one hand, using an overhand grip.</li>\n<li>Engage your core and keep your back straight throughout the exercise.</li>\n<li>Start with your arm fully extended, allowing the weight to be lifted off the stack.</li>\n<li>Exhale and pull the bar down towards your side, focusing on squeezing your lat muscles.</li>\n<li>Pause for a moment at the bottom of the movement, feeling the contraction in your lat.</li>\n<li>Inhale and slowly return the bar to the starting position, fully extending your arm.</li>\n<li>Repeat for the desired number of repetitions and then switch to the other hand.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9],
      "secondary_muscles": [2, 5, 13, 14, 15]
    }
  },
  {
    "pk": 205,
    "fields": {
      "name": "Bench Press – Dumbbell",
      "steps": "<ol>\n<li>Lie flat on a bench with your feet firmly planted on the ground.</li>\n<li>Hold a dumbbell in each hand, palms facing forward, and extend your arms straight up over your chest.</li>\n<li>Lower the dumbbells slowly towards your chest, keeping your elbows wide.</li>\n<li>Pause for a moment when the dumbbells are just above your chest.</li>\n<li>Push the dumbbells back up to the starting position, fully extending your arms.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 206,
    "fields": {
      "name": "Pendlay Row",
      "steps": "<ol>\n  <li>Load a barbell with weights on the floor.</li>\n  <li>Stand with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Bend forward at the hips, keeping your back straight and parallel to the ground.</li>\n  <li>Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.</li>\n  <li>Keep your elbows close to your body and pull the barbell up towards your chest, squeezing your shoulder blades together.</li>\n  <li>Lower the barbell back down to the floor, releasing the tension of the weight for a brief moment, while maintaining control and keeping your back straight.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 10, 13, 14]
    }
  },
  {
    "pk": 207,
    "fields": {
      "name": "Deadlift – Fat Bar",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart, holding a loaded fat bar in front of your quads.</li>\n  <li>Bend your knees, hinge and lean forward at the hips, keeping your back straight and your chest up.</li>\n  <li>Lower the fat bar towards the ground, keeping it close to your legs.</li>\n  <li>Pause when the fat bar is just below your knees.</li>\n  <li>Push through your heels and stand up, keeping your back straight and your chest up.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [5, 7, 10],
      "secondary_muscles": [8, 12, 18, 20]
    }
  },
  {
    "pk": 208,
    "fields": {
      "name": "One-Handed Standing Chest Fly – Band",
      "steps": "<ol>\n  <li>Find a sturdy stationary object, such as a pole or a door anchor, and attach one end of the resistance band to it at chest height.</li>\n  <li>Stand with your feet shoulder-width apart, facing away from the stationary object.</li>\n  <li>Hold the free end of the resistance band in one hand, with your palm facing forward.</li>\n  <li>Position yourself at a distance from the stationary object so that there is tension in the band when your arm is extended forward at chest height.</li>\n  <li>Keep your elbow slightly bent and your arm extended out to the side at shoulder height.</li>\n  <li>Engage your core muscles to stabilize your torso.</li>\n  <li>With a slight bend in your elbow, bring your arm across your chest in a sweeping motion while keeping your chest open.</li>\n  <li>Feel the stretch in your chest muscles as you bring your arm across your body.</li>\n  <li>Return your arm to the starting position in a controlled manner.</li>\n  <li>Complete the desired number of repetitions on one side before switching to the other.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4],
      "secondary_muscles": [16]
    }
  },
  {
    "pk": 209,
    "fields": {
      "name": "Bench Press – Smith Machine",
      "steps": "<ol>\n<li>Set up a bench under a Smith machine so that the bar is over your chest while lying on the bench.</li>\n<li>Lie down on the bench with your feet flat on the floor and your back pressed against the bench.</li>\n<li>Extend your arms and grip the bar with your hands slightly wider than shoulder-width apart, palms facing forward.</li>\n<li>Unrack the bar by straightening your arms and lifting it off the rack.</li>\n<li>Lower the bar slowly towards your chest, keeping your elbows wide.</li>\n<li>Pause for a moment when the bar touches your chest.</li>\n<li>Push the bar back up to the starting position by extending your arms fully.</li>\n<li>Repeat the movement for the desired number of repetitions.</li>\n<li>Once finished, carefully rack the bar back onto the Smith machine.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 210,
    "fields": {
      "name": "Underhand Grip Inverted Row",
      "steps": "<ol>\n<li>Set up a barbell or suspension trainer at waist height.</li>\n<li>Stand facing the barbell or suspension trainer and grab it with an underhand grip, hands shoulder-width apart.</li>\n<li>Walk your feet forward until your body is at a slight angle, with your arms extended and your body in a straight line.</li>\n<li>Engage your core and squeeze your shoulder blades together as you pull your chest towards the barbell or suspension trainer.</li>\n<li>Pause for a moment at the top of the movement, then slowly lower yourself back down to the starting position.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 13, 14]
    }
  },
  {
    "pk": 211,
    "fields": {
      "name": "Mountain Climbers – BOSU",
      "steps": "<ol>\n  <li>Place a BOSU ball on the floor with the dome side facing down.</li>\n  <li>Assume a push-up position with your hands gripped on the sides of the BOSU ball.</li>\n  <li>Engage your core and keep your body in a straight line from head to toe.</li>\n  <li>Start by bringing one knee towards your chest, then quickly switch and bring the other knee towards your chest.</li>\n  <li>Continue alternating your knees in a running motion, keeping your hips low and your abs tight.</li>\n  <li>Perform the exercise for the desired number of repetitions or time.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 212,
    "fields": {
      "name": "Pistons",
      "steps": "<ol>\n  <li>Stand upright with your feet hip-width apart.</li>\n  <li>Place your hands behind your head, elbows out to the sides.</li>\n  <li>Engage your core muscles to stabilize your torso.</li>\n  <li>Lift your right knee towards your chest while simultaneously crunching your left elbow towards your right knee.</li>\n  <li>Return to the starting position.</li>\n  <li>Now, lift your left knee towards your chest while crunching your right elbow towards your left knee.</li>\n  <li>Continue alternating between sides for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 213,
    "fields": {
      "name": "Clamshells",
      "steps": "<ol>\n  <li>Lie on your side with your knees bent and your feet together.</li>\n  <li>Keep your feet touching and lift your top knee as high as you can without moving your pelvis.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower your knee back down.</li>\n  <li>Repeat the movement for the desired number of repetitions, then switch to the other side.</li>\n</ol>",
      "notes": "Use a resistance band around your knees to increase the difficulty of the exercise.",
      "primary_muscles": [19],
      "secondary_muscles": [7]
    }
  },
  {
    "pk": 214,
    "fields": {
      "name": "Fire Hydrants",
      "steps": "<ol>\n  <li>Start on all fours with your hands directly under your shoulders and your knees directly under your hips.</li>\n  <li>Engage your core and keep your back straight throughout the exercise.</li>\n  <li>Keeping your knee bent, lift one leg out to the side, keeping your foot flexed and parallel to the ground.</li>\n  <li>Pause for a moment at the top of the movement, squeezing your glutes.</li>\n  <li>Slowly lower your leg back down to the starting position.</li>\n  <li>Repeat for the desired number of repetitions, then switch sides.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 19],
      "secondary_muscles": []
    }
  },
  {
    "pk": 215,
    "fields": {
      "name": "Push-Up Against Wall",
      "steps": "<ol>\n  <li>Stand facing a wall with your feet shoulder-width apart.</li>\n  <li>Place your hands on the wall at shoulder height, slightly wider than shoulder-width apart.</li>\n  <li>Step back a few feet, keeping your body straight and your core engaged.</li>\n  <li>Bend your elbows and lower your chest towards the wall, keeping your body in a straight line.</li>\n  <li>Push through your palms and straighten your arms to return to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  },
  {
    "pk": 216,
    "fields": {
      "name": "Hip Adduction – Machine",
      "steps": "<ol>\n<li>Adjust the seat height of the hip adduction machine so that your knees are at a 90-degree angle when seated.</li>\n<li>Sit on the machine with your back against the backrest and your feet flat on the footrests.</li>\n<li>Place your thighs against the thigh pads, just above your knees.</li>\n<li>Grasp the handles on the sides of the machine for stability.</li>\n<li>Engage your core and squeeze your inner thighs together as you exhale.</li>\n<li>Hold the contraction for a second and then slowly release as you inhale.</li>\n<li>Repeat the movement for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [18],
      "secondary_muscles": []
    }
  },
  {
    "pk": 217,
    "fields": {
      "name": "Pause Deadlift – Barbell",
      "steps": "<ol>\n<li>Stand with your feet hip-width apart and your toes pointing forward.</li>\n<li>Bend at the hips and knees to lower your body down, keeping your back straight and your chest lifted.</li>\n<li>Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.</li>\n<li>Engage your core and lift the barbell off the ground, driving through your heels and keeping your back straight.</li>\n<li>Almost immediately during your lift, pause for a brief moment when the barbell is in front of your lower shins, maintaining tension in your muscles.</li>\n<li>Continue the lift until you're standing straight.</li>\n<li>Lower the barbell back down to the ground, maintaining control and keeping your back straight.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 12, 18, 20]
    }
  },
  {
    "pk": 218,
    "fields": {
      "name": "Deadlift – Trap Bar Low Handles",
      "steps": "<ol>\n<li>Stand with your feet hip-width apart, toes pointing forward, and the trap bar centered between your feet.</li>\n<li>Bend at the hips and knees, keeping your back straight and chest lifted, and grip the low handles of the trap bar with an overhand grip.</li>\n<li>Engage your core and lift the trap bar by extending your hips and knees, driving through your heels.</li>\n<li>As you lift, keep your back straight and avoid rounding your shoulders.</li>\n<li>Once you are fully standing, pause for a moment and squeeze your glutes.</li>\n<li>Lower the trap bar back down by bending at the hips and knees, maintaining control and keeping your back straight.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 219,
    "fields": {
      "name": "Runner's 5",
      "steps": "<ol>\n  <li>Stand with your feet hip-width apart. We're going to complete five, one-legged exercises on one side, then the other.</li>\n  <li>First, One-legged Squats: Stand on one leg with the other leg extended slightly behind you. Slowly lower your body by bending the knee of the standing leg, keeping your back straight and chest up. Lower yourself as far as comfortable while maintaining balance, then return to the starting position. Repeat for the desired number of repetitions.</li>\n  <li>Second, One-legged Romanian Deadlifts: Stand on one leg with a slight bend in your knee. Keeping your back straight, hinge at your hips to lower your upper body forward while extending the opposite leg straight behind you. Go as low as your flexibility allows, feeling a stretch in your hamstring. Return to the upright position. Repeat for the desired number of repetitions.</li>\n  <li>Third, One-legged Lunges: Stand on one leg and take a step forward with the other leg. Lower your body by bending both knees until your front thigh is parallel to the ground (or as low as you can comfortably go). Keep your upper body upright, and push through your front heel to return to the starting position. Repeat for the desired number of repetitions.</li>\n  <li>Fourth, One-legged Sidekicks: Stand on one leg with the other leg slightly lifted to the side. Perform a side kick by extending your lifted leg straight out to the side, then bring it back to the starting position. Maintain balance throughout. Repeat for the desired number of repetitions.</li>\n  <li>Fifth, One-legged Front-Back Kicks: Stand on one leg with the other leg lifted slightly in front of you. Perform a front kick by extending your lifted leg forward, then immediately perform a back kick by extending it backward. Keep control and balance throughout the movement. Repeat for the desired number of repetitions.</li>\n  <li>Repeat the five exercises on the other side.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [3, 7, 8, 12],
      "secondary_muscles": []
    }
  },
  {
    "pk": 220,
    "fields": {
      "name": "Heel Raise",
      "steps": "<ol>\n<li>Stand with your feet shoulder-width apart, toes pointing forward.</li>\n<li>Place your hands on a stable surface, such as a wall or a chair, for balance.</li>\n<li>Slowly rise up onto the balls of your feet, lifting your heels off the ground.</li>\n<li>Hold the raised position for a moment, feeling the contraction in your calf muscles.</li>\n<li>Lower your heels back down to the starting position in a controlled manner.</li>\n<li>Repeat the movement for the desired number of repetitions.</li>\n</ol>",
      "notes": "Stand with your toes elevated on a step or plate to increase the range of motion and difficulty of the exercise.",
      "primary_muscles": [3],
      "secondary_muscles": []
    }
  },
  {
    "pk": 221,
    "fields": {
      "name": "Oblique Sit-Up",
      "steps": "<ol>\n<li>Lie on your back with your knees bent and feet flat on the ground.</li>\n<li>Place your hands behind your head, with your elbows pointing out to the sides.</li>\n<li>Engage your core muscles by pulling your belly button in towards your spine.</li>\n<li>Slowly lift your upper body off the ground, twisting to one side, touching one elbow to the opposite knee.</li>\n<li>Exhale as you reach the top of the movement and hold for a second.</li>\n<li>Lower your upper body back down to the starting position, inhaling as you do so.</li>\n<li>Repeat the movement on the other side, twisting to the opposite side.</li>\n<li>Continue alternating sides for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 222,
    "fields": {
      "name": "Sled Push",
      "steps": "<ol>\n  <li>Position yourself behind the sled with your feet shoulder-width apart.</li>\n  <li>Place your hands on the handles of the sled, gripping them firmly.</li>\n  <li>Engage your core and drive through your legs to push the sled forward.</li>\n  <li>Maintain a straight back and keep your head up as you push the sled.</li>\n  <li>Continue pushing the sled for the desired distance or time.</li>\n  <li>Once finished, release the handles and step away from the sled.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [3, 8, 12]
    }
  },
  {
    "pk": 223,
    "fields": {
      "name": "Tricep Extension – Barbell",
      "steps": "<ol>\n<li>Stand with your feet shoulder-width apart and hold a barbell with an overhand grip.</li>\n<li>Bring the barbell behind your head, keeping your elbows close to your ears.</li>\n<li>Extend your arms upward, straightening your elbows and lifting the barbell above your head.</li>\n<li>Pause briefly at the top of the movement, then slowly lower the barbell back behind your head.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": []
    }
  },
  {
    "pk": 224,
    "fields": {
      "name": "Shrug –  Trap Bar",
      "steps": "<ol>\n  <li>Stand inside a trap bar with your feet shoulder-width apart.</li>\n  <li>Grasp the handles of the trap bar with an overhand grip.</li>\n  <li>Keep your back straight and your core engaged.</li>\n  <li>Exhale and lift your shoulders up towards your ears, squeezing your trapezius muscles.</li>\n  <li>Hold the shrug position for a second.</li>\n  <li>Inhale and slowly lower your shoulders back down to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [20],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 225,
    "fields": {
      "name": "Tricep Pushdown – Cable With Rope",
      "steps": "<ol>\n<li>Stand facing a cable machine with your feet shoulder-width apart and your knees slightly bent.</li>\n<li>Attach a rope handle to the high pulley of the cable machine.</li>\n<li>Grasp the rope with an overhand grip, palms facing each other.</li>\n<li>Keep your elbows close to your sides and your upper arms stationary throughout the exercise.</li>\n<li>Exhale and push the rope down until your arms are fully extended, while keeping your upper arms stationary.</li>\n<li>Hold the contracted position for a brief pause, squeezing your triceps.</li>\n<li>Inhale and slowly allow the rope to return to the starting position, while maintaining tension in your triceps.</li>\n<li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": []
    }
  },
  {
    "pk": 226,
    "fields": {
      "name": "Bicycle Sit-Up",
      "steps": "<ol>\n  <li>Lie flat on your back with your hands behind your head and your knees bent.</li>\n  <li>Bring your right elbow towards your left knee while simultaneously straightening your right leg.</li>\n  <li>Return to the starting position and repeat the movement on the opposite side, bringing your left elbow towards your right knee while straightening your left leg.</li>\n  <li>Continue alternating sides in a pedaling motion, keeping your core engaged and your lower back pressed into the floor.</li>\n  <li>Complete the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1, 11],
      "secondary_muscles": []
    }
  },
  {
    "pk": 227,
    "fields": {
      "name": "Lateral Raise – Cable",
      "steps": "<ol>\n<li>Stand upright with your feet shoulder-width apart and your knees slightly bent.</li>\n<li>Hold the cable handle in one hand with an overhand grip.</li>\n<li>Keep your arm straight and your palm facing down.</li>\n<li>Engage your core and maintain a neutral spine.</li>\n<li>Exhale and slowly lift your arm out to the side until it reaches shoulder level.</li>\n<li>Pause for a moment and squeeze your shoulder muscles.</li>\n<li>Inhale and slowly lower your arm back down to the starting position.</li>\n<li>Repeat for the desired number of repetitions.</li>\n<li>Switch sides and perform the exercise with the other arm.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [17],
      "secondary_muscles": [16]
    }
  }
]
