[
  {
    "pk": 1,
    "fields": {
      "name": "Pull-Up",
      "steps": "<ol><li>Begin by finding a sturdy horizontal bar high enough off the ground that you can hang from it with your feet off the floor.</li><li>Stand underneath the bar and jump up, grabbing onto the bar with an overhand grip (palms facing away from you) and your hands slightly wider than shoulder-width apart. Your arms should be fully extended.</li><li>Engage your core and retract your shoulder blades as you pull your body up towards the bar. Keep your elbows pointed downwards and your head in a neutral position.</li><li>Continue pulling your body up until your chin is above the bar. Keep your core tight and your shoulders engaged throughout the movement.</li><li>Pause briefly at the top of the movement, then slowly lower yourself back down to the starting position with control. Make sure to maintain a controlled descent and avoid letting your body swing or drop.</li><li>Repeat the movement for your desired number of repetitions.</li></ol>",
      "notes": "Try assisted variations using resistance bands or an assisted pull-up machine until you build the necessary strength.",
      "primary_muscles": [9],
      "secondary_muscles": [2, 5, 13, 14, 15]
    }
  },
  {
    "pk": 2,
    "fields": {
      "name": "Squat",
      "steps": "<ol><li>Begin by standing with your feet shoulder-width apart and your toes pointing forward. Hold a barbell behind your neck, resting it on your shoulders with your elbows pointing down and your palms facing forward.</li><li>Engage your core and keep your chest lifted as you bend your knees and lower your hips back and down as if sitting in a chair. Make sure to keep your weight on your heels and your knees tracking in line with your toes.</li><li>As you descend into the squat, inhale and maintain proper form. Lean forward so that your chest is over your thighs. Keep your back straight and your core engaged. Lower your body until your thighs parallel the ground, and your hips should align with your knees.</li><li>Pause briefly at the bottom of the movement, then exhale and push through your heels to stand back up to the starting position. Keep your core engaged and your chest lifted until you're fully standing.</li><li>Repeat the movement for your desired number of repetitions.</li><li>Place the barbell on the rack after you've finished your set.</li></ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 3,
    "fields": {
      "name": "Push-Up",
      "steps": "<ol><li>Start in a plank position, with your hands shoulder-width apart and your fingers pointing forward.</li><li>Keep your core engaged, your back straight, and your hips in line with your shoulders.</li><li>Lower your body towards the ground by bending your elbows, keeping your upper arms close to your sides.</li><li>Keep your elbows at a 45-degree angle to your body, and continue lowering until your chest touches the ground.</li><li>Push back up to the starting position by straightening your arms, keeping your core engaged and your body in a straight line throughout the movement.</li><li>Repeat</li></ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  },
  {
    "pk": 4,
    "fields": {
      "name": "Romanian Deadlift",
      "steps": "<ol><li>Stand with your feet shoulder-width apart and your toes pointing forward. Hold a barbell with an overhand grip in front of your thighs .</li><li>Brace your core, keep your chest up, and slowly bend your knees while hinging at your hips. As you hinge, push your hips back and lower the weight toward the floor. Keep your back straight and your shoulders down.</li><li>Continue lowering the weight until you feel a stretch in your hamstrings. Your knees should be slightly bent but not locked. You can lower the weight until it touches the floor or stops just below your knees.</li><li>Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall. As you stand up, squeeze your glutes and hamstrings.</li><li>Repeat.</li><ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 5,
    "fields": {
      "name": "Dumbbell Romanian Deadlift",
      "steps": "<ol><li>Stand with your feet shoulder-width apart and your toes pointing forward. Hold a pair of dumbbells with an overhand grip in front of your thighs .</li><li>Brace your core, keep your chest up, and slowly bend your knees while hinging at your hips. As you hinge, push your hips back and lower the weight toward the floor. Keep your back straight and your shoulders down.</li><li>Continue lowering the weight until you feel a stretch in your hamstrings. Your knees should be slightly bent but not locked. You can lower the weight until it touches the floor or stops just below your knees.</li><li>Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall. As you stand up, squeeze your glutes and hamstrings.</li><li>Repeat.</li><ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 6,
    "fields": {
      "name": "Single-Leg Romanian Deadlift",
      "steps": "<ol><li>Begin by standing on one leg, with a slight bend in the knee. Keep your other leg off the ground and behind you.</li><li>Hold a dumbbell or kettlebell in the opposite hand of the leg you are standing on.</li><li>Brace your core, keep your chest up, and slowly hinge forward at the hips, keeping your back straight and your shoulders down. As you hinge, lift your non-standing leg behind you, keeping it in line with your torso.</li><li>Continue lowering the weight until you feel a stretch in your hamstring. Your standing knee should be slightly bent but not locked.</li><li>Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall while bringing your lifted leg back down to the ground.</li><li>Repeat for the desired number of repetitions on one leg before switching to the other.</li><ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 7,
    "fields": {
      "name": "Air Squat",
      "steps": "<ol><li>Stand with your feet shoulder-width apart and point your toes slightly outward.</li><li>Keep your chest up, shoulders back, and core engaged.</li><li>Lower your body by bending your knees and pushing your hips back as if you were sitting in a chair.</li><li>Keep your weight on your heels and your knees behind your toes.</li><li>Lower yourself until your thighs are parallel to the ground or as low as you can comfortably go while maintaining good form.</li><li>Pause briefly at the bottom of the squat.</li><li>Push through your heels to stand back up, driving your hips forward as you do.</li><li>Stand up straight and repeat.</li></ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 8,
    "fields": {
      "name": "Face Pull",
      "steps": "<ol><li>Start by attaching a rope to a high pulley on a cable machine.</li><li>Grasp the rope or cable with both hands using an overhand grip, with your palms facing each other.</li><li>Step back a few feet from the cable machine, so there is tension in the rope or cable.</li><li>Stand with your feet shoulder-width apart, and engage your core muscles to maintain good posture throughout the exercise.</li><li>Pull the rope or cable towards your face, leading with your elbows.</li><li>Keep your elbows high and out to the sides as you pull the rope towards your face until your hands reach your temples or the sides of your head.</li><li>Hold the position for a second, then slowly lower the rope back to the starting position.</li><li>Repeat for the desired number of repetitions.</li></ol>",
      "notes": "Focus on using your back muscles to perform the movement rather than relying on your arms or shoulders.",
      "primary_muscles": [13, 14, 15],
      "secondary_muscles": [17, 20]
    }
  },
  {
    "pk": 9,
    "fields": {
      "name": "Bench Press",
      "steps": "<ol><li>Lie on a flat bench with your feet firmly planted on the ground.</li><li>Grip the barbell with your hands slightly wider than shoulder-width apart, with your palms facing away from your body.</li><li>Lift the bar off the rack and hold it directly above your chest with extended arms.</li><li>Slowly lower the bar down to your chest, keeping your elbows close to your body.</li><li>Pause briefly when the bar touches your chest.</li><li>Push the bar back up to the starting position by extending your arms.</li><li>Repeat.</li></ol>",
      "notes": "<ul><li>Ensure your back is flat against the bench, and your feet are firmly planted on the ground.</li><li>Keep your core tight, and your elbows close to your body throughout the movement.</li><li>Exhale as you push the bar away from your chest, and inhale as you lower it down.</li></ul>",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 10,
    "fields": {
      "name": "Dumbbell Squat",
      "steps": "<ol><li>Stand with your feet shoulder-width apart, with your toes pointing slightly outward.</li><li>Hold a dumbbell in each hand by your sides, with your palms facing inward.</li><li>Engage your core and keep your chest lifted throughout the movement.</li><li>Lower your body by bending at the hips and knees as if sitting on a chair.</li><li>Keep your weight in your heels, and make sure your knees are tracking over your toes.</li><li>Lower your body until your thighs are parallel to the ground or until you reach your desired depth.</li><li>Push through your heels to stand back up to the starting position.</li><li>Repeat.</li></ol>",
      "notes": "Keep your knees in line with your toes throughout the movement.",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 11,
    "fields": {
      "name": "Deadlift",
      "steps": "",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 12, 18, 20]
    }
  },
  {
    "pk": 12,
    "fields": {
      "name": "Plank",
      "steps": "",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 13,
    "fields": {
      "name": "Leg Press",
      "steps": "<ol><li>Adjust the seat of the leg press machine so that your knees are at a ~90-degree angle when your feet are on the footplate.</li><li>Sit on the machine and place your feet shoulder-width apart on the footplate.</li><li>Push the footplate away from your body by extending your legs.</li><li>Lower the footplate back towards your body by bending your legs and keeping your feet flat on the plate.</li><li>Repeat.</li></ol>",
      "notes": "<ol><li>Keep your back flat against the seat throughout the movement.</li><li>Keep your feet flat on the footplate, and make sure your knees are tracking in line with your toes.</li><li>Exhale as you push the footplate away from your body, and inhale as you lower it back down.</li><li>Avoid locking out your knees at the top of the movement, as this can put unnecessary stress on the joint.</li></ol>",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [8]
    }
  },
  {
    "pk": 14,
    "fields": {
      "name": "Cross-body Dumbbell Curl",
      "steps": "<ol><li>Stand up, leaning slightly forward from a straight position, feet shoulder-width apart, and your knees slightly bent.</li><li>Hold a dumbbell in each hand, with your palms facing your body and arms fully extended at your sides.</li><li>Keeping your elbows close to your body, slowly curl one dumbbell up toward your opposite shoulder.</li><li>Pause at the top of the curl, squeezing your bicep before slowly lowering the weight to the starting position.</li><li>Repeat the curl on the opposite side, curling the other dumbbell toward the opposite shoulder while rotating your torso.</li><li>Continue alternating curls on each side for the desired number of repetitions.</li></ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 15,
    "fields": {
      "name": "Frog Pumps",
      "steps": "<ol><li>Lie on your back with your knees bent and your feet flat on the ground. Keep your feet close together and your heels touching.</li><li>Bring your feet up towards your hips along the ground until they're about 6 inches apart, and then let your knees fall out to the sides so that your feet are touching each other. This is the starting position.</li><li>Engage your glutes and lift your hips up towards the ceiling as high as you can, making sure to keep your feet and knees in the same position.</li><li>Hold the top position for 1-2 seconds, then slowly lower your hips to the starting position.</li><li>Repeat.</li></ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 16,
    "fields": {
      "name": "Lying Windshield Wiper",
      "steps": "<ol><li>Lie flat on your back with your arms extended out to the sides, palms down, and your legs extended straight up towards the ceiling.</li><li>Keep your feet together and engage your core muscles by drawing your navel towards your spine.</li><li>Lower your legs to one side, keeping them straight and close to the floor without touching it.</li><li>Pause briefly and then lift your legs back up to the starting position.</li><li>Repeat the movement, this time lowering your legs to the opposite side.</li><li>Continue alternating sides for the desired number of reps or time.</li></ol>",
      "notes": "Avoid swinging or using momentum to perform the movement; instead, control the action with your core muscles.",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  }
]
