[
  {
    "pk": 1,
    "fields": {
      "name": "Pull-Up",
      "steps": "<ol><li>Begin by finding a sturdy horizontal bar high enough off the ground that you can hang from it with your feet off the floor.</li><li>Stand underneath the bar and jump up, grabbing onto the bar with an overhand grip (palms facing away from you) and your hands slightly wider than shoulder-width apart. Your arms should be fully extended.</li><li>Engage your core and retract your shoulder blades as you pull your body up towards the bar. Keep your elbows pointed downwards and your head in a neutral position.</li><li>Continue pulling your body up until your chin is above the bar. Keep your core tight and your shoulders engaged throughout the movement.</li><li>Pause briefly at the top of the movement, then slowly lower yourself back down to the starting position with control. Make sure to maintain a controlled descent and avoid letting your body swing or drop.</li><li>Repeat the movement for your desired number of repetitions.</li></ol>",
      "notes": "Try assisted variations using resistance bands or an assisted pull-up machine until you build the necessary strength.",
      "primary_muscles": [9],
      "secondary_muscles": [2, 5, 13, 14, 15]
    }
  },
  {
    "pk": 2,
    "fields": {
      "name": "Squat",
      "steps": "<ol><li>Begin by standing with your feet shoulder-width apart and your toes pointing forward. Hold a barbell behind your neck, resting it on your shoulders with your elbows pointing down and your palms facing forward.</li><li>Engage your core and keep your chest lifted as you bend your knees and lower your hips back and down as if sitting in a chair. Make sure to keep your weight on your heels and your knees tracking in line with your toes.</li><li>As you descend into the squat, inhale and maintain proper form. Lean forward so that your chest is over your thighs. Keep your back straight and your core engaged. Lower your body until your thighs parallel the ground, and your hips should align with your knees.</li><li>Pause briefly at the bottom of the movement, then exhale and push through your heels to stand back up to the starting position. Keep your core engaged and your chest lifted until you're fully standing.</li><li>Repeat the movement for your desired number of repetitions.</li><li>Place the barbell on the rack after you've finished your set.</li></ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 3,
    "fields": {
      "name": "Push-Up",
      "steps": "<ol><li>Start in a plank position, with your hands shoulder-width apart and your fingers pointing forward.</li><li>Keep your core engaged, your back straight, and your hips in line with your shoulders.</li><li>Lower your body towards the ground by bending your elbows, keeping your upper arms close to your sides.</li><li>Keep your elbows at a 45-degree angle to your body, and continue lowering until your chest touches the ground.</li><li>Push back up to the starting position by straightening your arms, keeping your core engaged and your body in a straight line throughout the movement.</li><li>Repeat</li></ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  },
  {
    "pk": 4,
    "fields": {
      "name": "Romanian Deadlift",
      "steps": "<ol><li>Stand with your feet shoulder-width apart and your toes pointing forward. Hold a barbell with an overhand grip in front of your thighs .</li><li>Brace your core, keep your chest up, and slowly bend your knees while hinging at your hips. As you hinge, push your hips back and lower the weight toward the floor. Keep your back straight and your shoulders down.</li><li>Continue lowering the weight until you feel a stretch in your hamstrings. Your knees should be slightly bent but not locked. You can lower the weight until it touches the floor or stops just below your knees.</li><li>Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall. As you stand up, squeeze your glutes and hamstrings.</li><li>Repeat.</li><ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 5,
    "fields": {
      "name": "Dumbbell Romanian Deadlift",
      "steps": "<ol><li>Stand with your feet shoulder-width apart and your toes pointing forward. Hold a pair of dumbbells with an overhand grip in front of your thighs .</li><li>Brace your core, keep your chest up, and slowly bend your knees while hinging at your hips. As you hinge, push your hips back and lower the weight toward the floor. Keep your back straight and your shoulders down.</li><li>Continue lowering the weight until you feel a stretch in your hamstrings. Your knees should be slightly bent but not locked. You can lower the weight until it touches the floor or stops just below your knees.</li><li>Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall. As you stand up, squeeze your glutes and hamstrings.</li><li>Repeat.</li><ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 6,
    "fields": {
      "name": "Single-Leg Romanian Deadlift",
      "steps": "<ol><li>Begin by standing on one leg, with a slight bend in the knee. Keep your other leg off the ground and behind you.</li><li>Hold a dumbbell or kettlebell in the opposite hand of the leg you are standing on.</li><li>Brace your core, keep your chest up, and slowly hinge forward at the hips, keeping your back straight and your shoulders down. As you hinge, lift your non-standing leg behind you, keeping it in line with your torso.</li><li>Continue lowering the weight until you feel a stretch in your hamstring. Your standing knee should be slightly bent but not locked.</li><li>Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall while bringing your lifted leg back down to the ground.</li><li>Repeat for the desired number of repetitions on one leg before switching to the other.</li><ol>",
      "notes": "",
      "primary_muscles": [7, 8, 10],
      "secondary_muscles": [5, 18, 20]
    }
  },
  {
    "pk": 7,
    "fields": {
      "name": "Air Squat",
      "steps": "<ol><li>Stand with your feet shoulder-width apart and point your toes slightly outward.</li><li>Keep your chest up, shoulders back, and core engaged.</li><li>Lower your body by bending your knees and pushing your hips back as if you were sitting in a chair.</li><li>Keep your weight on your heels and your knees behind your toes.</li><li>Lower yourself until your thighs are parallel to the ground or as low as you can comfortably go while maintaining good form.</li><li>Pause briefly at the bottom of the squat.</li><li>Push through your heels to stand back up, driving your hips forward as you do.</li><li>Stand up straight and repeat.</li></ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 8,
    "fields": {
      "name": "Face Pull",
      "steps": "<ol><li>Start by attaching a rope to a high pulley on a cable machine.</li><li>Grasp the rope or cable with both hands using an overhand grip, with your palms facing each other.</li><li>Step back a few feet from the cable machine, so there is tension in the rope or cable.</li><li>Stand with your feet shoulder-width apart, and engage your core muscles to maintain good posture throughout the exercise.</li><li>Pull the rope or cable towards your face, leading with your elbows.</li><li>Keep your elbows high and out to the sides as you pull the rope towards your face until your hands reach your temples or the sides of your head.</li><li>Hold the position for a second, then slowly lower the rope back to the starting position.</li><li>Repeat for the desired number of repetitions.</li></ol>",
      "notes": "Focus on using your back muscles to perform the movement rather than relying on your arms or shoulders.",
      "primary_muscles": [13, 14, 15],
      "secondary_muscles": [17, 20]
    }
  },
  {
    "pk": 9,
    "fields": {
      "name": "Bench Press",
      "steps": "<ol><li>Lie on a flat bench with your feet firmly planted on the ground.</li><li>Grip the barbell with your hands slightly wider than shoulder-width apart, with your palms facing away from your body.</li><li>Lift the bar off the rack and hold it directly above your chest with extended arms.</li><li>Slowly lower the bar down to your chest, keeping your elbows close to your body.</li><li>Pause briefly when the bar touches your chest.</li><li>Push the bar back up to the starting position by extending your arms.</li><li>Repeat.</li></ol>",
      "notes": "<ul><li>Ensure your back is flat against the bench, and your feet are firmly planted on the ground.</li><li>Keep your core tight, and your elbows close to your body throughout the movement.</li><li>Exhale as you push the bar away from your chest, and inhale as you lower it down.</li></ul>",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 10,
    "fields": {
      "name": "Dumbbell Squat",
      "steps": "<ol><li>Stand with your feet shoulder-width apart, with your toes pointing slightly outward.</li><li>Hold a dumbbell in each hand by your sides, with your palms facing inward.</li><li>Engage your core and keep your chest lifted throughout the movement.</li><li>Lower your body by bending at the hips and knees as if sitting on a chair.</li><li>Keep your weight in your heels, and make sure your knees are tracking over your toes.</li><li>Lower your body until your thighs are parallel to the ground or until you reach your desired depth.</li><li>Push through your heels to stand back up to the starting position.</li><li>Repeat.</li></ol>",
      "notes": "Keep your knees in line with your toes throughout the movement.",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 11,
    "fields": {
      "name": "Deadlift",
      "steps": "",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 12, 18, 20]
    }
  },
  {
    "pk": 12,
    "fields": {
      "name": "Plank",
      "steps": "",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 13,
    "fields": {
      "name": "Leg Press",
      "steps": "<ol><li>Adjust the seat of the leg press machine so that your knees are at a ~90-degree angle when your feet are on the footplate.</li><li>Sit on the machine and place your feet shoulder-width apart on the footplate.</li><li>Push the footplate away from your body by extending your legs.</li><li>Lower the footplate back towards your body by bending your legs and keeping your feet flat on the plate.</li><li>Repeat.</li></ol>",
      "notes": "<ol><li>Keep your back flat against the seat throughout the movement.</li><li>Keep your feet flat on the footplate, and make sure your knees are tracking in line with your toes.</li><li>Exhale as you push the footplate away from your body, and inhale as you lower it back down.</li><li>Avoid locking out your knees at the top of the movement, as this can put unnecessary stress on the joint.</li></ol>",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [8]
    }
  },
  {
    "pk": 14,
    "fields": {
      "name": "Cross-body Dumbbell Curl",
      "steps": "<ol><li>Stand up, leaning slightly forward from a straight position, feet shoulder-width apart, and your knees slightly bent.</li><li>Hold a dumbbell in each hand, with your palms facing your body and arms fully extended at your sides.</li><li>Keeping your elbows close to your body, slowly curl one dumbbell up toward your opposite shoulder.</li><li>Pause at the top of the curl, squeezing your bicep before slowly lowering the weight to the starting position.</li><li>Repeat the curl on the opposite side, curling the other dumbbell toward the opposite shoulder while rotating your torso.</li><li>Continue alternating curls on each side for the desired number of repetitions.</li></ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 15,
    "fields": {
      "name": "Frog Pumps",
      "steps": "<ol><li>Lie on your back with your knees bent and your feet flat on the ground. Keep your feet close together and your heels touching.</li><li>Bring your feet up towards your hips along the ground until they're about 6 inches apart, and then let your knees fall out to the sides so that your feet are touching each other. This is the starting position.</li><li>Engage your glutes and lift your hips up towards the ceiling as high as you can, making sure to keep your feet and knees in the same position.</li><li>Hold the top position for 1-2 seconds, then slowly lower your hips to the starting position.</li><li>Repeat.</li></ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 16,
    "fields": {
      "name": "Lying Windshield Wiper",
      "steps": "<ol><li>Lie flat on your back with your arms extended out to the sides, palms down, and your legs extended straight up towards the ceiling.</li><li>Keep your feet together and engage your core muscles by drawing your navel towards your spine.</li><li>Lower your legs to one side, keeping them straight and close to the floor without touching it.</li><li>Pause briefly and then lift your legs back up to the starting position.</li><li>Repeat the movement, this time lowering your legs to the opposite side.</li><li>Continue alternating sides for the desired number of reps or time.</li></ol>",
      "notes": "Avoid swinging or using momentum to perform the movement; instead, control the action with your core muscles.",
      "primary_muscles": [11],
      "secondary_muscles": [1]
    }
  },
  {
    "pk": 17,
    "fields": {
      "name": "Bar Dip",
      "steps": "<ol><li>Start by approaching a set of parallel bars or dip bars approximately shoulder-width apart. Grab each bar with an overhand grip and hoist yourself up so your arms are fully extended, and your feet are off the ground.</li><li>Slightly lean forward and keep your elbows slightly bent to engage your chest, shoulders, and triceps muscles.</li><li>Lower your body by bending your elbows and leaning forward while keeping your back straight and your legs behind you. Keep your elbows close to your body throughout the entire exercise.</li><li>Continue lowering yourself until your arms are parallel to the ground, or slightly below parallel, while inhaling.</li><li>Push back up by straightening your arms while exhaling. Be sure to push with your triceps, chest, and shoulder muscles to return to your starting position.</li><li>Repeat.</li></ol>",
      "notes": "You can also add variations to the dip, such as weighted dips or assisted dips, to increase or decrease the intensity of the exercise.",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 18,
    "fields": {
      "name": "Arnold Press",
      "steps": "<ol><li>Hold a dumbbell in each hand and sit or stand with your feet shoulder-width apart.</li><li>Start with your arms bent so that your palms face your body and the dumbbells are at shoulder height.</li><li>As you press the dumbbells overhead, rotate your palms to face forward.</li><li>Continue to press the dumbbells overhead until your arms are fully extended.</li><li>Lower the dumbbells back down to the starting position, rotating your palms back to face your body as you do so.</li><li>Repeat.</li></ol>",
      "notes": "",
      "primary_muscles": [15, 17],
      "secondary_muscles": []
    }
  },
  {
    "pk": 19,
    "fields": {
      "name": "Back Extension",
      "steps": "<ol><li>Adjust the back extension bench so that the pads at the thigh are snug against your thighs and your feet are securely held in place by the footpads.</li><li>Cross your arms over your chest or hold them behind your head.</li><li>Keep your back straight and your neck in a neutral position. Hang your body forward over the thigh pads. This is the starting position.</li><li>Engage your lower back muscles and slowly lift your upper body off the bench until it aligns with your legs.</li><li>Hold this position for up to a few seconds, squeezing your glutes and lower back muscles at the top of the movement.</li><li>Slowly lower your upper body back down to the starting position.</li><li>Repeat.</li></ol>",
      "notes": "Hold weights such as plates to your chest to increase the exercise difficulty.",
      "primary_muscles": [7, 10],
      "secondary_muscles": [8]
    }
  },
  {
    "pk": 20,
    "fields": {
      "name": "One-Legged Glute Bridge",
      "steps": "<ol>\n  <li>Start by lying on your back with your knees bent and feet flat on the ground.</li>\n  <li>Lift your right leg off the ground and extend it straight up towards the ceiling.</li>\n  <li>Press your left foot into the ground and lift your hips up towards the ceiling.</li>\n  <li>Pause at the top of the movement and squeeze your glutes.</li>\n  <li>Lower your hips back down to the ground and repeat for the desired number of reps.</li>\n  <li>Switch legs and repeat the exercise on the other side.</li>\n</ol>",
      "notes": "For increased difficult, hold your leg parallel with your torso instead of extending your leg to the ceiling.",
      "primary_muscles": [7, 8],
      "secondary_muscles": [18]
    }
  },
  {
    "pk": 21,
    "fields": {
      "name": "Bodyweight Curl",
      "steps": "<ol>\n  <li>Adjust the height of the rings or TRX to waist height and stand facing them.</li>\n  <li>Hold the rings or TRX handles with an underhand grip and lean back, extending your arms straight in front of you.</li>\n  <li>Keep your feet shoulder-width apart and your body in a straight line from head to heels.</li>\n  <li>Engage your biceps and bend your elbows, pulling your body up towards the rings or TRX handles.</li>\n  <li>As you pull your body up, keep your elbows close to your body and your wrists straight.</li>\n  <li>When your hands reach your chest, pause for a moment and then slowly lower your body back down to the starting position.</li>\n  <li>Repeat the exercise for the desired number of reps.</li>\n  </ol>",
      "notes": "",
      "primary_muscles": [2, 9],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 22,
    "fields": {
      "name": "Hanging Leg Raise",
      "steps": "<ol>\n  <li>Hang from a pull-up bar with your arms straight and your feet off the ground.</li>\n  <li>Engage your core muscles and lift your legs up towards your chest, keeping them straight.</li>\n  <li>Pause briefly at the top of the movement, then slowly lower your legs back down to the starting position.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": [11]
    }
  },
  {
    "pk": 23,
    "fields": {
      "name": "Chair Squat",
      "steps": "<ol>\n  <li>Start by standing in front of a chair with your feet shoulder-width apart.</li>\n  <li>Slowly lower your body towards the chair by bending your knees and pushing your hips back.</li>\n  <li>Keep your chest up and your weight on your heels.</li>\n  <li>Lower your body until your buttocks touch the chair.</li>\n  <li>Pause for a moment, then push through your heels to stand back up.</li>\n  <li>Repeat for the desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 24,
    "fields": {
      "name": "BOSU Burpee",
      "steps": "<ol>\n  <li>Start in a standing position with the BOSU ball on the ground (inflated-side down) in front of you.</li>\n  <li>Place your hands on the BOSU ball and jump your feet back into a plank position.</li>\n  <li>Perform a push-up while keeping your hands on the BOSU ball.</li>\n  <li>Jump your feet back towards the BOSU ball and stand up.</li>\n  <li>Lift the BOSU ball overhead and jump up, extending your arms towards the ceiling.</li>\n  <li>Land softly and repeat the exercise for desired number of reps.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 12, 16, 17],
      "secondary_muscles": [1, 20]
    }
  },
  {
    "pk": 25,
    "fields": {
      "name": "Machine Shoulder Press",
      "steps": "<ol>\n  <li>Adjust the seat height so that the handles are at shoulder level.</li>\n  <li>Sit on the machine with your back against the pad and your feet flat on the floor.</li>\n  <li>Grasp the handles with an overhand grip and push them upward until your arms are fully extended.</li>\n  <li>Slowly lower the handles back down to shoulder level, keeping your elbows slightly bent.</li>\n  <li>Repeat for desired number of repetitions.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 26,
    "fields": {
      "name": "Leg Extension",
      "steps": "<ol>\n  <li>Adjust the machine to fit your body and select the appropriate weight.</li>\n  <li>Sit on the machine with your back against the backrest and your feet or ankle flat against the supporting pad.</li>\n  <li>Grasp the handles on the side of the machine for stability.</li>\n  <li>Extend your legs out in front of you until they are parallel to the floor, keeping your feet flexed and your knees slightly bent.</li>\n  <li>Hold for a moment, then slowly lower the weight back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [12],
      "secondary_muscles": []
    }
  },
  {
    "pk": 27,
    "fields": {
      "name": "Close-Grip Feet-Up Bench Press",
      "steps": "<ol>\n  <li>Lie flat on a bench with your feet up and your back pressed against the bench.</li>\n  <li>Grasp the barbell with a close grip, with your hands shoulder-width apart.</li>\n  <li>Unrack the barbell and hold it above your chest with your arms extended.</li>\n  <li>Lower the barbell to your chest, keeping your elbows close to your body.</li>\n  <li>Pause briefly at the bottom of the movement, then press the barbell back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [21],
      "secondary_muscles": [4, 16]
    }
  },
  {
    "pk": 28,
    "fields": {
      "name": "Barbell Rear Delt Row",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Hold a barbell with an overhand grip, hands shoulder-width apart.</li>\n  <li>Lean forward at the hips, keeping your back straight and your abs engaged.</li>\n  <li>Bring the barbell up towards your chest, keeping your elbows close to your body.</li>\n  <li>Squeeze your shoulder blades together at the top of the movement.</li>\n  <li>Lower the barbell back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [15, 20],
      "secondary_muscles": [2, 5, 13, 14]
    }
  },
  {
    "pk": 29,
    "fields": {
      "name": "Hip Abduction Machine",
      "steps": "<ol>\n  <li>Adjust the machine to fit your height and leg length.</li>\n  <li>Sit on the machine with your back against the backrest and your feet on the footrests.</li>\n  <li>Press your legs outward against the resistance of the machine.</li>\n  <li>With your knees at their farthest point, hold the weight for a moment before slowly releasing the resistance and returning to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [19],
      "secondary_muscles": [7]
    }
  },
  {
    "pk": 30,
    "fields": {
      "name": "Cable Curl With Rope",
      "steps": "<ol>\n  <li>Attach a rope to a low pulley cable machine.</li>\n  <li>Stand facing the machine with feet shoulder-width apart and knees slightly bent.</li>\n  <li>Grasp the rope with an underhand grip, palms facing each other.</li>\n  <li>Keep elbows close to your sides and curl the rope towards your shoulders.</li>\n  <li>Pause briefly at the top of the movement, then slowly lower the rope back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 31,
    "fields": {
      "name": "Plank - BOSU",
      "steps": "<ol>\n  <li>Place a BOSU ball on the ground with the flat side facing up.</li>\n  <li>Assume a plank position with your forearms on the BOSU ball and your toes on the ground.</li>\n  <li>Engage your core and keep your body in a straight line from head to heels.</li>\n  <li>Hold the position for the desired amount of time.</li>\n  <li>Release the position by lowering your knees to the ground.</li>\n</ol>",
      "notes": "Instead of placing your forearms on the flat side of the BOSU, you can grab the edges with both hands and plank from a straight-armed position.",
      "primary_muscles": [1],
      "secondary_muscles": []
    }
  },
  {
    "pk": 32,
    "fields": {
      "name": "Machine Glute Kickbacks",
      "steps": "<ol>\n  <li>Adjust the machine to fit your body height</li>\n  <li>Position yourself in the machine with your hands on the handles and one ankle on the padding.</li>\n  <li>Keeping your core engaged, exhale and extend your leg back as far as possible while squeezing your glutes.</li>\n  <li>Inhale and slowly return your leg to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7],
      "secondary_muscles": [8, 18]
    }
  },
  {
    "pk": 33,
    "fields": {
      "name": "Pause Squat",
      "steps": "<ol>\n  <li>Start with your feet shoulder-width apart, your toes pointing slightly outward, and the barbell on your shoulders.</li>\n  <li>Lower your body into a squat position, keeping your back straight and your knees tracking with your toes.</li>\n  <li>Pause at the bottom of the squat for 2-3 seconds.</li>\n  <li>Slowly rise back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 34,
    "fields": {
      "name": "Barbell Walking Lunge",
      "steps": "<ol>\n  <li>Start with your feet hip-width apart and the barbell on your shoulders.</li>\n  <li>Take a large step forward with your right foot, lowering your body until your right thigh is parallel to the ground and your left knee is hovering just above the floor.</li>\n  <li>Push through your right heel to stand back up, bringing your left foot forward to meet your right foot.</li>\n  <li>Repeat the lunge on the other side by stepping forward with your left foot.</li>\n  <li>Continue alternating lunges for the desired number of reps or distance.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": []
    }
  },
  {
    "pk": 35,
    "fields": {
      "name": "Medicine Ball Rotational Throw",
      "steps": "<ol>\n  <li>Start by standing about arms-length away from the wall with your feet shoulder-width apart.</li>\n  <li>Hold a medicine ball with both hands at chest height.</li>\n  <li>Rotating your core and upper body towards the wall, explosively throw the ball against the wall.</li>\n  <li>Catch the ball as it rebounds off the wall and rotate your body away from the wall.</li>\n  <li>Repeat for the desired number of reps and then switch sides.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [11],
      "secondary_muscles": [1, 16]
    }
  },
  {
    "pk": 36,
    "fields": {
      "name": "T-Bar Row",
      "steps": "<ol>\n  <li>Load the desired weight onto the T-Bar machine.</li>\n  <li>Stand facing the T-Bar machine with your feet shoulder-width apart.</li>\n  <li>Bend your knees slightly and hinge forward at the hips, keeping your back straight.</li>\n  <li>Grasp the handles of the T-Bar with an overhand grip.</li>\n  <li>Pull the T-Bar towards your chest, keeping your elbows close to your body.</li>\n  <li>Pause briefly at the top of the movement, squeezing your shoulder blades together.</li>\n  <li>Slowly lower the T-Bar back to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9, 15, 20],
      "secondary_muscles": [2, 5, 10, 13, 14]
    }
  },
  {
    "pk": 37,
    "fields": {
      "name": "Dumbbell Shoulder Press",
      "steps": "<ol>\n  <li>Start by sitting on a bench with a dumbbell in each hand, resting on your thighs.</li>\n  <li>Raise the dumbbells to shoulder height, palms facing forward, and elbows bent.</li>\n  <li>Press the dumbbells upward until your arms are fully extended above your head.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower the dumbbells back down to shoulder height.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [16],
      "secondary_muscles": [17, 21]
    }
  },
  {
    "pk": 38,
    "fields": {
      "name": "Barbell Upright Row",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Grasp the barbell with an overhand grip, hands narrower than shoulder-width apart.</li>\n  <li>Hold the barbell in front of your thighs with your arms extended.</li>\n  <li>Exhale and lift the barbell straight up towards your chin, keeping it close to your body.</li>\n  <li>Pause for a moment at the top of the movement, then inhale and slowly lower the barbell back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [17],
      "secondary_muscles": [2, 16, 20]
    }
  },
  {
    "pk": 39,
    "fields": {
      "name": "Dumbbell Rear Delt Row",
      "steps": "<ol>\n  <li>Stand with your feet shoulder-width apart and hold a dumbbell in each hand.</li>\n  <li>Bend your knees slightly and hinge forward at the hips, keeping your back straight.</li>\n  <li>Bring the dumbbells up to your chest, keeping your elbows close to your body.</li>\n  <li>Slowly lower the dumbbells back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [15, 20],
      "secondary_muscles": [2, 5, 13, 14]
    }
  },
  {
    "pk": 40,
    "fields": {
      "name": "Dumbbell Floor Press",
      "steps": "<ol>\n  <li>Lie flat on your back on the floor with your knees bent and feet flat on the ground.</li>\n  <li>Hold a dumbbell in each hand with your palms facing towards your feet.</li>\n  <li>Extend your arms straight up towards the ceiling, with your elbows slightly bent.</li>\n  <li>Slowly lower the dumbbells down towards your chest, keeping your elbows close to your body.</li>\n  <li>Pause when your upper arms touch the ground.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [21]
    }
  },
  {
    "pk": 41,
    "fields": {
      "name": "Incline Dumbbell Curl",
      "steps": "<ol>\n  <li>Adjust the bench to a 45-degree angle.</li>\n  <li>Grab a pair of dumbbells and sit on the bench with your back straight.</li>\n  <li>Let your arms hang down by your sides with your palms facing forward.</li>\n  <li>Slowly curl the dumbbells up towards your shoulders while keeping your elbows close to your body.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower the dumbbells back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [2],
      "secondary_muscles": [5]
    }
  },
  {
    "pk": 42,
    "fields": {
      "name": "Eccentric Heel Drop",
      "steps": "<ol>\n  <li>Stand on a raised platform or step with the balls of your feet on the edge and your heels hanging off.</li>\n  <li>Raise your heels up as high as possible.</li>\n  <li>Shift your weight onto one foot and slowly lower your heel down below the platform.</li>\n  <li>Use your other foot to push yourself back up to the starting position.</li>\n  <li>Repeat for the desired number of repetitions on one leg before switching to the other.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [3],
      "secondary_muscles": []
    }
  },
  {
    "pk": 43,
    "fields": {
      "name": "Belt Squat",
      "steps": "<ol>\n  <li>Add your desired weight to the machine.</li>\n  <li>Attach a belt or harness around your waist.</li>\n  <li>Attach a cable or chain to the belt or harness.</li>\n  <li>Stand on a platform or box with feet shoulder-width apart.</li>\n  <li>Hold onto a stable object for balance.</li>\n  <li>Squat by bending the knees and hips while keeping the back straight.</li>\n  <li>Pause at the bottom of the squat and then push up through the legs to return to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 44,
    "fields": {
      "name": "Hang Power Clean",
      "steps": "<ol>\n  <li>Start with feet shoulder-width apart, toes pointing forward, and grip a weighted barbell with an overhand grip just outside of your legs.</li>\n  <li>Lower your hips and bend your knees, keeping your back straight and your chest up.</li>\n  <li>Drive your hips forward and explosively pull the barbell up towards your shoulders, keeping it close to your body.</li>\n  <li>As the barbell reaches your chest, quickly drop your elbows underneath it and catch it on your shoulders in a front rack position.</li>\n  <li>Stand up straight, keeping the barbell close to your body, and then lower it back down to the starting position.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 10],
      "secondary_muscles": [5, 8, 18, 20]
    }
  },
  {
    "pk": 45,
    "fields": {
      "name": "Teaser Sit-Up",
      "steps": "<ol>\n  <li>Start by lying on your back with your arms extended above your head and your legs straight out in front of you.</li>\n  <li>Engage your core muscles and lift your legs up to a 45-degree angle while simultaneously lifting your upper body off the ground.</li>\n  <li>Reach your arms forward and try to touch your toes with your fingertips.</li>\n  <li>Hold the position for a few seconds, then slowly lower your body back down to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [1],
      "secondary_muscles": []
    }
  },
  {
    "pk": 46,
    "fields": {
      "name": "Barbell Hack Squat",
      "steps": "<ol>\n  <li>Stand in front of the barbell with your feet shoulder-width apart. The barbell will be by the back of your calves.</li>\n  <li>Bend down and grip the barbell with an overhand grip, with your palms facing behind you.</li>\n  <li>Stand up straight, lifting the barbell off the ground and holding it behind your legs.</li>\n  <li>Keeping your back straight, lower your body by bending your knees and hips, as if you were sitting down on a chair, until your thighs are parallel to the ground.</li>\n  <li>Push through your heels to stand back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [12],
      "secondary_muscles": [3, 5, 7, 10, 18, 20]
    }
  },
  {
    "pk": 47,
    "fields": {
      "name": "Straight Arm Lat Pulldown",
      "steps": "<ol>\n  <li>Adjust the cable machine to a high position and attach a straight bar to the cable.</li>\n  <li>Stand facing the machine with your feet shoulder-width apart and your knees slightly bent.</li>\n  <li>Grasp the bar with both hands using an overhand grip, with your hands slightly wider than shoulder-width apart.</li>\n  <li>Engage your core and keep your arms straight as you pull the bar down towards your thighs, using your lats to initiate the movement.</li>\n  <li>Pause for a moment at the bottom of the movement, then slowly release the bar back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [9],
      "secondary_muscles": [13, 14, 15]
    }
  },
  {
    "pk": 48,
    "fields": {
      "name": "Lying Dumbbell Internal Shoulder Rotation",
      "steps": "<ol>\n  <li>Begin by lying on your side on a flat bench with your arm extended straight out in front of you and your elbow bent at a 90-degree angle.</li>\n  <li>Hold a dumbbell in your hand with your palm facing up towards the ceiling.</li>\n  <li>Slowly rotate your arm inwards towards your body, keeping your elbow bent and your upper arm stationary.</li>\n  <li>Pause for a moment at the top of the movement, then slowly lower the dumbbell back to the starting position.</li>\n  <li>Repeat for the desired number of repetitions, then switch sides and repeat the exercise with your other arm.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [14],
      "secondary_muscles": []
    }
  },
  {
    "pk": 49,
    "fields": {
      "name": "Landmine Squat",
      "steps": "<ol>\n  <li>Start by placing a barbell into a landmine attachment or securely anchor it into a corner.</li>\n  <li>Stand facing the barbell with your feet shoulder-width apart and your toes pointing slightly outward.</li>\n  <li>Grab the end of the barbell with both hands and lift it up to your chest.</li>\n  <li>Lower your hips down and back, keeping your chest up and your back straight.</li>\n  <li>Bend your knees and lower your body until your thighs are parallel to the ground.</li>\n  <li>Push through your heels and stand back up to the starting position.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [7, 12, 18],
      "secondary_muscles": [3]
    }
  },
  {
    "pk": 50,
    "fields": {
      "name": "Push-Ups With Feet in Rings",
      "steps": "<ol>\n  <li>Start in a plank position with your feet in the rings and your hands shoulder-width apart on the ground.</li>\n  <li>Lower your body towards the ground by bending your elbows and keeping your body straight.</li>\n  <li>Push yourself back up to the starting position by straightening your arms.</li>\n  <li>Repeat.</li>\n</ol>",
      "notes": "",
      "primary_muscles": [4, 16],
      "secondary_muscles": [1, 21]
    }
  }
]
