[
  {
    "pk": 1,
    "name": "Prone Assisted Neck Bridge",
    "slug": "prone-assisted-neck-bridge",
    "primaryMuscles": ["shoulder - back", "trap"],
    "secondaryMuscles": ["lower back", "tricep"],
    "steps": [
      "Place a yoga or exercise mat on the floor for head padding.",
      "Position the top of your head on the floor with your arms bent at the elbows, hands on the ground by both sides of your head, supporting your upper body.",
      "Support your lower body by balancing on the balls of your toes.",
      "Hinge at the hips to maintain a neutral spine throughout the movement.",
      "Hold the bridge position for up to 8 seconds or as long as comfortable.",
      "Lower your heels back down to the floor and extend your arms at the elbows to finish one repetition.",
      "Repeat the exercise for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 2,
    "name": "One-Arm Hands-and-Knees Spine Twist",
    "slug": "one-arm-hands-and-knees-spine-twist",
    "primaryMuscles": ["lower back", "oblique"],
    "secondaryMuscles": ["shoulder - back", "trap"],
    "steps": [
      "Kneel down and sit back onto your heels.",
      "Place both elbows on the ground in front of you.",
      "Raise one arm and place your hand behind your head.",
      "Rotate your upper body towards the side with the raised arm, looking up.",
      "Hold the stretch for 5 seconds.",
      "Slowly return to the starting position.",
      "Repeat the stretch for the desired number of repetitions on each side."
    ],
    "notes": ""
  },
  {
    "pk": 3,
    "name": "One-Leg Hip Dip",
    "slug": "one-leg-hip-dip",
    "primaryMuscles": ["glute"],
    "secondaryMuscles": ["calf", "quad"],
    "steps": [
      "Stand on one leg with the other leg bent and lifted off the ground.",
      "Keep the knee of the standing leg straight and your spine neutral.",
      "Tilt your hips by lowering the side with the lifted leg towards the ground slowly.",
      "Lift the hip of the suspended leg towards the ceiling by engaging the hip muscles.",
      "Avoid leaning your torso to keep the spine neutral throughout the movement.",
      "Repeat the movement for the desired number of repetitions and then switch to the other leg."
    ],
    "notes": ""
  },
  {
    "pk": 4,
    "name": "One-Leg Wide Lunge",
    "slug": "one-leg-wide-lunge",
    "primaryMuscles": ["glute", "hamstring"],
    "secondaryMuscles": ["quad"],
    "steps": [
      "Start in a plank or push-up position with both hands on the floor.",
      "Step one foot forward, placing it just outside your hand on the same side.",
      "Keep the back leg extended straight behind you with toes tucked under.",
      "Lower your hips towards the floor to stretch the front leg’s hamstrings and glutes. Your back knee may touch the floor.",
      "Push your hips forward to stretch the hip flexors of the back leg.",
      "Hold the stretch for the desired time and switch to the other side."
    ],
    "notes": ""
  },
  {
    "pk": 5,
    "name": "One-Leg Rock-Paper-Scissor Toes",
    "slug": "one-leg-rock-paper-scissor-toes",
    "primaryMuscles": ["calf"],
    "secondaryMuscles": [],
    "steps": [
      "Sit on a chair or on the floor. Raise one foot off the floor, holding the leg up by the raised knee.",
      "Curl all toes to create the ‘rock’ position.",
      "Return to neutral with toes relaxed.",
      "Spread all toes apart into the ‘paper’ position.",
      "Extend the big toe while keeping other toes curled for the ‘scissors’ position part one.",
      "Curl the big toe and extend the other four toes for the ‘scissors’ position part two.",
      "Continue alternating between the ‘rock’, ‘paper’, and both ‘scissors’ positions for the desired number of repetitions before switching to the other side."
    ],
    "notes": ""
  },
  {
    "pk": 6,
    "name": "One-Leg Seated Knee-to-Chest – Foam Roller",
    "slug": "one-leg-seated-knee-to-chest-foam-roller",
    "primaryMuscles": ["glute", "lower back"],
    "secondaryMuscles": ["hamstring", "quad"],
    "steps": [
      "Sit on the floor and place a foam roller behind your lower back.",
      "Lean back slowly onto the foam roller, positioning it under your lumbar spine.",
      "Hug one knee to your chest, keeping the other leg straight on the floor to avoid arching your lower back.",
      "Find a tender spot and hold gentle pressure on it for the desired time. Hold each position instead of rolling.",
      "Switch sides and hold the stretch for the same amount of time on the other leg."
    ],
    "notes": ""
  },
  {
    "pk": 7,
    "name": "Calf Massage – Lacrosse Ball",
    "slug": "calf-massage-lacrosse-ball",
    "primaryMuscles": ["calf"],
    "secondaryMuscles": [],
    "steps": [
      "Sit on the floor and place a massage ball under your calf muscle.",
      "Apply gentle pressure by pressing your leg down onto the ball.",
      "Slowly flex your foot upward (dorsiflex) to stretch the calf while keeping pressure on the ball.",
      "Then point your foot downward (plantarflex) to massage the calf.",
      "Repeat the flexing and pointing movement slowly to massage the muscle.",
      "Hold the massage for the desired time and switch to the other calf if needed."
    ],
    "notes": "Increase the pressure of your calf on the ball by adding your other leg's ankle onto the pressured leg's shin to press down."
  },
  {
    "pk": 8,
    "name": "One-Arm Wall Push Front Bend",
    "slug": "one-arm-wall-push-front-bend",
    "primaryMuscles": ["chest", "lat", "shoulder - front"],
    "secondaryMuscles": [],
    "steps": [
      "Stand facing a wall and place one hand flat against it at shoulder height.",
      "Step back slightly and bend forward at the hips, keeping your arm straight and pressed into the wall.",
      "Lift your arm upward along the wall to increase the stretch in the front of your shoulder.",
      "Keep your back flat and your core engaged to avoid arching.",
      "Hold the stretch for the desired time and switch to the other side."
    ],
    "notes": ""
  },
  {
    "pk": 9,
    "name": "One-Leg Lying Ankle Nerve Floss",
    "slug": "one-leg-lying-ankle-nerve-floss",
    "primaryMuscles": ["calf", "hamstring"],
    "secondaryMuscles": ["glute"],
    "steps": [
      "Lie on your back on a padded surface with one thigh lifted to 90 degrees and supported by both both hands interlaced on the hamstring.",
      "Keep the raised knee as straight as possible without causing nerve tension.",
      "Keep the other leg straight and flat on the floor.",
      "Simultaneously lift your head off the ground and at your chest while pointing your toes away from you (plantarflex).",
      "Then, lower your head and look towards the ceiling while pulling your raised foot toward you (dorsiflex).",
      "Repeat the movement for the desired number of repetitions then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 10,
    "name": "One-Leg Three-Point Lunge",
    "slug": "one-leg-three-point-lunge",
    "primaryMuscles": ["glute", "quad"],
    "secondaryMuscles": ["hamstring"],
    "steps": [
      "Stand with the right leg planted firmly on the ground.",
      "Visualize standing in the center of a triangle with one point in front of you and two behind.",
      "Bend the right knee slightly and lunge the left leg back to the rear-left triangle point. Tap the rear-left triangle point with your left toes without putting weight on that foot.",
      "Return to standing position.",
      "Bend the right knee and gently tap the floor front triangle point with your left heel.",
      "Return to standing position.",
      "Bend the right knee again and reach the left leg back to the rear-right triangle point. Your left leg will cross behind your right. Your left knee will drop nearly to the floor in a \"curtsy\". Touch the rear-right triangle point with your toes without putting weight on that foot.",
      "Return to standing position. This is one repetition.",
      "Continue repeating the movement for the desired number of repetitions then switch target legs."
    ],
    "notes": ""
  },
  {
    "pk": 11,
    "name": "Lying Glute Bridge – BOSU Ball",
    "slug": "lying-glute-bridge-bosu-ball",
    "primaryMuscles": ["glute"],
    "secondaryMuscles": ["hamstring", "lower back"],
    "steps": [
      "Lie on your back with your feet shoulder-width apart and knees bent at 90 degrees, placing your feet on the flat side of a BOSU ball.",
      "Press your feet firmly into the BOSU ball and lift your hips by squeezing your glutes and extending your hips upward.",
      "Hold your hips in a lifted position without arching your lower back.",
      "Slowly lower your hips back down to the starting position.",
      "You can hold your hips in the lifted position for a desired amount of time or repeat the movement for the desired number of repetitions."
    ],
    "notes": "Engage your core to keep a neutral spine throughout the movement."
  },
  {
    "pk": 12,
    "name": "Neck Twist – Lacrosse Ball",
    "slug": "neck-twist-lacrosse-ball",
    "primaryMuscles": ["trap"],
    "secondaryMuscles": [],
    "steps": [
      "Place a massage or lacrosse ball against the front and outer side of your neck.",
      "Use your hand to gently compress the ball into the muscles.",
      "Slowly rotate your head to the opposite side to increase the stretch on the neck.",
      "Use small movements to massage the muscle group while maintaining gentle pressure.",
      "Hold the massage and stretch for the desired time and switch to the other side."
    ],
    "notes": ""
  },
  {
    "pk": 13,
    "name": "Alternating Lying Chin Tuck Neck Twist",
    "slug": "alternating-lying-chin-tuck-neck-twist",
    "primaryMuscles": ["trap"],
    "secondaryMuscles": [],
    "steps": [
      "Lie on your back with your forehead and chin parallel to the floor.",
      "Tuck your chin in gently without lifting your head.",
      "Rotate your neck slowly all the way to one side.",
      "Return your head to center and rest briefly.",
      "Rotate your neck all the way to the opposite side.",
      "Return your head to center to complete one repetition.",
      "Alternate the starting side with each new set.",
      "Repeat the exercise for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 14,
    "name": "One-Leg Seated Hip Flexor Hold",
    "slug": "one-leg-seated-hip-flexor-hold",
    "primaryMuscles": ["quad"],
    "secondaryMuscles": ["lower back"],
    "steps": [
      "Sit on a comfortable surface with a neutral spine.",
      "Lift one knee as high as possible without arching or rounding your back.",
      "Place both hands on the lifted thigh and push down firmly while resisting the movement with your hip muscles.",
      "Maintain the contraction at the desired intensity for the set duration.",
      "Hold the contraction for the desired time and switch to the other side."
    ],
    "notes": ""
  },
  {
    "pk": 15,
    "name": "One-Arm Lying Spine Twist – Yoga Block",
    "slug": "one-arm-lying-spine-twist-yoga-block",
    "primaryMuscles": ["lower back", "oblique"],
    "secondaryMuscles": ["chest", "trap"],
    "steps": [
      "Lie on your side with your top leg supported by a yoga block or foam roller.",
      "Extend both arms straight in front of you, palms together.",
      "Lift your top arm up towards the ceiling while keeping your legs stable. Your gaze should follow the top arm while it travels.",
      "Rotate your upper body, moving your top arm behind your back, face twisted towards the top arm, without lifting your leg off the support.",
      "Hold the pose for the desired amount of time before repeating the exercise on the other side."
    ],
    "notes": ""
  },
  {
    "pk": 16,
    "name": "One-Arm Side Shoulder Pull – Band",
    "slug": "one-arm-side-shoulder-pull-band",
    "primaryMuscles": ["shoulder - side"],
    "secondaryMuscles": ["rotator cuff - back", "rotator cuff - front"],
    "steps": [
      "Anchor one end of a thick strength band to a stable pull-up bar or object.",
      "Loop the free end of the band around your wrist with your arm raised to shoulder height beside you.",
      "Lean your body away from the band, moving to the opposite side while keeping your arm raised.",
      "Relax your shoulder muscles and let gravity pull your arm gently to stretch the shoulder.",
      "Hold the stretch for the desired time and switch to the other side."
    ],
    "notes": ""
  },
  {
    "pk": 17,
    "name": "One-Leg Assisted Side Lunge",
    "slug": "one-leg-assisted-side-lunge",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Stand next to a chair, wall, or stable counter and hold it for support.",
      "Bend the knee of the leg closest to the support, ensuring it stays aligned with the middle of your foot.",
      "Step the other leg out to the side, keeping your leg straight, foot flat, and toes pointing forward.",
      "Use your support to help balance as you lower into the side lunge. Move your hips towards the support, stretching your inner thigh on your straight leg.",
      "Push through the bent leg to return to standing, extending your knee.",
      "Repeat the stretch for the desired number of repetitions, then switch to the other side."
    ],
    "notes": ""
  },
  {
    "pk": 18,
    "name": "Shoulder Blade Push Up",
    "slug": "shoulder-blade-push-up",
    "primaryMuscles": ["lat", "trap"],
    "secondaryMuscles": ["shoulder - front"],
    "steps": [
      "Start in a high plank position with your arms straight and hands under your shoulders.",
      "Squeeze your shoulder blades together, pulling them back toward each other.",
      "Push your shoulder blades forward as far as possible, spreading them apart.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": "Keep your elbows straight and upper back flat throughout the exercise. Modify by doing the exercise from your knees if the high plank is too challenging."
  },
  {
    "pk": 19,
    "name": "Lying Hamstring Bridge With Adductor Squeeze – Yoga Block",
    "slug": "lying-hamstring-bridge-with-adductor-squeeze-yoga-block",
    "primaryMuscles": ["glute", "hamstring", "thigh - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Lie on your back on a padded surface with a yoga block or foam roller between your knees.",
      "Squeeze the block with your inner thighs to engage your hip adductors.",
      "Bend your knees to more than 90 degrees and keep your feet hip-distance apart.",
      "Brace your core to keep a neutral spine.",
      "Drive your heels into the ground and lift your hips until your thighs align with your torso.",
      "Hold the lift for the desired time or lower your hips back down to the floor to complete one repetition.",
      "Repeat the exercise for the desired time or number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 20,
    "name": "One-Leg Kick Back Hold – Band",
    "slug": "one-leg-kick-back-hold-band",
    "primaryMuscles": ["glute", "hamstring"],
    "secondaryMuscles": [],
    "steps": [
      "Loop a band around both ankles, keeping feet hip-width apart.",
      "Stand upright and engage your core to stabilize your body.",
      "Slowly extend one leg backward by kicking your foot behind you, keeping your knee straight.",
      "Hold the extended position, squeezing your glutes for up to 7 seconds.",
      "Return your leg to the starting neutral position with control.",
      "Repeat the stretch for the desired number of repetitions before switching to the other leg."
    ],
    "notes": ""
  },
  {
    "pk": 21,
    "name": "Heel Raise Hold",
    "slug": "heel-raise-hold",
    "primaryMuscles": ["calf"],
    "secondaryMuscles": [],
    "steps": [
      "Stand with your feet flat on the ground, shoulder-width apart.",
      "Shift your weight evenly across the balls of all your toes.",
      "Slowly raise your heels about 1 inch (2.5 cm) off the ground.",
      "Keep your toes and balls of your feet firmly planted and stable.",
      "Hold this raised position for 15-30 seconds.",
      "Lower your heels back down with control.",
      "Repeat the exercise for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 22,
    "name": "One-Leg Lying Outer Hip Twist",
    "slug": "one-leg-lying-outer-hip-twist",
    "primaryMuscles": ["thigh - outer"],
    "secondaryMuscles": [],
    "steps": [
      "Lie on your back with knees bent and feet flat on the floor.",
      "Cross one ankle over the opposite thigh just above the knee.",
      "Keep your upper back and shoulders pressed into the floor.",
      "Slowly rotate your hips away from the crossed leg, letting the bottom thigh fall toward the floor.",
      "Use the weight of the crossed leg to deepen the stretch in your outer hip.",
      "Hold the stretch for the desired time and switch to the other side."
    ],
    "notes": ""
  },
  {
    "pk": 23,
    "name": "One-Leg Lying Outer Thigh Contraction – Band",
    "slug": "one-leg-lying-outer-thigh-contraction-band",
    "primaryMuscles": ["thigh - outer"],
    "secondaryMuscles": ["glute"],
    "steps": [
      "Anchor a ~100 lbs pull-up assist band to a stable object so that the free end hangs at about hip height.",
      "Loop your ankle through the free end of the band.",
      "Lie on your back on a padded surface with the band anchor opposite the target hip.",
      "Allow the band to gently pull your hip outward until you feel a light stretch on the outer hip.",
      "Hold the stretch for 5-7 seconds while relaxing into the band’s pull.",
      "Contract the hip muscles to resist the band’s pull and hold the contraction for 5-7 seconds.",
      "Release the contraction and return to the stretch position to complete one repetition.",
      "Continue repetitions for the desired amount of time."
    ],
    "notes": ""
  }
]
