[
  {
    "pk": 1,
    "name": "Pull-Up",
    "slug": "pull-up",
    "primaryMuscles": ["lat"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - back"
    ],
    "steps": [
      "Begin by finding a sturdy horizontal bar high enough off the ground that you can hang from it with your feet off the floor.",
      "Stand underneath the bar and jump up, grabbing onto the bar with an overhand grip (palms facing away from you) and your hands slightly wider than shoulder-width apart. Your arms should be fully extended.",
      "Engage your core and retract your shoulder blades as you pull your body up towards the bar. Keep your elbows pointed downwards and your head in a neutral position.",
      "Continue pulling your body up until your chin is above the bar. Keep your core tight and your shoulders engaged throughout the movement.",
      "Pause briefly at the top of the movement, then slowly lower yourself back down to the starting position with control. Make sure to maintain a controlled descent and avoid letting your body swing or drop.",
      "Repeat the movement for your desired number of repetitions."
    ],
    "notes": "Try assisted variations using resistance bands or an assisted pull-up machine until you build the necessary strength."
  },
  {
    "pk": 2,
    "name": "Squat – Barbell",
    "slug": "squat-barbell",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Begin by standing with your feet shoulder-width apart and your toes pointing forward. Hold a barbell behind your neck, resting it on your shoulders with your elbows pointing down and your palms facing forward.",
      "Engage your core and keep your chest lifted as you bend your knees and lower your hips back and down as if sitting in a chair. Make sure to keep your weight on your heels and your knees tracking in line with your toes.",
      "As you descend into the squat, inhale and maintain proper form. Lean forward so that your chest is over your thighs. Keep your back straight and your core engaged. Lower your body until your thighs parallel the ground, and your hips should align with your knees.",
      "Pause briefly at the bottom of the movement, then exhale and push through your heels to stand back up to the starting position. Keep your core engaged and your chest lifted until you're fully standing.",
      "Repeat the movement for your desired number of repetitions.",
      "Place the barbell on the rack after you've finished your set."
    ],
    "notes": ""
  },
  {
    "pk": 3,
    "name": "Push-Up",
    "slug": "push-up",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Start in a plank position, with your hands shoulder-width apart and your fingers pointing forward.",
      "Keep your core engaged, your back straight, and your hips in line with your shoulders.",
      "Lower your body towards the ground by bending your elbows, keeping your upper arms close to your sides.",
      "Keep your elbows at a 45-degree angle to your body, and continue lowering until your chest touches the ground.",
      "Push back up to the starting position by straightening your arms, keeping your core engaged and your body in a straight line throughout the movement.",
      "Repeat"
    ],
    "notes": ""
  },
  {
    "pk": 4,
    "name": "Romanian Deadlift – Barbell",
    "slug": "romanian-deadlift-barbell",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Preferably, start with a loaded barbell at hip height on a squat rack. Alternatively, you can lift the barbell from the floor to the starting position.",
      "Stand with your feet hip-width apart, and grip the barbell with hands just outside your thighs using an overhand grip.",
      "Begin the movement with a slight bend in your knees, and keep your back straight and chest up throughout the exercise.",
      "Push your hips back, hinging at the hips to lower the barbell, while keeping it close to your body as the bar descends.",
      "Lower the weight to just below your knees or to mid-shin level — the exact point depends on your hamstring flexibility, without rounding your back.",
      "Pause briefly at the bottom of the movement, maintaining a braced core and tension in your hamstrings and glutes.",
      "Reverse the motion by driving your hips forward to return to a fully upright position, squeezing your glutes at the top of the movement.",
      "Repeat for the desired number of repetitions, ensuring that the tension is maintained in the target muscles without resting the bar on the floor between reps."
    ],
    "notes": "Differences between a RDL and a standard deadlift:<ul><li>Keep your legs relatively straight with only a slight bend in your knees.</li><li>Focus on the eccentric phase while hinging at the hips and lowering the weight.</li><li>Lower the bar just below the knees or to mid-shin level without touching the ground to maintain tension on the hamstrings and glutes throughout the exercise.</li></ul>"
  },
  {
    "pk": 5,
    "name": "Romanian Deadlift – Dumbbell",
    "slug": "romanian-deadlift-dumbbell",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Stand with your feet hip-width apart, holding a dumbbell in each hand with palms facing your body.",
      "Begin with a slight bend in your knees, keep your back straight, chest up, and shoulders back throughout the exercise.",
      "Push your hips back and hinge at the hips to lower the dumbbells along the front of your legs, maintaining a neutral spine.",
      "Lower the dumbbells to just below your knees or to mid-shin level, depending on your flexibility, while keeping the weights close to your legs.",
      "Pause briefly at the bottom of the movement, ensuring your core is braced and your hamstrings and glutes are engaged.",
      "Thrust your hips forward to lift your torso back to the starting position, simultaneously contracting your glutes at the top of the movement.",
      "Repeat the movement for the desired number of repetitions without letting the dumbbells touch the floor between reps to keep tension on the muscles."
    ],
    "notes": "Differences between a RDL and a standard deadlift:<ul><li>Keep your legs relatively straight with only a slight bend in your knees.</li><li>Focus on the eccentric phase while hinging at the hips and lowering the weight.</li><li>Lower the bar just below the knees or to mid-shin level without touching the ground to maintain tension on the hamstrings and glutes throughout the exercise.</li></ul>"
  },
  {
    "pk": 6,
    "name": "Single-Leg Romanian Deadlift – Dumbbell",
    "slug": "single-leg-romanian-deadlift-dumbbell",
    "primaryMuscles": ["calf", "glute", "hamstring", "lower back"],
    "secondaryMuscles": ["forearm - inner", "forearm - outer", "trap", "quad"],
    "steps": [
      "Begin by standing on one leg, with a slight bend in the knee. Keep your other leg off the ground and behind you.",
      "Hold a dumbbell or kettlebell in the opposite hand of the leg you are standing on.",
      "Brace your core, keep your chest up, and slowly hinge forward at the hips, keeping your back straight and your shoulders down. As you hinge, lift your non-standing leg behind you, keeping it in line with your torso.",
      "Continue lowering the weight until you feel a stretch in your hamstring. Your standing knee should be slightly bent but not locked.",
      "Pause briefly at the bottom of the movement, then slowly reverse the motion by driving your hips forward and standing up tall while bringing your lifted leg back down to the ground.",
      "Repeat for the desired number of repetitions on one leg before switching to the other."
    ],
    "notes": ""
  },
  {
    "pk": 7,
    "name": "Squat – Bodyweight",
    "slug": "squat-bodyweight",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Stand with your feet shoulder-width apart and point your toes slightly outward.",
      "Keep your chest up, shoulders back, and core engaged.",
      "Lower your body by bending your knees and pushing your hips back as if you were sitting in a chair.",
      "Keep your weight on your heels and your knees behind your toes.",
      "Lower yourself until your thighs are parallel to the ground or as low as you can comfortably go while maintaining good form.",
      "Pause briefly at the bottom of the squat.",
      "Push through your heels to stand back up, driving your hips forward as you do.",
      "Stand up straight and repeat."
    ],
    "notes": ""
  },
  {
    "pk": 8,
    "name": "Face Pull",
    "slug": "face-pull",
    "primaryMuscles": ["rotator cuff - back", "trap", "shoulder - back"],
    "secondaryMuscles": ["shoulder - side", "forearm - outer"],
    "steps": [
      "Start by attaching a single long rope or two shorter ropes to a eye-level pulley on a cable machine.",
      "Grasp the rope or cable with both hands using an overhand grip, with your palms facing each other. You want your thumbs to be able to point backwards, guiding the movement.",
      "Step back a few feet from the cable machine, so there is tension in the rope or cable.",
      "Stand with your feet shoulder-width apart, and engage your core muscles to maintain good posture throughout the exercise. This is your starting position.",
      "Pull the handles towards your face, separating your hands and arms as they go back.",
      "Keep your elbows high and out to the sides as you pull the rope backwards. End the pull with each arm at a 90-degree angle at the elbow.",
      "Hold the position for a second, then slowly lower the rope back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": "Focus on using your back muscles to perform the movement rather than relying on your arms or shoulders."
  },
  {
    "pk": 9,
    "name": "Bench Press – Barbell",
    "slug": "bench-press-barbell",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Lie on a flat bench with your feet firmly planted on the ground.",
      "Grip the barbell with your hands slightly wider than shoulder-width apart, with your palms facing away from your body.",
      "Lift the bar off the rack and hold it directly above your chest with extended arms.",
      "Slowly lower the bar down to your chest, keeping your elbows close to your body.",
      "Pause briefly when the bar touches your chest.",
      "Push the bar back up to the starting position by extending your arms.",
      "Repeat."
    ],
    "notes": "Ensure your back is flat against the bench, and your feet are firmly planted on the ground.  Keep your core tight, and your elbows close to your body throughout the movement. Exhale as you push the bar away from your chest, and inhale as you lower it down."
  },
  {
    "pk": 10,
    "name": "Squat – Dumbbell",
    "slug": "squat-dumbbell",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Stand with your feet shoulder-width apart, with your toes pointing slightly outward.",
      "Hold a dumbbell in each hand by your sides, with your palms facing inward.",
      "Engage your core and keep your chest lifted throughout the movement.",
      "Lower your body by bending at the hips and knees as if sitting on a chair.",
      "Keep your weight in your heels, and make sure your knees are tracking over your toes.",
      "Lower your body until your thighs are parallel to the ground or until you reach your desired depth.",
      "Push through your heels to stand back up to the starting position.",
      "Repeat."
    ],
    "notes": "Keep your knees in line with your toes throughout the movement."
  },
  {
    "pk": 11,
    "name": "Deadlift – Barbell",
    "slug": "deadlift-barbell",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Stand with your feet roughly hip-width apart, with the barbell positioned over the middle of your feet.",
      "Bend at your hips and knees to reach down and grasp the barbell with both hands, slightly wider than shoulder-width apart, palms facing towards your body.",
      "With a flat back, engage your core, flatten your shoulder blades and look ahead to keep your neck in a neutral position.",
      "Stand up with the weight by pushing through your heels, keeping the bar close to your body, and driving your hips forward.",
      "Straighten your legs and hips to come to a full standing position, with the barbell hanging in front of your thighs. Do not lean back at the top.",
      "Pause briefly at the top of the lift while maintaining a tight core, and take a breath if needed.",
      "Lower the barbell back to the ground by hinging at the hips and bending the knees, keeping the bar close to your body and your back straight.",
      "Place the barbell back on the ground and return to the starting position, ready to perform the next repetition."
    ],
    "notes": ""
  },
  {
    "pk": 12,
    "name": "Plank",
    "slug": "plank",
    "primaryMuscles": ["abdominal", "lower back"],
    "secondaryMuscles": ["oblique", "shoulder - front"],
    "steps": [],
    "notes": ""
  },
  {
    "pk": 13,
    "name": "Leg Press – Machine",
    "slug": "leg-press-machine",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": ["hamstring"],
    "steps": [
      "Adjust the seat of the leg press machine so that your knees are at a ~90-degree angle when your feet are on the footplate.",
      "Sit on the machine and place your feet shoulder-width apart on the footplate.",
      "Push the footplate away from your body by extending your legs.",
      "Lower the footplate back towards your body by bending your legs and keeping your feet flat on the plate.",
      "Repeat."
    ],
    "notes": "Keep your back flat against the seat throughout the movement. Keep your feet flat on the footplate, and make sure your knees are tracking in line with your toes. Exhale as you push the footplate away from your body, and inhale as you lower it back down. Avoid locking out your knees at the top of the movement, as this can put unnecessary stress on the joint."
  },
  {
    "pk": 14,
    "name": "One-Handed Cross-Body Curl",
    "slug": "one-handed-cross-body-curl",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Stand up, leaning slightly forward from a straight position, feet shoulder-width apart, and your knees slightly bent.",
      "Hold a dumbbell in each hand, with your palms facing your body and arms fully extended at your sides. This is your starting position.",
      "Keeping your elbows close to your body, slowly curl one dumbbell up toward your opposite shoulder, across your body.",
      "Continue curling until the weight comes close to the activating bicep's shoulder. Squeeze your bicep before slowly lowering the weight to the starting position.",
      "Repeat the curl on the opposite side.",
      "Continue alternating curls on each side for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 15,
    "name": "Frog Pumps",
    "slug": "frog-pumps",
    "primaryMuscles": ["glute"],
    "secondaryMuscles": ["hamstring", "thigh - inner"],
    "steps": [
      "Lie on your back with your knees bent and your feet flat on the ground. Keep your feet close together and your heels touching.",
      "Bring your feet up towards your hips along the ground until they're about 6 inches apart, and then let your knees fall out to the sides so that your feet are touching each other. This is the starting position.",
      "Engage your glutes and lift your hips up towards the ceiling as high as you can, making sure to keep your feet and knees in the same position.",
      "Hold the top position for 1-2 seconds, then slowly lower your hips to the starting position.",
      "Repeat."
    ],
    "notes": "Place a dumbbell or plate on your lower abdomen for extra difficulty."
  },
  {
    "pk": 16,
    "name": "Lying Windshield Wiper",
    "slug": "lying-windshield-wiper",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Lie flat on your back with your arms extended out to the sides, palms down, and your legs extended straight up towards the ceiling.",
      "Keep your feet together and engage your core muscles by drawing your navel towards your spine.",
      "Lower your legs to one side, keeping them straight and close to the floor without touching it.",
      "Pause briefly and then lift your legs back up to the starting position.",
      "Repeat the movement, this time lowering your legs to the opposite side.",
      "Continue alternating sides for the desired number of reps or time."
    ],
    "notes": "Avoid swinging or using momentum to perform the movement; instead, control the action with your core muscles."
  },
  {
    "pk": 17,
    "name": "Dip – Bar",
    "slug": "dip-bar",
    "primaryMuscles": ["chest", "tricep"],
    "secondaryMuscles": ["rotator cuff - front", "shoulder - front"],
    "steps": [
      "Start by approaching a set of parallel bars or dip bars approximately shoulder-width apart. Grab each bar with an overhand grip and hoist yourself up so your arms are fully extended, and your feet are off the ground.",
      "Slightly lean forward and keep your elbows slightly bent to engage your chest, shoulders, and triceps muscles.",
      "Lower your body by bending your elbows and leaning forward while keeping your back straight and your legs behind you. Keep your elbows close to your body throughout the entire exercise.",
      "Continue lowering yourself until your arms are parallel to the ground, or slightly below parallel, while inhaling.",
      "Push back up by straightening your arms while exhaling. Be sure to push with your triceps, chest, and shoulder muscles to return to your starting position.",
      "Repeat."
    ],
    "notes": "You can also add variations to the dip, such as weighted dips or assisted dips, to increase or decrease the intensity of the exercise."
  },
  {
    "pk": 18,
    "name": "Arnold Press",
    "slug": "arnold-press",
    "primaryMuscles": ["shoulder - back", "shoulder - side"],
    "secondaryMuscles": [],
    "steps": [
      "Hold a dumbbell in each hand and sit or stand with your feet shoulder-width apart.",
      "Start with your arms bent so that your palms face your body and the dumbbells are at shoulder height.",
      "As you press the dumbbells overhead, rotate your palms to face forward.",
      "Continue to press the dumbbells overhead until your arms are fully extended.",
      "Lower the dumbbells back down to the starting position, rotating your palms back to face your body as you do so.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 19,
    "name": "Back Extension",
    "slug": "back-extension",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Adjust the back extension bench so that the pads at the thigh are snug against your thighs and your feet are securely held in place by the footpads.",
      "Cross your arms over your chest or hold them behind your head.",
      "Keep your back straight and your neck in a neutral position. Hang your body forward over the thigh pads. This is the starting position.",
      "Engage your lower back muscles and slowly lift your upper body off the bench until it aligns with your legs.",
      "Hold this position for up to a few seconds, squeezing your glutes and lower back muscles at the top of the movement.",
      "Slowly lower your upper body back down to the starting position.",
      "Repeat."
    ],
    "notes": "Hold weights such as plates to your chest to increase the exercise difficulty."
  },
  {
    "pk": 20,
    "name": "One-Legged Glute Bridge",
    "slug": "one-legged-glute-bridge",
    "primaryMuscles": ["glute", "hamstring"],
    "secondaryMuscles": ["thigh - inner"],
    "steps": [
      "Start by lying on your back with your knees bent and feet flat on the ground.",
      "Lift your right leg off the ground and extend it straight up towards the ceiling.",
      "Press your left foot into the ground and lift your hips up towards the ceiling.",
      "Pause at the top of the movement and squeeze your glutes.",
      "Lower your hips back down to the ground and repeat for the desired number of reps.",
      "Switch legs and repeat the exercise on the other side."
    ],
    "notes": "For increased difficult, hold your leg parallel with your torso instead of extending your leg to the ceiling."
  },
  {
    "pk": 21,
    "name": "Curl – Bodyweight",
    "slug": "curl-bodyweight",
    "primaryMuscles": ["bicep", "lat"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Adjust the height of the rings or TRX to waist height and stand facing them.",
      "Hold the rings or TRX handles with an underhand grip and lean back, extending your arms straight in front of you.",
      "Keep your feet shoulder-width apart and your body in a straight line from head to heels.",
      "Engage your biceps and bend your elbows, pulling your body up towards the rings or TRX handles.",
      "As you pull your body up, keep your elbows close to your body and your wrists straight.",
      "When your hands reach your chest, pause for a moment and then slowly lower your body back down to the starting position.",
      "Repeat the exercise for the desired number of reps."
    ],
    "notes": ""
  },
  {
    "pk": 22,
    "name": "Hanging Leg Raise",
    "slug": "hanging-leg-raise",
    "primaryMuscles": ["abdominal", "forearm - inner", "forearm - outer"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Start by securing your grip on a pull-up bar, ensuring your hands are spaced shoulder-width apart.",
      "Allow your body to hang straight down from the bar with your feet together. This is your starting position.",
      "Engage your core and slowly raise your legs in front of you while keeping them straight.",
      "Raise your legs until they are parallel to the ground, or higher if your flexibility and strength allows.",
      "Pause briefly at the top of the movement, keeping your core tight to stabilize your body.",
      "Slowly lower your legs back to the starting position in a controlled manner.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": "There are hanging leg raise machines that allow you to balance on your forearms rather than hang from a bar. Also, you could perform this exercise by holding yourself up on dip bars. Consider using either machine if you want to remove most of the forearm activation and focus on the abdominal work."
  },
  {
    "pk": 24,
    "name": "Burpee – BOSU",
    "slug": "burpee-bosu",
    "primaryMuscles": [
      "chest",
      "glute",
      "quad",
      "shoulder - front",
      "shoulder - side"
    ],
    "secondaryMuscles": ["abdominal", "trap"],
    "steps": [
      "Start in a standing position with the BOSU ball on the ground (inflated-side down) in front of you.",
      "Grip the edges of the BOSU ball and jump your feet back into a plank position.",
      "Perform a push-up while gripping the BOSU ball.",
      "Jump your feet back towards the BOSU ball into a low squat position.",
      "Complete the squat by standing up. As you rise, lift the BOSU ball overhead, extending your arms towards the ceiling.",
      "Repeat the exercise for desired number of reps."
    ],
    "notes": ""
  },
  {
    "pk": 25,
    "name": "Shoulder Press – Machine",
    "slug": "shoulder-press-machine",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side", "tricep"],
    "steps": [
      "Adjust the seat height so that the handles are at shoulder level.",
      "Sit on the machine with your back against the pad and your feet flat on the floor.",
      "Grasp the handles with an overhand grip and push them upward until your arms are fully extended.",
      "Slowly lower the handles back down to shoulder level, keeping your elbows slightly bent.",
      "Repeat for desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 26,
    "name": "Leg Extension",
    "slug": "leg-extension",
    "primaryMuscles": ["quad"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the machine to fit your body and select the appropriate weight.",
      "Sit on the machine with your back against the backrest and your feet or ankle flat against the supporting pad.",
      "Grasp the handles on the side of the machine for stability.",
      "Extend your legs out in front of you until they are parallel to the floor, keeping your feet flexed and your knees slightly bent.",
      "Hold for a moment, then slowly lower the weight back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 27,
    "name": "Close-Grip Feet-Up Bench Press – Barbell",
    "slug": "close-grip-feet-up-bench-press-barbell",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": ["chest", "shoulder - front"],
    "steps": [
      "Lie flat on a bench with your feet up and your back pressed against the bench.",
      "Grasp the barbell with your hands shoulder-width apart or just slightly narrower.",
      "Unrack the barbell and hold it above your chest with your arms extended.",
      "Lower the barbell to your chest, keeping your elbows close to your body.",
      "Pause briefly at the bottom of the movement, then press the barbell back up to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 28,
    "name": "Rear Delt Row – Barbell",
    "slug": "rear-delt-row-barbell",
    "primaryMuscles": ["shoulder - back", "trap"],
    "secondaryMuscles": [
      "forearm - inner",
      "rotator cuff - back",
      "shoulder - side",
      "lat"
    ],
    "steps": [
      "Stand with your feet shoulder-width apart and your knees slightly bent.",
      "Hold a barbell with an overhand grip, hands shoulder-width apart.",
      "Lean forward at the hips, keeping your back straight and your abs engaged.",
      "Bring the barbell up towards your upper chest, keeping your elbows wide and out to the sides.",
      "Squeeze your shoulder blades together at the top of the movement.",
      "Lower the barbell back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 29,
    "name": "Hip Abduction – Machine",
    "slug": "hip-abduction-machine",
    "primaryMuscles": ["thigh - outer"],
    "secondaryMuscles": ["glute"],
    "steps": [
      "Adjust the machine to fit your height and leg length.",
      "Sit on the machine with your back against the backrest and your feet on the footrests.",
      "Press your legs outward against the resistance of the machine.",
      "With your knees at their farthest point, hold the weight for a moment before slowly releasing the resistance and returning to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 30,
    "name": "Cable Curl – Rope",
    "slug": "cable-curl-rope",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Attach a rope to a low pulley cable machine.",
      "Stand facing the machine with feet shoulder-width apart and knees slightly bent.",
      "Grasp the rope with an underhand grip, palms facing each other.",
      "Keep elbows close to your sides and curl the rope towards your shoulders.",
      "Pause briefly at the top of the movement, then slowly lower the rope back to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 31,
    "name": "Plank - BOSU",
    "slug": "plank-bosu",
    "primaryMuscles": ["abdominal", "lower back"],
    "secondaryMuscles": ["oblique", "shoulder - front"],
    "steps": [
      "Place a BOSU ball on the ground with the flat side facing up.",
      "Assume a plank position with your forearms on the BOSU ball and your toes on the ground.",
      "Engage your core and keep your body in a straight line from head to heels.",
      "Hold the position for the desired amount of time.",
      "Release the position by lowering your knees to the ground."
    ],
    "notes": "Instead of placing your forearms on the flat side of the BOSU, you can grab the edges with both hands and plank from a straight-armed position."
  },
  {
    "pk": 32,
    "name": "Glute Kickback – Machine",
    "slug": "glute-kickback-machine",
    "primaryMuscles": ["glute"],
    "secondaryMuscles": ["hamstring", "thigh - inner"],
    "steps": [
      "Adjust the machine to fit your body height",
      "Position yourself in the machine with your hands on the handles and one ankle on the padding.",
      "Keeping your core engaged, exhale and extend your leg back as far as possible while squeezing your glutes.",
      "Inhale and slowly return your leg to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 33,
    "name": "Pause Squat – Barbell",
    "slug": "pause-squat-barbell",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Start with your feet shoulder-width apart, your toes pointing slightly outward, and the barbell on your shoulders.",
      "Lower your body into a squat position, keeping your back straight and your knees tracking with your toes.",
      "Pause at the bottom of the squat for 2-3 seconds.",
      "Slowly rise back up to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 34,
    "name": "Walking Lunge – Barbell",
    "slug": "walking-lunge-barbell",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Start with your feet hip-width apart and the barbell on your shoulders.",
      "Take a large step forward with your right foot, lowering your body until your right thigh is parallel to the ground and your left knee is hovering just above the floor.",
      "Push through your right heel to stand back up, bringing your left foot forward to meet your right foot.",
      "Repeat the lunge on the other side by stepping forward with your left foot.",
      "Continue alternating lunges for the desired number of reps or distance."
    ],
    "notes": ""
  },
  {
    "pk": 35,
    "name": "Rotational Throw – Medicine Ball",
    "slug": "rotational-throw-medicine-ball",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal", "shoulder - front"],
    "steps": [
      "Start by standing about arms-length away from the wall with your feet shoulder-width apart.",
      "Hold a medicine ball with both hands at chest height.",
      "Rotating your core and upper body towards the wall, explosively throw the ball against the wall.",
      "Catch the ball as it rebounds off the wall and rotate your body away from the wall.",
      "Repeat for the desired number of reps and then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 36,
    "name": "Row – T-Bar",
    "slug": "row-t-bar",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "lower back",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Load the desired weight onto the T-Bar machine.",
      "Lie down on the T-Bar machine with your feet securely planted.",
      "Grasp the handles of the T-Bar with an overhand grip.",
      "Pull the T-Bar towards your chest, keeping your elbows close to your body.",
      "Pause briefly at the top of the movement, squeezing your shoulder blades together.",
      "Slowly lower the T-Bar back to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 37,
    "name": "Shoulder Press – Dumbbell",
    "slug": "standing-shoulder-press-dumbbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side", "tricep"],
    "steps": [
      "Start by standing with your feet shoulder-width apart, holding a dumbbell in each hand by your thighs.",
      "Raise the dumbbells to shoulder height, palms facing forward, and elbows bent.",
      "Press the dumbbells upward until your arms are fully extended above your head.",
      "Pause for a moment at the top of the movement, then slowly lower the dumbbells back down to shoulder height.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 38,
    "name": "Upright Row – Barbell",
    "slug": "upright-row-barbell",
    "primaryMuscles": ["shoulder - side"],
    "secondaryMuscles": ["bicep", "shoulder - front", "trap"],
    "steps": [
      "Stand with your feet shoulder-width apart and your knees slightly bent.",
      "Grasp the barbell with an overhand grip, hands narrower than shoulder-width apart.",
      "Hold the barbell in front of your thighs with your arms extended.",
      "Exhale and lift the barbell straight up towards your chin, keeping it close to your body.",
      "Pause for a moment at the top of the movement, then inhale and slowly lower the barbell back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 39,
    "name": "Rear Delt Row – Dumbbell",
    "slug": "rear-delt-row-dumbbell",
    "primaryMuscles": ["shoulder - back", "trap"],
    "secondaryMuscles": [
      "forearm - inner",
      "rotator cuff - back",
      "shoulder - side",
      "lat"
    ],
    "steps": [
      "Stand up straight holding a dumbbell in each hand with an overhand grip, palms facing your thighs.",
      "Hinge forward at the hips with a slight bend in the knees, keeping your back straight and nearly parallel to the floor.",
      "Let the dumbbells hang directly in front of you with your arms fully extended. This is the starting position.",
      "Keep your eyes looking slightly ahead to maintain neck alignment with your spine.",
      "Exhale as you pull the dumbbells towards your upper chest, keeping your elbows flared out. Imagine you are squeezing your shoulder blades together.",
      "Hold the contraction for a second when the dumbbells reach the peak position when your upper arm is just beyond horizontal.",
      "Inhale as you slowly lower the dumbbells back to the starting position in a controlled manner.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 40,
    "name": "Floor Press – Dumbbell",
    "slug": "floor-press-dumbbell",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Lie flat on your back on the floor with your knees bent and feet flat on the ground.",
      "Hold a dumbbell in each hand with your palms facing towards your feet.",
      "Extend your arms straight up towards the ceiling, with your elbows slightly bent.",
      "Slowly lower the dumbbells down towards your chest, keeping your elbows close to your body.",
      "Pause when your upper arms touch the ground.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 41,
    "name": "Incline Curl – Dumbbell",
    "slug": "incline-curl-dumbbell",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Adjust the bench to a 45-degree angle.",
      "Grab a pair of dumbbells and sit on the bench with your back straight.",
      "Let your arms hang down by your sides with your palms facing forward.",
      "Slowly curl the dumbbells up towards your shoulders while keeping your elbows close to your body.",
      "Pause for a moment at the top of the movement, then slowly lower the dumbbells back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 42,
    "name": "Eccentric Heel Drop",
    "slug": "eccentric-heel-drop",
    "primaryMuscles": ["calf"],
    "secondaryMuscles": [],
    "steps": [
      "Stand on a raised platform or step with the balls of your feet on the edge and your heels hanging off.",
      "Raise your heels up as high as possible with both feet.",
      "Shift your weight onto one leg and slowly lower your heel down below the platform, only using the single leg.",
      "Use both feet to push yourself back up to the raised position.",
      "Switch your weight to the other foot and lower yourself down single-legged.",
      "Continue alternating sides for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 43,
    "name": "Squat – Belt",
    "slug": "squat-belt",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Add your desired weight to the machine.",
      "Attach a belt or harness around your waist.",
      "Attach a cable or chain to the belt or harness.",
      "Stand on a platform or box with feet shoulder-width apart.",
      "Hold onto a stable object for balance.",
      "Squat by bending the knees and hips while keeping the back straight.",
      "Pause at the bottom of the squat and then push up through the legs to return to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 44,
    "name": "Hang Power Clean",
    "slug": "hang-power-clean",
    "primaryMuscles": ["glute", "lower back"],
    "secondaryMuscles": [
      "forearm - inner",
      "hamstring",
      "thigh - inner",
      "trap"
    ],
    "steps": [
      "Start with feet shoulder-width apart, toes pointing forward, and grip a weighted barbell with an overhand grip just outside of your legs.",
      "Lower your hips and bend your knees, keeping your back straight and your chest up.",
      "Drive your hips forward and explosively pull the barbell up towards your shoulders, keeping it close to your body.",
      "As the barbell reaches your chest, quickly drop your elbows underneath it and catch it on your shoulders in a front rack position.",
      "Stand up straight, keeping the barbell close to your body, and then lower it back down to the starting position."
    ],
    "notes": ""
  },
  {
    "pk": 45,
    "name": "V-Up",
    "slug": "v-up",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": [],
    "steps": [
      "Start by lying on your back with your arms extended above your head and your legs straight out in front of you.",
      "Engage your core muscles and lift your legs up to a 45-degree angle while simultaneously lifting your upper body off the ground.",
      "Reach your arms forward and try to touch your toes with your fingertips.",
      "Hold the position long enough to flex your abdominal muscles, then slowly lower your body back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 46,
    "name": "Hack Squat – Barbell",
    "slug": "hack-squat-barbell",
    "primaryMuscles": ["quad"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "glute",
      "lower back",
      "thigh - inner",
      "trap"
    ],
    "steps": [
      "Stand in front of the barbell with your feet shoulder-width apart. The barbell will be by the back of your calves.",
      "Bend down and grip the barbell with an overhand grip, with your palms facing behind you.",
      "Stand up straight, lifting the barbell off the ground and holding it behind your legs.",
      "Keeping your back straight, lower your body by bending your knees and hips, as if you were sitting down on a chair, until your thighs are parallel to the ground.",
      "Push through your heels to stand back up to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 47,
    "name": "Straight Arm Lat Pulldown",
    "slug": "straight-arm-lat-pulldown",
    "primaryMuscles": ["lat"],
    "secondaryMuscles": [
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - back"
    ],
    "steps": [
      "Adjust the cable machine to a high position and attach a straight bar to the cable.",
      "Stand facing the machine with your feet shoulder-width apart and your knees slightly bent.",
      "Grasp the bar with both hands using an overhand grip, with your hands slightly wider than shoulder-width apart.",
      "Engage your core and keep your arms straight as you pull the bar down towards your thighs, using your lats to initiate the movement.",
      "Pause for a moment at the bottom of the movement, then slowly release the bar back up to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 48,
    "name": "Lying Internal Shoulder Rotation – Dumbbell",
    "slug": "lying-internal-shoulder-rotation-dumbbell",
    "primaryMuscles": ["rotator cuff - front"],
    "secondaryMuscles": [],
    "steps": [
      "Lie on your side on a flat bench with your legs stacked, and your body straight as possible from head to toes.",
      "Bend your lower arm (the one closest to the bench) at a 90-degree angle at your elbow, and grasp a dumbbell with a your palm facing the ceiling.",
      "Rotate your shoulder while keeping your elbow at a 90-degree angle, moving your forearm towards the ceiling and inwards towards your body.",
      "Rotate your arm upward as far as comfortably possible without lifting your elbow off the bench or your body moving off its position.",
      "Pause at the top of the movement for a brief moment.",
      "Slowly return the dumbbell to the starting position by rotating the forearm back to the bench while keeping the elbow angle constant.",
      "Complete all the desired repetitions on one arm before switching to the other arm and repeating the steps."
    ],
    "notes": "Keep your elbow tucked into your side and pinned to the bench throughout the exercise."
  },
  {
    "pk": 49,
    "name": "Squat – Landmine",
    "slug": "squat-landmine",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Start by placing a barbell into a landmine attachment or securely anchor it into a corner.",
      "Stand facing the barbell with your feet shoulder-width apart and your toes pointing slightly outward.",
      "Grab the end of the barbell with both hands and lift it up to your chest.",
      "Lower your hips down and back, keeping your chest up and your back straight.",
      "Bend your knees and lower your body until your thighs are parallel to the ground.",
      "Push through your heels and stand back up to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 50,
    "name": "Push-Up – Feet in Rings",
    "slug": "push-up-feet-in-rings",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Start in a plank position with your feet in the rings and your hands shoulder-width apart on the ground.",
      "Lower your body towards the ground by bending your elbows and keeping your body straight.",
      "Push yourself back up to the starting position by straightening your arms.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 51,
    "name": "Lateral Walk – Band",
    "slug": "lateral-walk-band",
    "primaryMuscles": ["glute", "thigh - outer"],
    "secondaryMuscles": ["calf", "hamstring", "quad", "thigh - inner"],
    "steps": [
      "Place a resistance band around your ankles and stand with your feet hip-width apart.",
      "Take a step to the right with your right foot, keeping tension on the band.",
      "Bring your left foot to meet your right foot, maintaining tension on the band.",
      "Take another step to the right with your right foot, again keeping tension on the band.",
      "Repeat this lateral movement for a desired number of steps to the right.",
      "Then, reverse the movement and take the same number of steps to the left."
    ],
    "notes": ""
  },
  {
    "pk": 52,
    "name": "Sit-Up",
    "slug": "sit-up",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Start by lying on your back with your legs close together, knees bent, and feet flat on the ground.",
      "Place your hands lightly on the back of your head without interlocking your fingers. Elbows should be out to the sides.",
      "Engage your core muscles, exhale, and lift your upper body off the ground towards your knees. Lift until you're essentially sitting upright.",
      "Inhale as you reverse the movement and lower back down to the ground.",
      "Repeat."
    ],
    "notes": "Do not rest at the top or bottom of the movement. Avoid using momentum or pulling on your neck to lift your upper body. This goes for most exercises, but it's better to do fewer, controlled reps with proper form than to do more reps with poor form."
  },
  {
    "pk": 53,
    "name": "Incline Bench Press – Smith Machine",
    "slug": "incline-bench-press-smith-machine",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Adjust the height of the Smith machine bar to a comfortable level for the incline bench press.",
      "Select the desired weight and load it onto the bar.",
      "Lie down on the incline bench and position yourself under the bar.",
      "Grip the bar with a slightly wider than shoulder-width grip and lift it off the rack.",
      "Lower the bar down to your chest while keeping your elbows tucked in.",
      "Push the bar back up to the starting position, keeping your core engaged and your back flat on the bench.",
      "Repeat.",
      "When finished, carefully rack the bar back onto the Smith machine."
    ],
    "notes": ""
  },
  {
    "pk": 54,
    "name": "Chest Fly – Dumbbell",
    "slug": "chest-fly-dumbbell",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["bicep", "forearm - inner", "shoulder - front"],
    "steps": [
      "Start by lying flat on a bench with your feet firmly on the ground and your head, shoulders, and buttocks touching the bench.",
      "Hold a dumbbell in each hand with your palms facing each other and your arms extended above your chest.",
      "Slowly lower the dumbbells out to the sides of your body, keeping your elbows slightly bent and your palms facing up.",
      "Lower the dumbbells until your arms are parallel to the ground or until you feel a stretch in your chest muscles.",
      "Pause for a moment, then slowly bring the dumbbells back up to the starting position, keeping your elbows slightly bent and your palms facing each other.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 55,
    "name": "Mountain Climbers",
    "slug": "mountain-climbers",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Start in a high plank position with your hands shoulder-width apart and your wrists directly under your shoulders.",
      "Engage your core and bring your right knee towards your chest, keeping your foot off the ground.",
      "Quickly switch legs, bringing your left knee towards your chest while extending your right leg back.",
      "Continue alternating legs at a quick pace, as if you are running in place while in a plank position.",
      "Keep your hips low and your shoulders over your wrists throughout the exercise.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 56,
    "name": "Tricep Pushdown – Cable With Bar",
    "slug": "tricep-pushdown-cable-with-bar",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Attach a straight bar to the high pulley of a cable machine.",
      "Stand facing the machine with your feet shoulder-width apart and your knees slightly bent.",
      "Grasp the bar with an overhand grip, with your hands shoulder-width apart.",
      "Keep your elbows close to your sides and your upper arms stationary.",
      "Exhale and push the bar down until your arms are fully extended.",
      "Pause for a moment, then inhale and slowly return the bar to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 57,
    "name": "Horizontal External Shoulder Rotation – Dumbbell",
    "slug": "horizontal-external-shoulder-rotation-dumbbell",
    "primaryMuscles": ["rotator cuff - back"],
    "secondaryMuscles": [],
    "steps": [
      "Stand perpendicular to a bar set at a height just below shoulder level when standing.",
      "Grip a dumbbell with your working hand, maintaining the 90-degree angle at the elbow.",
      "Place the upper arm of your working side on the bar so that it is parallel to the ground and your elbow is bent at a 90-degree angle. Your forearm with dumbbell should be hanging vertically towards the floor.",
      "Brace your core and keep your shoulder blades down and back to prevent them from rolling forward during the exercise.",
      "Rotate your arm at the shoulder, lifting the dumbbell upwards while keeping your upper arm and elbow firmly in place on the bar.",
      "Continue the rotation until your forearm is horizontal to the floor or as far as your shoulder flexibility allows without discomfort or compromising form.",
      "Pause at the top of the movement, focusing on contracting the muscles around the shoulder.",
      "Slowly reverse the motion, lowering the dumbbell back to the starting position with control to complete one repetition.",
      "Perform the desired number of reps, then switch sides and repeat the exercise with the other arm."
    ],
    "notes": ""
  },
  {
    "pk": 58,
    "name": "Supinated Grip Lat Pulldown",
    "slug": "supinated-grip-lat-pulldown",
    "primaryMuscles": ["lat"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - back"
    ],
    "steps": [
      "Adjust the weight on the lat pulldown machine to a comfortable level.",
      "Stand facing the machine and grasp the bar with an underhand grip, with your hands shoulder-width apart.",
      "Sit down on the bench and adjust the knee pad so that it fits snugly against your thighs.",
      "Lean back slightly and keep your chest up and your shoulders down.",
      "Exhale and pull the bar down towards your chest, keeping your elbows close to your body.",
      "Pause for a moment and squeeze your shoulder blades together.",
      "Inhale and slowly release the bar back to the starting position, keeping your arms straight but not locked.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 59,
    "name": "Wrist Curl Behind the Back – Barbell",
    "slug": "wrist-curl-behind-the-back-barbell",
    "primaryMuscles": ["forearm - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Stand with your feet shoulder-width apart and your knees slightly bent.",
      "Hold a barbell with an overhand grip behind your back, with your palms facing away from your body.",
      "Keep your elbows close to your body and your upper arms stationary.",
      "Curl the barbell up towards your forearms, keeping your wrists straight.",
      "Pause at the top of the movement and squeeze your forearms.",
      "Slowly lower the barbell back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 60,
    "name": "Incline Push-Up",
    "slug": "incline-push-up",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Start in a plank position with your hands on an elevated surface, such as a bench or step.",
      "Place your hands slightly wider than shoulder-width apart and keep your fingers pointing forward.",
      "Engage your core and glutes to maintain a straight line from your head to your heels.",
      "Lower your chest towards the bench, keeping your elbows close to your body.",
      "Pause when your chest is just above the bench.",
      "Push back up to the starting position, fully extending your arms.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 61,
    "name": "High to Low Wood Chop – Cable",
    "slug": "high-to-low-wood-chop-cable",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Attach a cable to a high pulley and select the desired weight.",
      "Stand perpendicular to the cable with feet shoulder-width apart and knees slightly bent.",
      "Grasp the handle with both hands and extend arms overhead, keeping them straight.",
      "Engage core muscles and rotate torso diagonally downwards, pulling the cable down towards the opposite hip.",
      "Bend knees and pivot back foot as needed to maintain balance and stability.",
      "Pause briefly at the bottom of the movement, then reverse the motion and return to starting position.",
      "Repeat for desired number of repetitions, then switch sides and repeat."
    ],
    "notes": ""
  },
  {
    "pk": 62,
    "name": "Deadlift – Dumbbell",
    "slug": "deadlift-dumbbell",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Stand with your feet shoulder-width apart, with a dumbbell in each hand.",
      "Hold the dumbbells about halfway between the front and side of your quads, with your palms facing your body.",
      "Bend your knees, hinge and lean forward at the hips, keeping your back straight and your chest up.",
      "Lower the dumbbells towards the ground, keeping them close to your body.",
      "Pause when your dumbbells are just below your knees.",
      "Push through your heels and stand up, keeping your back straight and your chest up.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 63,
    "name": "Block Snatch",
    "slug": "block-snatch",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf", "forearm - inner", "hamstring", "trap"],
    "steps": [
      "Start with feet shoulder-width apart and toes pointing slightly outward.",
      "Place the barbell on blocks in front of you, with your hands wider than shoulder-width apart and palms facing down.",
      "Lower your hips and bend your knees, keeping your back straight and chest up.",
      "Drive through your legs and hips, explosively extending your knees and hips to lift the barbell off the ground.",
      "As the barbell reaches your mid-thigh, shrug your shoulders and pull the barbell upward, keeping it close to your body.",
      "As the barbell reaches its highest point, drop under the barbell and catch it in a squat position, with your arms fully extended overhead.",
      "Stand up with the barbell extended over your head, maintaining a straight back.",
      "Lower the barbell back to the blocks in a controlled manner."
    ],
    "notes": ""
  },
  {
    "pk": 64,
    "name": "Chest Fly – Machine",
    "slug": "chest-fly-machine",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["bicep", "forearm - inner", "shoulder - front"],
    "steps": [
      "Adjust the seat height and position on the machine to ensure proper alignment with the handles.",
      "Extend your arms out to the sides, keeping a slight bend in your elbows. Grasp the handles and sit with your back flat against the pad.",
      "Inhale and slowly bring your arms together in front of your chest, keeping them slightly bent.",
      "Exhale and slowly return your arms to the starting position, maintaining a slight bend in your elbows.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 65,
    "name": "Chest Press – Cable",
    "slug": "chest-press-cable",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["shoulder - front", "tricep"],
    "steps": [
      "Adjust the cable machine to chest height and attach the handles to the cables.",
      "Stand facing away from the machine and grasp the handles with an overhand grip.",
      "Step forward to create tension in the cables and position your feet shoulder-width apart.",
      "Engage your core and keep your chest up as you push the handles forward until your arms are fully extended.",
      "Hold the position for a moment and then slowly release the handles back to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 66,
    "name": "Kneeling Side Plank",
    "slug": "kneeling-side-plank",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "From a kneeling position on the ground, lean to the right until your right hand or elbow make contact with the ground directly under your right shoulder.",
      "Your body should form a straight line from your left shoulder (pointing towards the ceiling) to your left knee that stacked on top of the right knee.",
      "Hold this position, engaging your core, for the desired time.",
      "Raise back up to a kneeling position and repeat on the other side."
    ],
    "notes": ""
  },
  {
    "pk": 67,
    "name": "Hip Thrust – Band",
    "slug": "hip-thrust-band",
    "primaryMuscles": ["glute"],
    "secondaryMuscles": ["hamstring", "thigh - inner"],
    "steps": [
      "Place a resistance band below your knees.",
      "Sit on the ground with your back against a bench, your feet flat on the ground, and position a barbell across your hips.",
      "Engage your core and glute muscles, and slowly lift your hips up off the ground until your body forms a straight line from your knees to your shoulders.",
      "Hold for a second or two at the top of the movement, then lower your hips back down to the ground.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 68,
    "name": "Row – Dumbbell",
    "slug": "row-dumbbell",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand with a neutral grip (palms facing each other).",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Bring the dumbbells up towards your chest, keeping your elbows close to your body.",
      "Pause at the top of the movement and squeeze your shoulder blades together.",
      "Lower the dumbbells back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 69,
    "name": "Stiff-Legged Deadlift – Barbell",
    "slug": "stiff-legged-deadlift-barbell",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Stand with your feet hip-width apart, holding a barbell in front of your thighs with straight arms using an overhand grip.",
      "Position the bar so it is touching or nearly touching your legs.",
      "Keep your legs straight or maintain a slight bend in the knees (do not lock them).",
      "Brace your core, keep your upper back straight while slightly arching your lower back.",
      "Inhale, then push your hips back and lower the bar towards the ground, hinging at the hips, not the waist.",
      "Keep the bar close to your body to avoid putting undue stress on your lower back.",
      "Lower the barbell as far down as your hamstring flexibility allows. You should feel a stretch in your hamstrings. Do not round your spine.",
      "Exhale as you lift the bar back to the starting position by extending your hips and pushing them forward. Avoid using your back to pull; the motion should come from your hamstrings and glutes.",
      "Squeeze your glutes at the top of the movement for a second before performing the next repetition.",
      "Perform the desired number of repetitions while maintaining proper form, keeping the movement controlled and avoiding any jerky motions."
    ],
    "notes": ""
  },
  {
    "pk": 70,
    "name": "Incline Bench Press – Dumbbell",
    "slug": "incline-bench-press-dumbbell",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Set up an incline bench at a 45-degree angle.",
      "Choose two dumbbells of equal weight and sit on the bench with them resting on your thighs.",
      "Lie back on the bench and bring the dumbbells up to your chest, palms facing forward.",
      "Push the dumbbells up and away from your chest, extending your arms fully but not locking your elbows.",
      "Slowly lower the dumbbells back down to your chest, keeping your elbows at a 45-degree angle to your body.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 71,
    "name": "Calf Raise – Machine",
    "slug": "calf-raise-machine",
    "primaryMuscles": ["calf"],
    "secondaryMuscles": [],
    "steps": [
      "Stand on calf raise machine with the balls of your feet on the edge and your heels hanging off.",
      "Slowly raise your heels as high as possible, keeping your knees straight.",
      "Hold the position, then lower your heels back down below the level of the raised surface.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 72,
    "name": "Squat – Smith Machine",
    "slug": "squat-smith-machine",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Adjust the bar height to your desired position.",
      "Load the bar with an appropriate weight.",
      "Stand facing the bar with your feet shoulder-width apart.",
      "Step forward and position the bar on your shoulders, resting on the back of your neck.",
      "Grasp the bar with both hands, keeping your elbows pointed down and your chest up.",
      "Lower your body by bending at the knees and hips, keeping your back straight and your head up.",
      "Lower until your thighs are parallel to the ground, then push back up to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 73,
    "name": "Power Jerk",
    "slug": "power-jerk",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": [
      "glute",
      "lower back",
      "quad",
      "shoulder - side",
      "thigh - inner",
      "trap",
      "tricep"
    ],
    "steps": [
      "Start with the barbell resting on your front shoulders, with your feet shoulder-width apart.",
      "Bend your knees slightly and dip your hips down.",
      "Quickly extend your legs and hips, driving the barbell upwards.",
      "As the barbell reaches its highest point, quickly drop underneath it, in a small squat.",
      "As you catch the barbell overhead, straighten your legs and stand up.",
      "Lower the barbell back down to your front shoulders to complete the rep.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 74,
    "name": "Preacher Curl – Barbell",
    "slug": "preacher-curl-barbell",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Set up a preacher curl bench with the appropriate weight on the barbell.",
      "Adjust the seat height so that your armpits are resting comfortably on the top of the bench.",
      "Grab the barbell with an underhand grip, hands shoulder-width apart.",
      "Place your upper arms on the bench pad, keeping your elbows close to your body.",
      "Exhale and curl the barbell up towards your shoulders, keeping your upper arms stationary.",
      "Pause briefly at the top of the movement, squeezing your biceps.",
      "Inhale and slowly lower the barbell back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 75,
    "name": "Clean and Jerk",
    "slug": "clean-and-jerk",
    "primaryMuscles": [
      "glute",
      "lower back",
      "quad",
      "shoulder - front",
      "thigh - inner"
    ],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "hamstring",
      "shoulder - side",
      "trap",
      "tricep"
    ],
    "steps": [
      "Start with the barbell on the ground, feet shoulder-width apart and toes pointing forward.",
      "Bend down and grip the bar with hands slightly wider than shoulder-width apart.",
      "Stand up, keeping your back straight and the bar close to your body.",
      "Once the bar reaches your hips, explosively extend your hips, knees, and ankles to propel the bar upward.",
      "As the bar reaches your chest, drop your body underneath it and catch it on your shoulders in a front squat position.",
      "Stand up from the front squat position and prepare for the jerk.",
      "Dip your body slightly and then explosively drive the bar overhead by extending your arms and legs.",
      "Lock out your arms and hold the bar overhead for a moment before lowering it back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 76,
    "name": "Hang Clean",
    "slug": "hang-clean",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf", "forearm - inner", "hamstring", "trap"],
    "steps": [
      "Start with feet shoulder-width apart and grip the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Bend your knees and lower your hips, keeping your back straight and your chest up.",
      "Begin the lift by explosively extending your hips, knees, and ankles, pulling the bar up towards your chest.",
      "As the bar reaches chest height, quickly drop under the bar, rotating your elbows forward and catching the bar on your shoulders in a front squat position.",
      "Stand up with the bar, keeping your elbows high and your chest up.",
      "Lower the bar back down to the starting position by reversing the movement, bending your knees and lowering your hips.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 77,
    "name": "Glute Bridge",
    "slug": "glute-bridge",
    "primaryMuscles": ["glute", "hamstring"],
    "secondaryMuscles": [],
    "steps": [
      "Start by lying on your back with your knees bent and feet flat on the ground.",
      "Place your arms by your sides with your palms facing down.",
      "Engage your core and glutes to lift your hips off the ground until your body forms a straight line from your shoulders to your knees.",
      "Hold the position for a few seconds, squeezing your glutes at the top of the movement.",
      "Lower your hips back down to the ground.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 78,
    "name": "Incline Bench Press – Barbell",
    "slug": "incline-bench-press-barbell",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Set up the incline bench at a 45-degree angle.",
      "Lie down on the bench with your feet flat on the ground.",
      "Grip the barbell with your hands slightly wider than shoulder-width apart.",
      "Unrack the barbell and lower it towards your chest, keeping your elbows tucked in.",
      "Pause briefly at the bottom of the movement, then press the barbell back up to the starting position.",
      "Repeat for desired number of reps.",
      "Rack the barbell once you have completed your set."
    ],
    "notes": ""
  },
  {
    "pk": 79,
    "name": "Lateral Raise – Machine",
    "slug": "lateral-raise-machine",
    "primaryMuscles": ["shoulder - side"],
    "secondaryMuscles": ["shoulder - front"],
    "steps": [
      "Adjust the seat height so that the handles are at shoulder level.",
      "Sit on the machine with your back against the pad and your feet flat on the floor.",
      "Grasp the handles with an overhand grip and keep your elbows slightly bent.",
      "Exhale and raise your arms out to the sides until they are parallel to the floor.",
      "Pause for a moment and then inhale as you slowly lower the handles back to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 80,
    "name": "One-Handed Plate Pinch",
    "slug": "one-handed-plate-pinch",
    "primaryMuscles": ["forearm - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Choose two weight plates of the same size and weight.",
      "Stand facing the plates and place them on the ground.",
      "Bend down and grip the top of each plate with your fingers and thumbs.",
      "Lift the plates off the ground and hold them beside your body with your arms hanging, elbows straight, but not locked.",
      "Squeeze your fingers and thumbs together to maintain a strong grip on the plates.",
      "Hold the plates for a set amount of time. Consider each second one \"repetition\".",
      "Lower the plates back to the ground and release your grip."
    ],
    "notes": ""
  },
  {
    "pk": 81,
    "name": "Hip Thrust – Barbell",
    "slug": "hip-thrust-barbell",
    "primaryMuscles": ["glute"],
    "secondaryMuscles": ["hamstring", "thigh - inner"],
    "steps": [
      "Sit on the ground with your back against a bench, your feet flat on the ground, and position a barbell across your hips.",
      "Engage your core and glute muscles, and slowly lift your hips up off the ground until your body forms a straight line from your knees to your shoulders.",
      "Hold for a second or two at the top of the movement, then lower your hips back down to the ground.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 82,
    "name": "Preacher Curl – Dumbbell",
    "slug": "preacher-curl-dumbbell",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Sit on a preacher bench, placing your upper arms on the padding, holding a dumbbell in each hand with an underhand grip.",
      "Adjust the seat height so your armpits touch the top of the padding and your arm fully extends. This is your starting position.",
      "Curl the dumbbells upwards towards your shoulders, contracting your biceps while keeping your upper arms stationary.",
      "Pause briefly at the top of the movement, squeezing your biceps.",
      "Lower the dumbbells slowly back to the starting position in a controlled manner, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 83,
    "name": "External Shoulder Rotation – Band",
    "slug": "external-shoulder-rotation-band",
    "primaryMuscles": ["rotator cuff - back"],
    "secondaryMuscles": [],
    "steps": [
      "Attach a resistance band to a stable object at waist height.",
      "Stand perpendicular to the anchor point with your right arm farthest away from it, and your feet shoulder-width apart.",
      "Reach across your body with your right hand and grab the band.",
      "Create resistance in the band by bringing your right elbow close to your right side where it hangs naturally.",
      "This starting position has you with your right forearm across the front of your body, at a 90-degree angle to your right upper-arm.",
      "Keep your core engaged and your shoulders relaxed.",
      "Slowly rotate your arms outward, away from your body, until your right hand is in line with your right shoulder.",
      "Pause for a moment, then slowly return to the starting position.",
      "Repeat for the desired number of repetitions and then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 84,
    "name": "Internal Shoulder Rotation – Band",
    "slug": "internal-shoulder-rotation-band",
    "primaryMuscles": ["rotator cuff - front"],
    "secondaryMuscles": [],
    "steps": [
      "Attach a resistance band to a stable object at waist height.",
      "Stand perpendicular to the anchor point with your right arm closest to it, and your feet shoulder-width apart.",
      "Reach your right hand and grab the band.",
      "Create resistance in the band by side-stepping away from the anchor point.",
      "This starting position has your right forearm at a 90-degree angle to your right upper-arm. Your right forearm points to your right.",
      "Keep your core engaged and your shoulders relaxed.",
      "Slowly rotate your arms inward, toward your body, until your right hand is in line with your right shoulder.",
      "Pause for a moment, then slowly return to the starting position.",
      "Repeat for the desired number of repetitions and then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 85,
    "name": "Good Morning",
    "slug": "good-morning",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": ["thigh - inner"],
    "steps": [
      "Start by standing with your feet shoulder-width apart and your toes pointing forward.",
      "Place your hands behind your head, or on a weighted barbell on your shoulders, with your elbows pointing out to the sides.",
      "Keeping your back straight and your core engaged, hinge forward at your hips, pushing your butt back as far as possible.",
      "Lower your torso until it is nearly parallel to the ground, or until you feel a stretch in your hamstrings.",
      "Pause for a moment, then slowly return to the starting position by squeezing your glutes and pushing your hips forward.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 86,
    "name": "Chin-Up",
    "slug": "chin-up",
    "primaryMuscles": ["lat"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - back"
    ],
    "steps": [
      "Stand underneath a chin-up bar with your feet shoulder-width apart.",
      "Reach up and grasp the bar with an underhand grip, with your palms facing towards you and your hands shoulder-width apart.",
      "Hang from the bar with your arms fully extended and your shoulders relaxed.",
      "Engage your back muscles and pull your body up towards the bar, keeping your elbows close to your body.",
      "Continue pulling until your chin is above the bar.",
      "Pause briefly at the top of the movement, then slowly lower yourself back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 87,
    "name": "Wrist Extension – Barbell",
    "slug": "wrist-extension-barbell",
    "primaryMuscles": ["forearm - outer"],
    "secondaryMuscles": [],
    "steps": [
      "Hold a barbell with an overhand grip, with your hands shoulder-width apart.",
      "Sit on a bench with your feet shoulder-width apart.",
      "Rest the barbell on the top of your thighs, with your palms facing down.",
      "Slowly lift the barbell by extending your wrists, keeping your elbows stationary. Focus on bringing your knuckles back towards the top of your forearms.",
      "Hold the barbell at the top of the movement for a moment.",
      "Lower the barbell back down to the starting position by flexing your wrists.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 88,
    "name": "Rack Pull",
    "slug": "rack-pull",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Set up a barbell in a power rack at shin height or just below your knees.",
      "Stand with your feet shoulder-width apart and your shins touching the bar.",
      "Grasp the bar with an overhand grip, slightly wider than shoulder-width apart.",
      "Engage your core and lift the bar by extending your hips and knees.",
      "Keep your back straight and your shoulders pulled back throughout the movement.",
      "Lower the bar back down to the starting position by bending your hips and knees.",
      "Repeat."
    ],
    "notes": "With its elevated starting point, the Rack Pull is an easier version of the Deadlift."
  },
  {
    "pk": 89,
    "name": "Front Raise – Dumbbell",
    "slug": "front-raise-dumbbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side"],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing your thighs.",
      "Keeping your arms straight, lift the dumbbells in front of you until they reach shoulder height.",
      "Hold the position for a second, then slowly lower the dumbbells back down to your thighs.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 90,
    "name": "Standing Glute Kickback – Machine",
    "slug": "standing-glute-kickback-machine",
    "primaryMuscles": ["glute"],
    "secondaryMuscles": ["hamstring", "thigh - inner"],
    "steps": [
      "Adjust the machine to the appropriate height for your body.",
      "Stand facing the machine with your feet shoulder-width apart and your hands holding onto the handles.",
      "Engage your glutes and lift one leg straight back behind you, keeping it in line with your body.",
      "Pause at the top of the movement and squeeze your glutes.",
      "Lower your leg back down to the starting position and repeat on the other side.",
      "Complete the desired number of repetitions on each leg."
    ],
    "notes": ""
  },
  {
    "pk": 91,
    "name": "Hang Snatch",
    "slug": "hang-snatch",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf", "forearm - inner", "hamstring", "trap"],
    "steps": [
      "Start standing up with the barbell in an overhand grip, hands slightly wider than shoulder-width apart, resting against your thighs.",
      "Quickly drop down into a quarter squat, then explosively extend your hips, knees, and ankles to jump upwards.",
      "As you jump, pull the bar upwards with your arms, keeping it close to your body and using your momentum to bring it up to shoulder height.",
      "Rotate your elbows around and under the bar, catching it in an overhead squat position with your arms fully extended and your feet shoulder-width apart.",
      "Stand up to complete the lift",
      "Lower the bar back down to the ground with control.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 92,
    "name": "Kneeling Ab Wheel Roll-Out",
    "slug": "kneeling-ab-wheel-roll-out",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Kneel on the floor with an ab wheel in front of you.",
      "Place your hands on the ab wheel handles, shoulder-width apart.",
      "Engage your core and slowly roll the ab wheel forward, keeping your arms straight and your back flat.",
      "Continue rolling out until your body is fully extended and your arms are overhead.",
      "Pause for a moment, then slowly roll the ab wheel back towards your knees.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 93,
    "name": "Pull-Apart – Band",
    "slug": "pull-apart-band",
    "primaryMuscles": ["rotator cuff - back", "shoulder - back"],
    "secondaryMuscles": ["rotator cuff - front"],
    "steps": [
      "Stand with feet shoulder-width apart and hold a resistance band with both hands.",
      "Extend your arms straight out in front of you, keeping your palms facing down.",
      "Begin pulling the band apart by squeezing your shoulder blades together.",
      "Continue pulling until your hands are at shoulder height and the band is stretched tight.",
      "Hold for a moment, then slowly release the tension and return to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 95,
    "name": "Monkey Row",
    "slug": "monkey-row",
    "primaryMuscles": ["shoulder - side"],
    "secondaryMuscles": ["bicep", "shoulder - front", "trap"],
    "steps": [
      "Start in a standing position with your feet shoulder-width apart and your knees slightly bent.",
      "Hold a dumbbell in each hand with your palms facing each other and your arms extended by your sides.",
      "Bend your elbows and pull the dumbbells up towards your armpits, keeping your elbows close to your body.",
      "Pause at the top of the movement and squeeze your shoulder blades together.",
      "Lower the dumbbells back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 96,
    "name": "Decline Bench Press – Dumbbell",
    "slug": "decline-bench-press-dumbbell",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Set up a decline bench at a 45-degree angle.",
      "Grab a pair of dumbbells and lie down on the bench with your feet secured at the end.",
      "Hold the dumbbells at chest level with your palms facing forward.",
      "Lower the dumbbells slowly towards your chest, keeping your elbows at a 45-degree angle.",
      "Pause for a moment, then push the dumbbells back up to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 97,
    "name": "Pullover – Barbell",
    "slug": "pullover-barbell",
    "primaryMuscles": ["chest", "lat", "tricep"],
    "secondaryMuscles": ["rotator cuff - back", "rotator cuff - front"],
    "steps": [
      "Lie on a bench with your head and shoulders supported, and your feet flat on the floor.",
      "Hold a barbell with a pronated grip (palms facing forward) slightly wider than shoulder-width, and press it up to arm's length over your chest. This is your starting position.",
      "Keep a slight bend in your elbows and lock your arms in this slightly bent position throughout the entire movement.",
      "Inhale and slowly lower the barbell in an arc behind your head while keeping your arms straight, moving primarily at the shoulder joints.",
      "Lower the barbell until your arms are parallel to the floor or until you feel a stretch in your chest or lats, whichever comes first.",
      "Exhale as you reverse the motion, bringing the barbell back over your chest in the same arc motion.",
      "Repeat for the desired number of reps."
    ],
    "notes": ""
  },
  {
    "pk": 98,
    "name": "One-Legged Hip Thrust",
    "slug": "one-legged-hip-thrust",
    "primaryMuscles": ["glute"],
    "secondaryMuscles": ["hamstring", "thigh - inner"],
    "steps": [
      "Begin by lying on your back with your knees bent and feet flat on the ground.",
      "Extend one leg straight out, keeping it in line with your hip.",
      "Place your hands on the ground by your sides for support.",
      "Engage your glutes and lift your hips up towards the ceiling, keeping your extended leg straight.",
      "Pause at the top of the movement, then slowly lower your hips back down to the ground.",
      "Repeat for the desired number of reps, then switch legs."
    ],
    "notes": "Consider variations of this exercises where your back is on a bench and your feet are still on the floor, or adding weight to your hips."
  },
  {
    "pk": 99,
    "name": "Reverse Fly – Dumbbell",
    "slug": "reverse-fly-dumbbell",
    "primaryMuscles": ["rotator cuff - back", "shoulder - back"],
    "secondaryMuscles": ["trap"],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing each other.",
      "Bend forward at your hips, keeping your back straight and your core engaged.",
      "Extend your arms straight down towards the floor, with your elbows slightly bent.",
      "Keeping your arms straight, lift the dumbbells out to the sides until they reach shoulder height.",
      "Pause for a moment, then slowly lower the dumbbells back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 100,
    "name": "Curl – Dumbbell",
    "slug": "curl-dumbbell",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Stand up straight with your feet shoulder-width apart and your arms at your sides, holding a dumbbell in each hand.",
      "Keeping your elbows close to your sides, slowly lift the dumbbells up towards your shoulders, rotating your palms to face your shoulders as you lift.",
      "Pause for a moment at the top of the movement, squeezing your biceps.",
      "Slowly lower the dumbbells back down to the starting position, rotating your palms back to face your thighs as you lower.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 101,
    "name": "Torso Rotation Machine",
    "slug": "torso-rotation-machine",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the seat and chest pad of the machine.",
      "Kneel on the knee pad with your chest against the chest pad.",
      "Grasp the handles with both hands and keep your elbows bent.",
      "Rotate your torso to the left as far as you comfortably can, while keeping your hips and legs stationary.",
      "Pause briefly at the end of the range of motion, then rotate your torso back to the starting position.",
      "Repeat the rotation to the right side, and continue alternating sides for the desired number of repetitions or time."
    ],
    "notes": ""
  },
  {
    "pk": 102,
    "name": "Seated Row – Machine",
    "slug": "seated-row-machine",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Adjust the seat height so that the handles are at chest level.",
      "Sit on the machine with your feet flat on the footrests and your knees slightly bent.",
      "Grasp the handles with an overhand grip and keep your back straight.",
      "Pull the handles towards your chest while keeping your elbows close to your body.",
      "Pause for a moment and then slowly release the handles back to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 103,
    "name": "Pullover – Dumbbell",
    "slug": "pullover-dumbbell",
    "primaryMuscles": ["chest", "lat", "tricep"],
    "secondaryMuscles": ["rotator cuff - back", "rotator cuff - front"],
    "steps": [
      "Lie on a bench with your head and shoulders supported, and your feet flat on the floor.",
      "Hold a dumbbell with both hands, palms pressing against the underside of one of the sides of the dumbbell. Push the dumbbell towards the sky above your chest. This is your starting position.",
      "Keep a slight bend in your elbows and lock your arms in this slightly bent position throughout the entire movement.",
      "Inhale and slowly lower the dumbbell in an arc behind your head while keeping your arms straight, moving primarily at the shoulder joints.",
      "Lower the dumbbell until your arms are parallel to the floor or until you feel a stretch in your chest or lats, whichever comes first.",
      "Exhale as you reverse the motion, bringing the dumbbell back over your chest in the same arc motion.",
      "Repeat for the desired number of reps."
    ],
    "notes": ""
  },
  {
    "pk": 104,
    "name": "Farmers Walk",
    "slug": "farmers-walk",
    "primaryMuscles": ["forearm - inner", "glute", "oblique", "trap"],
    "secondaryMuscles": [
      "abdominal",
      "calf",
      "lower back",
      "quad",
      "shoulder - side"
    ],
    "steps": [
      "Stand with your feet shoulder-width apart and your core engaged.",
      "Pick up a heavy weight in each hand, such as dumbbells or kettlebells.",
      "Keep your shoulders down and your chest up as you walk forward, taking small, quick steps.",
      "Make sure to keep your back straight and avoid leaning forward or backward.",
      "Continue walking for a set distance or time, then carefully set the weights down."
    ],
    "notes": ""
  },
  {
    "pk": 105,
    "name": "Lunge – Bodyweight",
    "slug": "lunge-bodyweight",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Stand with your feet shoulder-width apart and your hands on your hips.",
      "Step forward with one leg, bending your knee until your thigh is parallel to the ground.",
      "Keep your back straight and your core engaged.",
      "Push through your front heel to return to the starting position.",
      "Repeat with the other leg."
    ],
    "notes": ""
  },
  {
    "pk": 106,
    "name": "Curl – Barbell",
    "slug": "curl-barbell",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Stand with your feet shoulder-width apart and your knees slightly bent.",
      "Hold the barbell with an underhand grip, palms facing up, and your hands shoulder-width apart.",
      "Keep your elbows close to your sides and curl the barbell up towards your chest, exhaling as you lift.",
      "Pause at the top of the movement and squeeze your biceps.",
      "Lower the barbell back down to the starting position, inhaling as you lower.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 107,
    "name": "Dip – Bench",
    "slug": "dip-bench",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": ["chest", "rotator cuff - front", "shoulder - front"],
    "steps": [
      "Find a stable bench or chair and sit on the edge with your hands next to your hips, fingers pointing forward.",
      "Slide your feet forward and lower your hips off the bench. Straighten or bend your knees to make the exercise more or less difficult.",
      "Lower your body by bending your elbows until your upper arms are parallel to the ground.",
      "Push yourself back up to the starting position by straightening your arms.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 108,
    "name": "Horizontal Internal Shoulder Rotation – Dumbbell",
    "slug": "horizontal-internal-shoulder-rotation-dumbbell",
    "primaryMuscles": ["rotator cuff - front"],
    "secondaryMuscles": [],
    "steps": [
      "Lie on your back on a flat surface with a dumbbell nearby.",
      "Raise one arm at the shoulder joint to your side so that your upper arm is perpendicular to your body. Bend your elbow at a 90-degree angle bringing your forearm perpendicular to the upper arm so that your hand is above your head on your supporting surface. This position is commonly known as as a single-arm \"cactus pose\".",
      "Hold a dumbbell in your hand with your palm facing up towards the ceiling.",
      "Slowly rotate your arm up towards the ceiling until it's perpendicular to the ground, keeping your elbow bent and your upper arm stationary.",
      "Pause for a moment at the top of the movement, then slowly lower the dumbbell back to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides and repeat the exercise with your other arm."
    ],
    "notes": ""
  },
  {
    "pk": 109,
    "name": "Bar Hang",
    "slug": "bar-hang",
    "primaryMuscles": ["forearm - inner", "forearm - outer"],
    "secondaryMuscles": [],
    "steps": [
      "Find a sturdy horizontal bar that can support your body weight.",
      "Stand facing the bar and reach up to grab it with both hands, palms facing away from your body.",
      "Jump or step up to lift your feet off the ground and hang from the bar with your arms fully extended.",
      "Engage your shoulder blades and core muscles to maintain a stable position.",
      "Hold the position for a desired amount of time.",
      "To release, slowly lower your body down and step or jump off the bar."
    ],
    "notes": ""
  },
  {
    "pk": 110,
    "name": "Rear Delt Row – Cable",
    "slug": "rear-delt-row-cable",
    "primaryMuscles": ["shoulder - back", "trap"],
    "secondaryMuscles": [
      "forearm - inner",
      "rotator cuff - back",
      "shoulder - side",
      "lat"
    ],
    "steps": [
      "Attach a straight bar to a cable machine, preferably with a bench and foot rests.",
      "Sit facing the cable machine with your feet shoulder-width apart and your knees slightly bent.",
      "Grasp the bar with an overhand grip, with your hands slightly more than shoulder-width apart.",
      "Lean forward slightly, keeping your back straight and your core engaged.",
      "Pull the bar towards your upper chest, keeping your elbows wide and out to the sides.",
      "Squeeze your shoulder blades together at the top of the movement.",
      "Slowly release the bar back to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 111,
    "name": "Goblet Squat",
    "slug": "goblet-squat",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf", "lower back"],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a dumbbell or kettlebell vertically against your chest with both hands, elbows pointing down.",
      "Brace your core and lower your body as far as you can by pushing your hips back and bending your knees.",
      "Pause, then push yourself back up to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 112,
    "name": "Seated Shoulder Press – Dumbbell",
    "slug": "seated-shoulder-press-dumbbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side", "tricep"],
    "steps": [
      "Start by sitting on a bench with a backrest, holding a dumbbell in each hand at shoulder level.",
      "Ensure that your feet are firmly planted on the ground and your back is straight.",
      "Press the dumbbells up above your head, extending your arms fully.",
      "Pause briefly at the top of the movement, then slowly lower the dumbbells back down to shoulder level.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 113,
    "name": "Deadlift – Trap Bar High Handles",
    "slug": "deadlift-trap-bar-high-handles",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Stand in the center of a loaded trap bar with your feet about hip-width apart.",
      "Bend at your hips and knees to lower your body, maintaining a flat back, to grasp the high handles of the trap bar.",
      "Look forward, keeping your chest up, and straighten your back to prepare for the lift.",
      "Drive through your heels to stand up straight, extending your hips and knees simultaneously while keeping the core engaged.",
      "At the top of the movement, stand fully upright with your shoulders back.",
      "Pause briefly at the top of the lift before initiating the return.",
      "Lower the bar by bending at the hips first, then the knees, maintaining a flat back and controlled movement until the weights are back on the ground.",
      "Reset your posture and prepare for the next repetition."
    ],
    "notes": ""
  },
  {
    "pk": 114,
    "name": "Shallow Lunge – Bodyweight",
    "slug": "shallow-lunge-bodyweight",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": ["hamstring"],
    "steps": [
      "Stand with your feet shoulder-width apart and your hands on your hips.",
      "Step forward with one leg, bending your knee until your thigh is parallel to the ground.",
      "Keep your back straight and your core engaged.",
      "Push through your front heel to return to the starting position.",
      "Repeat with the other leg."
    ],
    "notes": "Remember to keep the lunge shallow. Your back knee should stay several inches above the ground. This exercise is an easier version of the Body Weight Lunge."
  },
  {
    "pk": 115,
    "name": "Sumo Deadlift – Barbell",
    "slug": "sumo-deadlift-barbell",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Stand with feet wider than shoulder-width apart and toes pointed outwards.",
      "Place hands on the barbell with a grip wider than shoulder-width apart and palms facing down.",
      "Engage core and lift the barbell off the ground, keeping back straight and knees bent.",
      "As you lift, push hips forward and straighten legs.",
      "Lower the barbell back down to the ground, keeping back straight and knees bent."
    ],
    "notes": ""
  },
  {
    "pk": 116,
    "name": "Twist – Cable",
    "slug": "twist-cable",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Stand with your left foot in front of your right, knees slightly bent, facing away from the cable machine.",
      "Rotate and reach to your right, behind you, and grab the cable handle with both hands. Your left arm should be straight across your body and behind you.",
      "Rotate your torso left until you're facing forward, pulling the cable across your body.",
      "Pause briefly at the end of the movement, then slowly rotate back to the starting position.",
      "Repeat for the desired number of reps and then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 117,
    "name": "Seated Leg Curl",
    "slug": "seated-leg-curl",
    "primaryMuscles": ["hamstring"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the machine to fit your body size and leg length.",
      "Sit on the machine with your back against the backrest and your legs straight out in front of you.",
      "Place your ankles over the padded bar and grasp the handles on the sides of the seat for support.",
      "Bend your knees and curl your legs towards your buttocks, keeping your back straight and your feet flexed.",
      "Pause briefly at the bottom of the movement, then slowly straighten your legs back to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 118,
    "name": "Hanging Knee Raise",
    "slug": "hanging-knee-raise",
    "primaryMuscles": ["abdominal", "forearm - inner", "forearm - outer"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Hang from a pull-up bar with both hands using an overhand grip.",
      "Keep your arms and legs straight with feet off the ground.",
      "Stabilize your torso by engaging your core and slightly retracting your shoulders.",
      "While exhaling, slowly raise your knees toward your chest. Imagine bringing your knees to your nipples.",
      "Pause momentarily when your thighs reach your chest.",
      "Inhale as you lower your legs back down, slowly and controlled, to the starting position."
    ],
    "notes": "There are hanging knee raise machines that allow you to balance on your forearms rather than hang from a bar. Also, you could perform this exercise by holding yourself up on dip bars. Consider using either machine if you want to remove most of the forearm activation and focus on the abdominal work."
  },
  {
    "pk": 119,
    "name": "Push Press – Dumbbell",
    "slug": "push-press-dumbbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": [
      "abdominal",
      "glute",
      "lat",
      "lower back",
      "quad",
      "trap",
      "tricep"
    ],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand at shoulder level with your palms facing your head.",
      "Bend your knees slightly and dip your body down.",
      "Quickly straighten your legs and use the momentum to push the dumbbells overhead.",
      "Lock out your arms at the top of the movement.",
      "Lower the dumbbells back down to shoulder level and repeat for desired number of reps."
    ],
    "notes": ""
  },
  {
    "pk": 120,
    "name": "Push Press – Barbell",
    "slug": "push-press-barbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": [
      "glute",
      "lower back",
      "quad",
      "shoulder - side",
      "trap",
      "tricep"
    ],
    "steps": [
      "Start with the barbell resting on your front shoulders, with your feet shoulder-width apart.",
      "Bend your knees slightly and dip your hips down, then explosively extend your legs and push the barbell up overhead.",
      "As the barbell reaches the top of the movement, press it up and lock out your arms.",
      "Lower the barbell back down to your shoulders and repeat for the desired number of reps."
    ],
    "notes": ""
  },
  {
    "pk": 121,
    "name": "Overhead Tricep Extension – Bodyweight",
    "slug": "overhead-tricep-extension-bodyweight",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Set a stationary bar (ex. Smith Machine) at hip height",
      "Stand with your feet shoulder-width, lean forward, and grab the bar with your arms in front of you.",
      "Bend your elbows and lower your head forward and below the bar. Keep your elbows close to your ears.",
      "Squeeze your triceps to extend your arms to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 122,
    "name": "Horizontal Wood Chop – Band",
    "slug": "horizontal-wood-chop-band",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Attach a resistance band to a sturdy anchor point at waist height.",
      "Stand perpendicular to the anchor point with feet shoulder-width apart and knees slightly bent.",
      "Hold the resistance band with both hands and extend arms out in front of the body.",
      "Rotate the torso and pull the band across the body towards the opposite hip.",
      "Keep the arms straight and engage the core muscles throughout the movement.",
      "Slowly return to the starting position",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 123,
    "name": "Kneeling Push-Up",
    "slug": "kneeling-push-up",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Start on your hands and knees, with your hands shoulder-width apart and your knees hip-width apart.",
      "Extend your legs behind you, so that your body forms a straight line from your head to your heels.",
      "Engage your core and glutes to keep your body in a straight line.",
      "Lower your body towards the ground by bending your elbows, keeping them close to your body.",
      "Pause when your chest is just above the ground.",
      "Push yourself back up to the starting position by straightening your arms.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 124,
    "name": "Side Kicks – Band",
    "slug": "side-kicks-band",
    "primaryMuscles": ["thigh - outer"],
    "secondaryMuscles": ["glute"],
    "steps": [
      "Stand with your feet hip-width apart and a resistance band around your ankles.",
      "Engage your core and lift one leg out to the side, keeping it straight and the foot flexed.",
      "Pause at the top of the movement, then slowly lower the leg back down to the starting position.",
      "Repeat for the desired number of reps, then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 125,
    "name": "Lateral Raise – Dumbbell",
    "slug": "lateral-raise-dumbbell",
    "primaryMuscles": ["shoulder - side"],
    "secondaryMuscles": ["shoulder - front"],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing inward.",
      "Keep your arms straight and lift them out to the sides until they are parallel to the floor.",
      "Pause for a moment, then slowly lower the dumbbells back down to your sides.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 126,
    "name": "Front Raise – Barbell",
    "slug": "front-raise-barbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side"],
    "steps": [
      "Stand with your feet shoulder-width apart and your knees slightly bent.",
      "Hold a barbell with an overhand grip, hands shoulder-width apart, and the bar resting on your thighs.",
      "Keeping your arms straight, lift the barbell up in front of you until it reaches shoulder height.",
      "Pause for a moment, then slowly lower the barbell back down to your thighs.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 127,
    "name": "One-Handed Row – Dumbbell",
    "slug": "one-handed-row-dumbbell",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Stand with your feet shoulder-width apart and your knees slightly bent.",
      "Hold a dumbbell in one hand with your palm facing your body.",
      "Bend forward at the waist, keeping your back straight and your abs engaged.",
      "Let the dumbbell hang straight down towards the floor.",
      "Exhale and pull the dumbbell up towards your chest, keeping your elbow close to your body.",
      "Squeeze your shoulder blades together at the top of the movement.",
      "Inhale and slowly lower the dumbbell back down towards the floor.",
      "Repeat for the desired number of reps, then switch sides and repeat."
    ],
    "notes": "Brace yourself against a bench with your free hand to take some of the effort off your lower back."
  },
  {
    "pk": 128,
    "name": "Roll-Up",
    "slug": "roll-up",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": [],
    "steps": [
      "Lie on your back with your arms extended overhead and your legs straight.",
      "Engage your core and slowly lift your head, neck, and shoulders off the ground.",
      "Continue to roll up, reaching your arms towards your toes and keeping your legs straight.",
      "Pause at the top of the movement, then slowly roll back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 129,
    "name": "Inverted Row",
    "slug": "inverted-row",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "forearm - outer",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Set up a bar in a rack or Smith machine to about waist height. Ensure it is secure.",
      "Lie on the ground underneath the bar which should be set just above where you can reach from the ground.",
      "Grab the bar with a wide overhand grip.",
      "Extend your legs out in front of you, resting your heels on the ground with legs straight.",
      "Straighten your body and tighten your core so your body is in a straight line from head to heels. This is your starting position.",
      "Keep your elbows at a neutral angle, roughly 45 degrees away from your body, and pull your chest towards the bar while squeezing your shoulder blades together.",
      "Pause briefly with your chest close to the bar.",
      "Lower yourself slowly and controlled back to the starting position."
    ],
    "notes": "Raise the bar higher to increase the angle of your body to the ground and make the exercise easier."
  },
  {
    "pk": 130,
    "name": "Crunch",
    "slug": "crunch",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Start by lying flat on your back with your knees bent and feet flat on the ground.",
      "Place your hands behind your head, with your elbows pointing outwards.",
      "Engage your core muscles by pulling your belly button towards your spine.",
      "Lift your head, neck, and shoulders off the ground, while keeping your lower back pressed into the floor.",
      "Hold the contraction for a moment, then slowly lower yourself back down to the starting position.",
      "Repeat."
    ],
    "notes": "For additional intensity, hold a weight during the crunch. You have two options. One, you can place the weight on your upper chest. Two, you can hold the weight directly above your chest with straight arms except for a slight bend in your elbows."
  },
  {
    "pk": 131,
    "name": "One-Handed Overhead Tricep Extension – Dumbbell",
    "slug": "one-handed-overhead-tricep-extension-dumbbell",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a dumbbell in one hand.",
      "Extend your arm straight up, holding the dumbbell above your head.",
      "Bend your elbow and lower the dumbbell behind your head, keeping your upper arm stationary.",
      "Pause for a moment, then extend your arm back up to the starting position.",
      "Repeat for the desired number of reps, then switch to the other arm."
    ],
    "notes": ""
  },
  {
    "pk": 132,
    "name": "Close-Grip Push-Up",
    "slug": "close-grip-push-up",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Start in a plank position with your hands under your shoulders, or just slightly narrower, and your fingers pointing forward.",
      "Lower your body towards the ground, keeping your elbows close to your sides.",
      "Push back up to the starting position, keeping your core engaged and your body in a straight line.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 133,
    "name": "Behind the Neck Press – Barbell",
    "slug": "behind-the-neck-press-barbell",
    "primaryMuscles": ["shoulder - front", "shoulder - side"],
    "secondaryMuscles": ["trap", "tricep"],
    "steps": [
      "Start by standing at a barbell rack with your feet shoulder-width apart and your knees slightly bent.",
      "Grasp the barbell with a wide grip, with your palms facing forward and your hands slightly wider than your shoulders.",
      "Lift the barbell up and bring it behind your head, resting it on your upper traps.",
      "Press the barbell up towards the ceiling, keeping your elbows pointed out to the sides.",
      "Lower the barbell back down to the starting position behind your head.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 134,
    "name": "Power Clean",
    "slug": "power-clean",
    "primaryMuscles": ["glute", "lower back"],
    "secondaryMuscles": [
      "forearm - inner",
      "hamstring",
      "quad",
      "thigh - inner",
      "trap"
    ],
    "steps": [
      "Start with feet shoulder-width apart and grip the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Lower your hips and bend your knees, keeping your back straight and your chest up.",
      "Explosively extend your hips and knees, pulling the barbell up towards your shoulders.",
      "As the barbell reaches your chest, drop your elbows and rotate your wrists, catching the barbell on your shoulders in a front squat position.",
      "Stand up with the barbell, keeping your core tight and your chest up.",
      "Lower the barbell back down to the starting position, either by dropping it or by reversing the movement.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 135,
    "name": "Deficit Deadlift",
    "slug": "deficit-deadlift",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Stand with your feet roughly hip-width apart on a step or plate that raises your body 2-4 inches (5-10 cm) off the ground.",
      "Position a loaded barbell over the middle of your feet.",
      "Bend at your hips and knees to reach down and grasp the barbell with both hands, slightly wider than shoulder-width apart, palms facing towards your body.",
      "With a flat back, engage your core, flatten your shoulder blades and look ahead to keep your neck in a neutral position.",
      "Stand up with the weight by pushing through your heels, keeping the bar close to your body, and driving your hips forward.",
      "Straighten your legs and hips to come to a full standing position, with the barbell hanging in front of your thighs. Do not lean back at the top.",
      "Pause briefly at the top of the lift while maintaining a tight core, and take a breath if needed.",
      "Lower the barbell back to the ground by hinging at the hips and bending the knees, keeping the bar close to your body and your back straight.",
      "Place the barbell back on the ground and return to the starting position, ready to perform the next repetition."
    ],
    "notes": "The barbell travels extra distance since you've raised your body off the ground. With that extra stretch reaching for the barbell, this exercise is more difficult than a standard Deadlift."
  },
  {
    "pk": 136,
    "name": "Wrist Curl – Barbell",
    "slug": "wrist-curl-barbell",
    "primaryMuscles": ["forearm - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Start by sitting on a bench with your forearms resting on your knees and your palms facing up.",
      "Hold a barbell with an underhand grip, with your hands shoulder-width apart.",
      "Slowly lift the barbell towards your forearms by curling your wrists.",
      "Pause for a moment at the top of the movement, then slowly lower the barbell back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 137,
    "name": "Crunch – Cable",
    "slug": "crunch-cable",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Attach a rope handle to a high pulley cable machine.",
      "Adjust the weight to a comfortable level.",
      "Kneel on a mat facing the machine and grab the rope handle with both hands.",
      "Position yourself so that your hands hold the rope by each ear and the cable is behind your neck, above you.",
      "Engage your core and pull the rope towards your knees.",
      "Hold the contraction for a few seconds and slowly release back to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 138,
    "name": "Decline Sit-Up",
    "slug": "decline-sit-up",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Position yourself on a decline bench with your feet securely locked in place.",
      "Place your hands behind your head or across your chest.",
      "Engage your core and slowly lift your upper body towards your knees.",
      "Pause briefly at the top of the movement, then slowly lower your upper body back down to the starting position.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 139,
    "name": "Flutter Kick",
    "slug": "flutter-kick",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["lower back", "quad"],
    "steps": [
      "Lie on your back with your legs straight and your arms by your sides or underneath your lower back.",
      "Lift both legs off the ground.",
      "Begin rapidly fluttering your legs up and down.",
      "Keep your core engaged and your gaze towards the ceiling.",
      "Continue fluttering for the desired amount of time or repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 140,
    "name": "Dead Bug",
    "slug": "dead-bug",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Start by lying on your back with your arms extended towards the ceiling.",
      "Bend your knees and lift your legs up so that your knees are directly above your hips and your shins are parallel to the floor.",
      "Engage your core muscles by lowering your right arm and left leg towards the floor, keeping them hovering just above the ground. Both your right arm and left leg straighten as they approach the floor.",
      "Return your arm and leg to the starting position and repeat on the opposite side.",
      "Continue alternating sides for the desired number of repetitions or time."
    ],
    "notes": ""
  },
  {
    "pk": 141,
    "name": "Chest Press – Machine",
    "slug": "chest-press-machine",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Adjust the seat height so that the handles are at chest level.",
      "Select the appropriate weight on the weight stack.",
      "Sit on the machine with your back flat against the backrest and your feet flat on the floor.",
      "Grasp the handles with an overhand grip and push them away from your chest until your arms are fully extended.",
      "Slowly lower the handles back towards your chest, keeping your elbows at a 90-degree angle.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 142,
    "name": "Gripper",
    "slug": "gripper",
    "primaryMuscles": ["forearm - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the gripper machine to the desired resistance level.",
      "Hold the gripper in one hand with a firm grip, making sure your fingers are comfortably positioned on the handles.",
      "Keep your wrist and forearm in a neutral position to avoid unnecessary strain.",
      "Start by squeezing the handles together using your hand strength.",
      "Continue to squeeze the handles as forcefully as you can, engaging your grip muscles.",
      "Hold the maximum contraction for a few seconds to fully activate your muscles.",
      "Slowly release the tension and allow the handles to return to the starting position.",
      "Repeat the squeezing and releasing motion for the desired number of repetitions.",
      "Switch to the other hand and repeat the exercise to work both hands equally."
    ],
    "notes": ""
  },
  {
    "pk": 143,
    "name": "Lying External Shoulder Rotation – Dumbbell",
    "slug": "lying-external-shoulder-rotation-dumbbell",
    "primaryMuscles": ["rotator cuff - back"],
    "secondaryMuscles": [],
    "steps": [
      "Lie on your side on a flat bench with your legs stacked, and your body straight as possible from head to toes.",
      "Bend your upper arm (the one farthest from the bench) at a 90-degree angle at your elbow with your forearm parallel to the floor, and grasp a dumbbell with a your palm facing the floor.",
      "Rotate your shoulder while keeping your elbow at a 90-degree angle, moving your forearm towards the ceiling and above your body.",
      "Rotate your arm upward as far as comfortably possible without lifting your elbow off your torso or your body moving off its position.",
      "Pause at the top of the movement for a brief moment.",
      "Slowly return the dumbbell to the starting position by rotating the forearm back to the horizontal starting position while keeping the elbow angle constant.",
      "Complete all the desired repetitions on one arm before switching to the other arm and repeating the steps."
    ],
    "notes": "Keep your elbow pinned to your torso throughout the exercise."
  },
  {
    "pk": 144,
    "name": "Overhead Tricep Extension – Cable With Rope",
    "slug": "overhead-tricep-extension-cable-with-rope",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Attach a rope to a cable machine at a low setting.",
      "Face the machine and grab the rope with an overhand grip.",
      "Step back to create tension in the cable and keep your feet shoulder-width apart.",
      "Keep your elbows close to your head and your upper arms stationary.",
      "Extend your forearms down until your arms are fully extended.",
      "Pause for a moment and then slowly return to the starting position.",
      "Repeat for desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 145,
    "name": "Snatch Grip Deadlift",
    "slug": "snatch-grip-deadlift",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Begin by standing with your feet shoulder-width apart and the barbell on the ground in front of you.",
      "Take a wide grip on the barbell, with your hands outside of your shoulders.",
      "Lower your hips and bend your knees, keeping your back straight and your chest up.",
      "Engage your core and lift the barbell off the ground, keeping it close to your body.",
      "As you lift the barbell, extend your hips and knees to stand up straight.",
      "Once you are standing, pause briefly and then lower the barbell back down to the ground, keeping it close to your body.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 146,
    "name": "Towel Pull-Up",
    "slug": "towel-pull-up",
    "primaryMuscles": ["forearm - inner", "lat"],
    "secondaryMuscles": [
      "bicep",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - back"
    ],
    "steps": [
      "Find a sturdy horizontal bar that can support your body weight.",
      "Fold a single large towel or two hand towels in half and drape them over the bar.",
      "Grab the ends of the towel with both hands, palms facing each other.",
      "Hang from the bar with your arms fully extended and your feet off the ground.",
      "Pull yourself up towards the bar by bending your elbows and squeezing your shoulder blades together.",
      "Pause at the top of the movement, with your chin above the bar.",
      "Lower yourself back down to the starting position with control.",
      "Repeat for desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 147,
    "name": "Oblique Crunch",
    "slug": "oblique-crunch",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Lie on your back with your legs together, knees bent and feet flat on the ground. Drop both legs to the ground on your right side.",
      "Place your left hand behind your head and your right arm on the ground on your right side.",
      "Engage your core muscles and lift your shoulders off the ground, extending your left elbow towards your left quadricep. Flex your waist several inches to feel the contraction in your left oblique.",
      "Lower your shoulders back down to the ground and repeat for the desired number of repetitions.",
      "Continue alternating sides for the desired number of repetitions.",
      "Switch sides and repeat the exercise for the same number of repetitions."
    ],
    "notes": "Make this exercise more difficult by putting both hands behind your head, or even more difficult by stretching your hands beyond your head."
  },
  {
    "pk": 148,
    "name": "Lying Windshield Wiper with Bent Knees",
    "slug": "lying-windshield-wiper-with-bent-knees",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Start by lying flat on your back with your arms extended out to the sides and your palms facing down.",
      "Bend your knees and lift your feet off the ground, keeping your shins parallel to the floor.",
      "Slowly lower your legs to one side, keeping your knees bent and your feet together.",
      "Pause for a moment, then use your core muscles to lift your legs back to the starting position.",
      "Repeat the movement to the other side, alternating sides for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 149,
    "name": "Push-Up – Hands in Rings",
    "slug": "push-up-hands-in-rings",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Start in a plank position with your hands placed inside suspended rings.",
      "Engage your core and glutes to keep your body in a straight line.",
      "Lower your body towards the ground by bending your elbows.",
      "Keep your elbows close to your body and your shoulders down and back.",
      "Push yourself back up to the starting position by straightening your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 150,
    "name": "Single-Arm Hang – Bar",
    "slug": "single-arm-hang-bar",
    "primaryMuscles": ["forearm - inner", "forearm - outer"],
    "secondaryMuscles": [],
    "steps": [
      "Find a sturdy bar that can support your weight.",
      "Jump up and grab the bar with one hand.",
      "Hold the position for as long as you can.",
      "Slowly lower yourself down and release your grip on the bar."
    ],
    "notes": ""
  },
  {
    "pk": 151,
    "name": "Shoulder Press – Barbell",
    "slug": "standing-shoulder-press-barbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side", "tricep"],
    "steps": [
      "Start by standing with your feet shoulder-width apart, looking at a racked, weighted barbell.",
      "Raise the barbell to shoulder height, palms facing forward, and elbows bent.",
      "Press the barbell upward until your arms are fully extended above your head.",
      "Pause for a moment at the top of the movement, then slowly lower the barbell back down to shoulder height.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 152,
    "name": "Close Grip Seated Row",
    "slug": "close-grip-seated-row",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Adjust the cable machine to the appropriate weight and attach a V-bar handle to the cable.",
      "Sit on the machine with your feet flat on the footrests and your knees slightly bent.",
      "Grasp the V-bar handle with an overhand grip, with your hands close together.",
      "Keep your back straight and your shoulders down and back.",
      "Pull the V-bar handle towards your abdomen, keeping your elbows close to your body.",
      "Squeeze your shoulder blades together at the end of the movement.",
      "Slowly release the handle back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 153,
    "name": "Power Clean and Press",
    "slug": "power-clean-and-press",
    "primaryMuscles": [
      "glute",
      "lower back",
      "shoulder - front",
      "thigh - inner"
    ],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "hamstring",
      "shoulder - side",
      "trap",
      "tricep"
    ],
    "steps": [
      "Start with feet shoulder-width apart and the barbell on the floor in front of you.",
      "Bend down and grip the barbell with hands slightly wider than shoulder-width apart.",
      "Stand up, keeping your back straight, the barbell close to your shins, and lifting with your legs.",
      "As the barbell reaches your chest, quickly drop into a high squat position. The crease of your hips should be above the top of your thighs. Catch the barbell at shoulder height.",
      "Stand up from the squat position, lifting the barbell overhead with arms fully extended.",
      "Lower the barbell back down to shoulder height.",
      "Reverse the movement and lower the barbell back down to the floor and release your grip.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 154,
    "name": "Snatch",
    "slug": "snatch",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf", "forearm - inner", "hamstring", "trap"],
    "steps": [
      "Start with feet shoulder-width apart and toes pointing slightly outward.",
      "Place hands on the barbell with a wide grip, palms facing down.",
      "Lower your hips and bend your knees, keeping your back straight.",
      "Drive through your legs and hips, pulling the barbell up to your chest.",
      "As the barbell reaches chest height, quickly extend your arms and legs, pulling the barbell up and overhead.",
      "Lock out your arms and stand up straight, holding the barbell overhead.",
      "Lower the barbell back down to the starting position by reversing the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 155,
    "name": "Hammer Curl – Dumbbell",
    "slug": "hammer-curl-dumbbell",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - outer"],
    "steps": [
      "Stand up straight with your feet shoulder-width apart and hold a dumbbell in each hand with your palms facing your body.",
      "Keep your elbows close to your torso and exhale as you lift both dumbbells towards the shoulder of their holding hand, until your bicep is fully contracted and the dumbbell is at shoulder level.",
      "Pause for a second at the top of the movement and squeeze your biceps.",
      "Lower the dumbbells back down to the starting position in a controlled manner.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 156,
    "name": "Hip Abduction – Band",
    "slug": "hip-abduction-band",
    "primaryMuscles": ["thigh - outer"],
    "secondaryMuscles": ["glute"],
    "steps": [
      "Start by placing an exercise band around both of your knees. Make sure the band is secure and does not slip during the exercise.",
      "Sit on a bench with your feet hip-width apart and your toes pointing forward.",
      "Exhale as you slowly press your knees outward, against the resistance of the exercise band.",
      "Continue pressing until you feel a comfortable stretch in your outer hip and thigh muscles.",
      "Pause for a brief moment at the outwardmost position, feeling the tension in the exercise band.",
      "Inhale as you release the pressure and bring your knees back together, returning to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 157,
    "name": "Seated One-Handed Row – Cable",
    "slug": "seated-one-handed-row-cable",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Sit facing a cable machine with your feet flat on the ground or footrests.",
      "Grasp the handle with one hand, palm facing inward.",
      "Use your feet to push your body back, creating tension on the cable, keeping your arm fully extended.",
      "Engage your core while leaning slightly forward.",
      "Pull the handle towards your torso, keeping your elbow close to your body.",
      "Squeeze your shoulder blades together while leaning slightly back.",
      "Pause for a moment at the top of the movement, feeling the contraction in your back muscles.",
      "Slowly extend your arm back to the starting position, maintaining control throughout the movement.",
      "Repeat for the desired number of repetitions, then switch to the other hand."
    ],
    "notes": ""
  },
  {
    "pk": 158,
    "name": "Lunge – Dumbbell",
    "slug": "lunge-dumbbell",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Stand with your feet hip-width apart and hold a dumbbell in each hand, palms facing your body.",
      "Take a big step forward with your right foot, keeping your torso upright.",
      "Bend both knees to lower your body towards the floor, making sure your right knee is directly above your ankle.",
      "Push through your right heel to return to the starting position.",
      "Repeat on the other side, stepping forward with your left foot.",
      "Continue alternating legs for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 159,
    "name": "Cable Curl – Bar",
    "slug": "cable-curl-bar",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Stand facing a cable machine with your feet shoulder-width apart.",
      "Attach a straight bar to the low pulley of the cable machine.",
      "Grasp the bar with an underhand grip, hands shoulder-width apart.",
      "Keep your elbows close to your sides and your upper arms stationary throughout the exercise.",
      "Exhale and curl the bar up towards your shoulders, contracting your biceps.",
      "Pause for a moment at the top of the movement, squeezing your biceps.",
      "Inhale and slowly lower the bar back to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 160,
    "name": "Hack Squat – Landmine",
    "slug": "hack-squat-landmine",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Place the end of a barbell into a landmine attachment or securely anchor it in a corner.",
      "Stand with your feet shoulder-width apart, toes slightly turned out.",
      "Hold the unattached end of the barbell with both hands, palms facing inwards. Lift the end up and over one shoulder while you turn away from the weight. Rest the barbell on your shoulder with the weight at your back.",
      "Keep your core engaged, chest lifted, and back straight.",
      "Lower your body by bending at the knees and hips, as if sitting back into a chair.",
      "Continue lowering until your thighs are parallel to the ground or slightly below.",
      "Push through your heels and extend your knees and hips to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 161,
    "name": "Concentration Curl",
    "slug": "concentration-curl",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Start by sitting on a bench with your feet flat on the floor and your knees slightly bent.",
      "Hold a dumbbell in one hand and place your elbow on the inside of your thigh, just above the knee.",
      "Extend your arm fully, allowing the dumbbell to hang down towards the floor.",
      "Keeping your upper arm stationary, exhale and curl the dumbbell towards your shoulder while contracting your biceps.",
      "Pause for a moment at the top of the movement, squeezing your biceps.",
      "Inhale and slowly lower the dumbbell back to the starting position, fully extending your arm.",
      "Repeat for the desired number of repetitions and then switch arms."
    ],
    "notes": ""
  },
  {
    "pk": 162,
    "name": "One-Handed Tricep Pushdown – Cable",
    "slug": "one-handed-tricep-pushdown-cable",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Stand facing a cable machine with your feet shoulder-width apart.",
      "Grasp the cable attachment with one hand, palm facing down.",
      "Position your elbow at a 90-degree angle and keep it close to your side.",
      "Engage your core and maintain a neutral spine.",
      "Exhale and extend your arm down, fully straightening your elbow.",
      "Pause for a moment, squeezing your tricep muscle.",
      "Inhale and slowly return your arm to the starting position, maintaining control.",
      "Repeat for the desired number of repetitions and then switch arms."
    ],
    "notes": ""
  },
  {
    "pk": 163,
    "name": "Hip Thrust – Machine",
    "slug": "hip-thrust-machine",
    "primaryMuscles": ["glute"],
    "secondaryMuscles": ["hamstring", "thigh - inner"],
    "steps": [
      "Adjust the machine to the appropriate height and resistance level.",
      "Sit on the machine with your back against the backrest and your feet flat on the foot platform.",
      "Engage your core and glutes, then press through your heels to extend your hips forward.",
      "Continue to drive your hips forward until your body is in a straight line from your knees to your shoulders.",
      "Hold the position for a brief moment, focusing on squeezing your glutes.",
      "Slowly lower your hips back down to the starting position, maintaining control throughout the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 165,
    "name": "Squat Jerk",
    "slug": "squat-jerk",
    "primaryMuscles": [
      "glute",
      "lower back",
      "quad",
      "shoulder - front",
      "thigh - inner"
    ],
    "secondaryMuscles": ["calf", "shoulder - side", "trap", "tricep"],
    "steps": [
      "Start with your feet shoulder-width apart and toes slightly turned out.",
      "Get into position by cleaning the barbell or lifting it from a rack at shoulder height with an overhand grip.",
      "Drop your body into a deep squat position, keeping your chest up and back straight, while pushing the barbell above your head, extending your arms fully.",
      "As you reach the bottom of the squat, explosively drive through your legs and hips to stand up.",
      "Lock out your elbows and stabilize the weight overhead.",
      "Lower the weight back down to shoulder height and repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 166,
    "name": "Seated Calf Raise",
    "slug": "seated-calf-raise",
    "primaryMuscles": ["calf"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the seat height and position yourself on the calf raise machine with your feet flat on the foot platform.",
      "Place your thighs under the leg pad and ensure that your knees are slightly bent.",
      "Grasp the handles or sides of the machine for stability.",
      "Slowly raise your heels by extending your ankles as far as possible while keeping your toes on the foot platform.",
      "Hold the contracted position for a brief moment, feeling the stretch in your calves.",
      "Lower your heels back down to the starting position, allowing your calves to stretch.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 167,
    "name": "Split Jerk",
    "slug": "split-jerk",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": [
      "glute",
      "lower back",
      "quad",
      "shoulder - side",
      "thigh - inner",
      "trap",
      "tricep"
    ],
    "steps": [
      "Start with the barbell resting on your shoulders, hands slightly wider than shoulder-width apart.",
      "Bend your knees and lower your body into a partial squat, keeping your back straight and core engaged.",
      "Drive through your legs and explosively push the barbell overhead, extending your arms fully.",
      "As the barbell reaches its peak, quickly split your legs, with one foot moving forward and the other moving backward into a high lunge position.",
      "Stabilize your body and hold the split position for a moment.",
      "Stand back up by bringing your front and back feet back to the position where they started.",
      "Lower the barbell back to your shoulders and repeat the movement for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 168,
    "name": "Seated Snatch Grip Behind the Neck Press",
    "slug": "seated-snatch-grip-behind-the-neck-press",
    "primaryMuscles": ["shoulder - front", "shoulder - side"],
    "secondaryMuscles": ["trap", "tricep"],
    "steps": [
      "Start by sitting on a bench with a backrest, next to a racked, weighted barbell.",
      "Grip the barbell with a wide snatch grip.",
      "Position the barbell behind your neck, resting it on your upper traps.",
      "Engage your core and keep your back straight.",
      "Press the barbell overhead by extending your arms and pushing the weight up.",
      "Lock out your elbows at the top of the movement.",
      "Lower the barbell back down to the starting position behind your neck.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 169,
    "name": "Standing Snatch Grip Behind the Neck Press",
    "slug": "standing-snatch-grip-behind-the-neck-press",
    "primaryMuscles": ["shoulder - front", "shoulder - side"],
    "secondaryMuscles": ["trap", "tricep"],
    "steps": [
      "Stand with your feet shoulder-width apart and grip the barbell with a wide snatch grip.",
      "Position the barbell behind your neck, resting it on your upper traps.",
      "Engage your core and keep your back straight.",
      "Press the barbell overhead by extending your arms and pushing the weight up.",
      "Lock out your elbows at the top of the movement.",
      "Lower the barbell back down to the starting position behind your neck.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 170,
    "name": "Close-Grip Bench Press",
    "slug": "close-grip-bench-press",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": ["chest", "shoulder - front"],
    "steps": [
      "Set up the bench press station with the appropriate weight on the barbell.",
      "Lie down on the bench with your feet flat on the ground and your back pressed against the bench.",
      "Grasp the barbell with your hands shoulder-width apart or just slightly narrower.",
      "Unrack the barbell and hold it directly above your chest, arms fully extended.",
      "Lower the barbell towards your chest by bending your elbows, keeping them close to your body.",
      "Pause briefly with the barbell barely above your chest.",
      "Push the barbell back up to the starting position by extending your arms, keeping your elbows close to your body.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 171,
    "name": "Clean",
    "slug": "clean",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf", "forearm - inner", "hamstring", "trap"],
    "steps": [
      "Start with feet hip-width apart and hands gripping the barbell just outside the legs.",
      "Lower into a squat position, keeping the back straight and the chest up.",
      "Explosively extend the hips, knees, and ankles, driving the barbell upwards.",
      "As the barbell reaches chest level, quickly drop underneath it in a squat position, rotating the elbows forward.",
      "Catch the barbell on the front of the shoulders, with the elbows pointing forward and the chest up.",
      "Stand up by extending the hips and knees, keeping the barbell close to the body.",
      "Lower the barbell back to the starting position by reversing the movement."
    ],
    "notes": ""
  },
  {
    "pk": 172,
    "name": "One-Handed Wrist Curl – Dumbbell",
    "slug": "one-handed-wrist-curl-dumbbell",
    "primaryMuscles": ["forearm - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Sit on a bench, resting your forearm on your knee, gripping a dumbbell in one hand with your palm facing up.",
      "Bending at the wrist, extend your knuckles towards the floor.",
      "Curl your wrist upward, bringing the dumbbell towards your forearm.",
      "Pause for a moment at the top of the movement, squeezing your forearm muscles.",
      "Slowly lower the dumbbell back to the starting position, fully extending your wrist.",
      "Repeat for the desired number of repetitions.",
      "Switch hands and repeat the exercise with the other hand."
    ],
    "notes": ""
  },
  {
    "pk": 173,
    "name": "Standing Chest Fly – Cable",
    "slug": "standing-chest-fly-cable",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["bicep", "forearm - inner", "shoulder - front"],
    "steps": [
      "Stand in front of a cable machine, facing away from the machine, with your feet shoulder-width apart and knees slightly bent.",
      "Grasp the handles of the cables with your palms facing forward and your arms extended out to the sides at shoulder height.",
      "Engage your core and maintain a slight bend in your elbows throughout the exercise. Try not to change the degree of elbow bend during the repetitions.",
      "Exhale and slowly bring your arms forward, until your hands touch, while maintaining the same level of shoulder height.",
      "Inhale and slowly return your arms back to the starting position, keeping them extended and at shoulder height.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 174,
    "name": "Floor Back Extension",
    "slug": "floor-back-extension",
    "primaryMuscles": ["lower back"],
    "secondaryMuscles": [],
    "steps": [
      "Lie face down on the floor with your legs extended and your arms by your sides.",
      "Place your hands on the back of your head, or keep them out in a \"cactus pose\".",
      "Engage your core muscles by drawing your navel towards your spine.",
      "Slowly lift your upper body off the floor, using your lower back muscles.",
      "Keep your neck in a neutral position and avoid straining or arching it.",
      "Hold the lifted position long enough to squeeze your lower back muscles.",
      "Lower your upper body back down to the starting position in a controlled manner.",
      "Repeat the exercise for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 175,
    "name": "Side Plank",
    "slug": "side-plank",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Start by lying on your side with your legs extended and stacked on top of each other.",
      "Place your forearm on the ground directly below your shoulder, with your elbow bent at a 90-degree angle.",
      "Engage your core muscles and lift your hips off the ground, creating a straight line from your head to your feet.",
      "Keep your body in a straight line and avoid sagging or letting your hips drop.",
      "Hold the position for the desired amount of time.",
      "Repeat on the other side."
    ],
    "notes": ""
  },
  {
    "pk": 176,
    "name": "Pec Deck",
    "slug": "pec-deck",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["shoulder - front"],
    "steps": [
      "Sit on the Pec Deck machine with your back flat against the backrest and your feet firmly on the floor.",
      "Adjust the seat height so that the handles are at chest level.",
      "Grasp the handles with an overhand grip, keeping your elbows slightly bent.",
      "Exhale and push the handles together in front of your chest, squeezing your chest muscles.",
      "Hold the contraction for a second, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 177,
    "name": "Pronated Grip Lat Pulldown",
    "slug": "pronated-grip-lat-pulldown",
    "primaryMuscles": ["lat"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - back"
    ],
    "steps": [
      "Adjust the seat height and position yourself on the lat pulldown machine.",
      "Grab the bar with an overhand grip, palms facing away from you, slightly wider than shoulder-width apart.",
      "Sit down and position your thighs under the thigh pads, keeping your feet flat on the floor.",
      "Keep your back straight and lean back slightly, engaging your core muscles.",
      "Exhale and pull the bar down towards your upper chest, leading with your elbows.",
      "Squeeze your shoulder blades together at the bottom of the movement.",
      "Inhale and slowly release the bar back to the starting position, extending your arms fully.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 178,
    "name": "Decline Bench Press – Barbell",
    "slug": "decline-bench-press-barbell",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["shoulder - front", "tricep"],
    "steps": [
      "Set up the decline bench at a decline angle of your choice.",
      "Lie down on the bench with your feet secured under the foot pads.",
      "Grip the barbell with an overhand grip slightly wider than shoulder-width apart.",
      "Lift the barbell off the rack and hold it directly above your chest with your arms fully extended.",
      "Inhale and slowly lower the barbell towards your lower chest.",
      "Pause for a moment when the barbell is just above your chest.",
      "Exhale and push the barbell back up to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 179,
    "name": "Standing Cable Leg Curl",
    "slug": "standing-cable-leg-curl",
    "primaryMuscles": ["hamstring"],
    "secondaryMuscles": [],
    "steps": [
      "Stand facing a cable machine with your feet hip-width apart.",
      "Attach an ankle cuff to your right ankle.",
      "Hold onto the machine for support and balance.",
      "Bend your right knee and bring your heel towards your glutes, keeping your upper leg stationary.",
      "Squeeze your hamstring at the top of the movement.",
      "Slowly lower your leg back to the starting position.",
      "Repeat for the desired number of repetitions.",
      "Switch sides and perform the exercise with your left leg."
    ],
    "notes": ""
  },
  {
    "pk": 180,
    "name": "Cable Pull Through",
    "slug": "cable-pull-through",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": ["thigh - inner"],
    "steps": [
      "Attach a rope to a cable machine at floor-level position and stand facing away from the machine with your feet shoulder-width apart.",
      "Grab the rope with both hands and position it between your legs, just above your knees.",
      "Hinge forward at the hips and push your glutes back, keeping your back straight and chest up.",
      "Lower your torso until it is parallel to the floor, feeling a stretch in your hamstrings.",
      "Engage your glutes and hamstrings to drive your hips forward, standing up straight.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 181,
    "name": "Shrug – Barbell",
    "slug": "shrug-barbell",
    "primaryMuscles": ["trap"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a barbell in front of your thighs with an overhand grip.",
      "Keep your arms fully extended and your shoulders relaxed.",
      "Slowly raise your shoulders as high as possible, as if you are trying to touch your ears with them.",
      "Hold the contracted position for a brief pause, squeezing your shoulder muscles.",
      "Lower your shoulders back down to the starting position in a controlled manner.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 182,
    "name": "Bulgarian Split Squat",
    "slug": "bulgarian-split-squat",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Stand with your back facing a bench or step.",
      "Place the top of one foot on the bench or step behind you.",
      "Bend your front knee and lower your body down towards the ground, keeping your back straight.",
      "Pause when your front thigh is parallel to the ground.",
      "Push through your front heel to return to the starting position.",
      "Repeat for the desired number of repetitions, then switch legs."
    ],
    "notes": ""
  },
  {
    "pk": 183,
    "name": "Crunch – Machine",
    "slug": "crunch-machine",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Adjust the seat height and foot pad position on the crunch machine to ensure proper alignment.",
      "Sit on the machine with your back against the backrest and your feet secured under the foot pads.",
      "Place your hands lightly on the sides of your head, avoiding pulling on your neck.",
      "Engage your core muscles by drawing your belly button in towards your spine.",
      "Exhale and slowly curl your upper body forward, contracting your abdominal muscles.",
      "Pause for a moment at the top of the movement, feeling the contraction in your abs.",
      "Inhale and slowly lower your upper body back to the starting position, maintaining control throughout the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 184,
    "name": "Shrug – Dumbbell",
    "slug": "shrug-dumbbell",
    "primaryMuscles": ["trap"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a dumbbell in each hand, palms facing your body.",
      "Keep your arms straight and allow the dumbbells to hang at your sides.",
      "Engage your core and lift your shoulders towards your ears, squeezing your shoulder blades together.",
      "Hold the contraction for a second, then slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 185,
    "name": "One-Legged Balance",
    "slug": "one-legged-balance",
    "primaryMuscles": ["calf"],
    "secondaryMuscles": [],
    "steps": [
      "Stand tall with your feet hip-width apart.",
      "Shift your weight onto one leg and lift the other leg off the ground.",
      "Engage your core muscles to maintain balance.",
      "Keep your standing leg slightly bent and your knee aligned with your toes.",
      "Find a focal point to help you maintain balance and focus.",
      "Hold the position for a desired amount of time.",
      "Switch legs and repeat the exercise."
    ],
    "notes": "Try this exercise with closed eyes for increased difficulty."
  },
  {
    "pk": 186,
    "name": "Feet-Up Bench Press – Barbell",
    "slug": "feet-up-bench-press-barbell",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Lie flat on a bench with your feet up in the air, knees bent at a 90-degree angle.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Engage your core and press your lower back into the bench.",
      "Unrack the barbell and hold it directly above your chest, arms fully extended.",
      "Inhale and slowly lower the barbell towards your chest, keeping your elbows tucked in.",
      "Pause for a brief moment when the barbell touches your chest.",
      "Exhale and push the barbell back up to the starting position, fully extending your arms.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 187,
    "name": "Curl – Machine",
    "slug": "curl-machine",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Adjust the seat height and position yourself comfortably on the machine.",
      "Grasp the handles with an underhand grip, palms facing up.",
      "Keep your back straight and your elbows close to your sides.",
      "Exhale and slowly curl the handles towards your shoulders, contracting your biceps.",
      "Pause for a moment at the top of the movement, squeezing your biceps.",
      "Inhale and slowly lower the handles back to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 188,
    "name": "Reverse Fly – Machine",
    "slug": "reverse-fly-machine",
    "primaryMuscles": ["rotator cuff - back", "shoulder - back"],
    "secondaryMuscles": ["trap"],
    "steps": [
      "Adjust the seat height and chest pad of the machine to your comfort level.",
      "Sit on the machine with your chest against the pad and grasp the handles with an overhand grip.",
      "Keep your back straight and engage your core muscles.",
      "Exhale and slowly pull the handles back and away from your body, squeezing your shoulder blades together.",
      "Pause for a moment at the fully contracted position.",
      "Inhale and slowly return the handles to the starting position, maintaining control throughout the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 189,
    "name": "Hang Power Snatch",
    "slug": "hang-power-snatch",
    "primaryMuscles": ["glute", "lower back"],
    "secondaryMuscles": [
      "forearm - inner",
      "hamstring",
      "thigh - inner",
      "trap"
    ],
    "steps": [
      "Stand with feet hip-width apart, holding a barbell with an overhand grip just outside of your thighs.",
      "Lower into a quarter squat position, keeping your back straight and chest up.",
      "Explosively extend your hips, knees, and ankles, jumping upward.",
      "As you jump, pull the barbell upward, keeping it close to your body.",
      "As the barbell reaches chest height, quickly drop into a quarter squat position and rotate your elbows under the barbell, keeping your arms straight.",
      "Catch the barbell overhead with arms fully extended, in a quarter squat position.",
      "Stand up, fully extending your hips and knees, while keeping the barbell overhead.",
      "Lower the barbell back down to the starting position, and repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 190,
    "name": "One-Handed Plate Wrist Curl",
    "slug": "one-handed-plate-wrist-curl",
    "primaryMuscles": ["forearm - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Start by sitting on a bench or chair with your feet flat on the ground.",
      "Hold a weight plate with an underhand grip, placing your hand on the inside rim of the plate.",
      "Rest your forearm on your thigh, with your wrist hanging off the edge and pointing to the ceiling.",
      "Lower the weight plate towards the ground by flexing your wrist, keeping your forearm stationary.",
      "Pause for a moment at the bottom of the movement, feeling the stretch in your wrist.",
      "Slowly curl the weight plate back up towards your body.",
      "Repeat for the desired number of reps and then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 191,
    "name": "Kettlebell Swing",
    "slug": "kettlebell-swing",
    "primaryMuscles": ["glute", "lower back"],
    "secondaryMuscles": [
      "forearm - inner",
      "hamstring",
      "thigh - inner",
      "trap"
    ],
    "steps": [
      "Stand with your feet shoulder-width apart, toes slightly turned out.",
      "Hold the kettlebell with both hands between your thighs, maintaining an overhand grip, arms hanging naturally extended towards the floor.",
      "Slightly bend your knees and hinge at the hips to push your buttocks back while keeping a flat back.",
      "Initiate the swing by snapping your hips forward, driving the kettlebell upward with your glutes and hamstrings.",
      "Swing the kettlebell to chest height with arms extended; keep your core engaged.",
      "Allow the kettlebell to descend by hinging at the hips again, controlling the downward movement.",
      "Use the momentum of the descending kettlebell to immediately begin the next swing.",
      "Perform the desired number of repetitions, maintaining a rhythmic and controlled pace.",
      "To finish, allow the kettlebell to swing back down one last time, slowing the swing to a stop safely."
    ],
    "notes": ""
  },
  {
    "pk": 192,
    "name": "Seated Oblique Twist",
    "slug": "seated-oblique-twist",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Sit on a workout mat or bench with your knees bent and feet flat on the floor.",
      "Engage your core muscles by drawing your navel towards your spine.",
      "Hold a dumbbell or medicine ball with both hands close to your chest.",
      "Keeping your back straight, lean slightly back to engage your abdominal muscles.",
      "Exhale and rotate your torso to the right, bringing the weight towards your right hip.",
      "Inhale as you return to the starting position.",
      "Exhale and rotate your torso to the left, bringing the weight towards your left hip.",
      "Inhale as you return to the starting position.",
      "Repeat the twisting motion for the desired number of repetitions on each side."
    ],
    "notes": ""
  },
  {
    "pk": 193,
    "name": "Lying Leg Curl",
    "slug": "lying-leg-curl",
    "primaryMuscles": ["hamstring"],
    "secondaryMuscles": [],
    "steps": [
      "Lie face down on a leg curl machine with your legs fully extended and your ankles against the padded lever.",
      "Grasp the handles on the machine for stability.",
      "Engage your core and squeeze your glutes.",
      "Bend your knees to curl the lever towards your glutes, keeping your upper legs stationary.",
      "Pause for a moment at the top of the movement, feeling the contraction in your hamstrings.",
      "Slowly lower the lever back to the starting position, fully extending your legs.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 194,
    "name": "Hack Squat – Machine",
    "slug": "hack-squat-machine",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the seat height and foot platform of the machine to your desired position.",
      "Sit on the machine with your back against the pad and grasp the handles with an overhand grip.",
      "Engage your core throughout the exercise.",
      "Bend your knees and lower your body down, keeping your back straight and your heels on the foot platform.",
      "Continue descending until your thighs are parallel to the foot platform or as low as your flexibility allows.",
      "Push through your heels and extend your legs to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 195,
    "name": "One-Handed Wrist Extension – Dumbbell",
    "slug": "one-handed-wrist-extension-dumbbell",
    "primaryMuscles": ["forearm - outer"],
    "secondaryMuscles": [],
    "steps": [
      "Hold a dumbbell with an overhand grip.",
      "Sit on a bench with your feet shoulder-width apart.",
      "Rest your forearm on the top of your thigh, with your palm facing down.",
      "Slowly lift the dumbbell by extending your wrist, keeping your elbows stationary. Focus on bringing your knuckles back towards the top of your forearm.",
      "Hold the dumbbell at the top of the movement for a moment.",
      "Lower the dumbbell back down to the starting position by flexing your wrist towards the floor.",
      "Repeat for the desired number of reps and then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 196,
    "name": "Seated Shoulder Press – Barbell",
    "slug": "seated-overhead-press-barbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side", "tricep"],
    "steps": [
      "Start by sitting on a back-supporting bench with your feet firmly planted on the ground.",
      "Hold the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Bring the barbell to shoulder level, resting it on your upper chest and front shoulders.",
      "Engage your core and keep your back straight throughout the exercise.",
      "Press the barbell overhead by extending your arms fully, but without locking your elbows.",
      "Pause briefly at the top of the movement, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 200,
    "name": "Lunge – Barbell",
    "slug": "lunge-barbell",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Start by standing with your feet hip-width apart and your back straight.",
      "Hold a barbell across your upper back, resting it on your shoulders.",
      "Take a step forward with your right foot, keeping your core engaged and your chest lifted.",
      "Bend both knees to lower your body towards the ground, making sure your front knee does not go past your toes.",
      "Lower your body until your front thigh is parallel to the ground, and your back knee is hovering just above the floor.",
      "Push through your front heel to return to the starting position.",
      "Repeat the movement on the other side by stepping forward with your left foot.",
      "Continue alternating legs for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 201,
    "name": "Kneeling Incline Push-Up",
    "slug": "kneeling-incline-push-up",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Start by kneeling on the ground with your hands placed slightly wider than shoulder-width apart on an elevated surface, such as a bench or step.",
      "Engage your core and lower your chest towards the elevated surface, bending your elbows and keeping them close to your body. Keep your body in a straight line from head to knee.",
      "Pause briefly when your chest is just above the surface, then push through your hands to extend your arms and return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 202,
    "name": "Plate Front Raise",
    "slug": "plate-front-raise",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side"],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a weight plate with both hands in front of your thighs.",
      "Keep your arms straight and slowly raise the weight plate up to shoulder level, making sure to keep your core engaged and your back straight.",
      "Pause for a moment at the top of the movement, then slowly lower the weight plate back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 203,
    "name": "Row – Barbell",
    "slug": "row-barbell",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "lower back",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Stand in front of a barbell with your feet shoulder-width apart.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Engage your core and pull the barbell towards your upper abs or lower chest, keeping your elbows close to your body.",
      "Pause and squeeze your shoulder blades together for a moment at the top of the movement.",
      "Slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 204,
    "name": "One-Handed Lat Pulldown",
    "slug": "one-handed-lat-pulldown",
    "primaryMuscles": ["lat"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - back"
    ],
    "steps": [
      "Adjust the seat height and position yourself in the lat pulldown machine.",
      "Grasp the lat pulldown bar with one hand, using an overhand grip.",
      "Engage your core and keep your back straight throughout the exercise.",
      "Start with your arm fully extended, allowing the weight to be lifted off the stack.",
      "Exhale and pull the bar down towards your side, focusing on squeezing your lat muscles.",
      "Pause for a moment at the bottom of the movement, feeling the contraction in your lat.",
      "Inhale and slowly return the bar to the starting position, fully extending your arm.",
      "Repeat for the desired number of repetitions and then switch to the other hand."
    ],
    "notes": ""
  },
  {
    "pk": 205,
    "name": "Bench Press – Dumbbell",
    "slug": "bench-press-dumbbell",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Lie flat on a bench with your feet firmly planted on the ground.",
      "Hold a dumbbell in each hand, palms facing forward, and extend your arms straight up over your chest.",
      "Lower the dumbbells slowly towards your chest, keeping your elbows wide.",
      "Pause for a moment when the dumbbells are just above your chest.",
      "Push the dumbbells back up to the starting position, fully extending your arms.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 206,
    "name": "Pendlay Row",
    "slug": "pendlay-row",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "lower back",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Load a barbell with weights on the floor.",
      "Stand with your feet shoulder-width apart and your knees slightly bent.",
      "Bend forward at the hips, keeping your back straight and parallel to the ground.",
      "Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Keeping your upper body still and your elbows close to your body, pull the barbell up towards your chest, squeezing your shoulder blades together.",
      "Lower the barbell all the way back down to the floor. Completely release the tension of the weight for a brief moment while maintaining control and keeping your back straight.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 207,
    "name": "Deadlift – Fat Bar",
    "slug": "deadlift-fat-bar",
    "primaryMuscles": [
      "forearm - inner",
      "forearm - outer",
      "glute",
      "hamstring",
      "lower back"
    ],
    "secondaryMuscles": ["calf", "trap", "quad"],
    "steps": [
      "Stand with your feet shoulder-width apart, holding a loaded fat bar in front of your quads.",
      "Bend your knees, hinge and lean forward at the hips, keeping your back straight and your chest up.",
      "Lower the fat bar towards the ground, keeping it close to your legs.",
      "Pause when the fat bar is just below your knees.",
      "Push through your heels and stand up, keeping your back straight and your chest up.",
      "Repeat."
    ],
    "notes": ""
  },
  {
    "pk": 208,
    "name": "One-Handed Standing Chest Fly – Band",
    "slug": "one-handed-standing-chest-fly-band",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["bicep", "forearm - inner", "shoulder - front"],
    "steps": [
      "Find a sturdy stationary object, such as a pole or a door anchor, and attach one end of the resistance band to it at chest height.",
      "Stand with your feet shoulder-width apart, facing away from the stationary object.",
      "Hold the free end of the resistance band in one hand, with your palm facing forward.",
      "Position yourself at a distance from the stationary object so that there is tension in the band when your arm is extended forward at chest height.",
      "Keep your elbow slightly bent and your arm extended out to the side at shoulder height.",
      "Engage your core muscles to stabilize your torso.",
      "With a slight bend in your elbow, bring your arm across your chest in a sweeping motion while keeping your chest open.",
      "Feel the stretch in your chest muscles as you bring your arm across your body.",
      "Return your arm to the starting position in a controlled manner.",
      "Complete the desired number of repetitions on one side before switching to the other."
    ],
    "notes": ""
  },
  {
    "pk": 209,
    "name": "Bench Press – Smith Machine",
    "slug": "bench-press-smith-machine",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Set up a bench under a Smith machine so that the bar is over your chest while lying on the bench.",
      "Lie down on the bench with your feet flat on the floor and your back pressed against the bench.",
      "Extend your arms and grip the bar with your hands slightly wider than shoulder-width apart, palms facing forward.",
      "Unrack the bar by straightening your arms and lifting it off the rack.",
      "Lower the bar slowly towards your chest, keeping your elbows wide.",
      "Pause for a moment when the bar touches your chest.",
      "Push the bar back up to the starting position by extending your arms fully.",
      "Repeat the movement for the desired number of repetitions.",
      "Once finished, carefully rack the bar back onto the Smith machine."
    ],
    "notes": ""
  },
  {
    "pk": 210,
    "name": "Underhand Grip Inverted Row",
    "slug": "underhand-grip-inverted-row",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "rotator cuff - front"
    ],
    "steps": [
      "Set up a barbell or suspension trainer at waist height.",
      "Stand facing the barbell or suspension trainer and grab it with an underhand grip, hands shoulder-width apart.",
      "Walk your feet forward until your body is at a slight angle, with your arms extended and your body in a straight line.",
      "Engage your core and squeeze your shoulder blades together as you pull your chest towards the barbell or suspension trainer.",
      "Pause for a moment at the top of the movement, then slowly lower yourself back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 211,
    "name": "Mountain Climbers – BOSU",
    "slug": "mountain-climbers-bosu",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Place a BOSU ball on the floor with the dome side facing down.",
      "Assume a push-up position with your hands gripped on the sides of the BOSU ball.",
      "Engage your core and keep your body in a straight line from head to toe.",
      "Start by bringing one knee towards your chest, then quickly switch and bring the other knee towards your chest.",
      "Continue alternating your knees in a running motion, keeping your hips low and your abs tight.",
      "Perform the exercise for the desired number of repetitions or time."
    ],
    "notes": ""
  },
  {
    "pk": 212,
    "name": "Standing Bicycle Crunch",
    "slug": "standing-bicycle-crunch",
    "primaryMuscles": ["abdominal", "oblique"],
    "secondaryMuscles": [
      "glute",
      "thigh - inner",
      "thigh - outer",
      "lower back"
    ],
    "steps": [
      "Stand upright with your feet hip-width apart.",
      "Place your hands behind your head, elbows out to the sides.",
      "Engage your core muscles to stabilize your torso.",
      "Lift your right knee towards your chest while simultaneously crunching your left elbow towards your right knee.",
      "Return to the starting position.",
      "Now, lift your left knee towards your chest while crunching your right elbow towards your left knee.",
      "Continue alternating between sides for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 213,
    "name": "Clamshells",
    "slug": "clamshells",
    "primaryMuscles": ["thigh - outer"],
    "secondaryMuscles": ["glute"],
    "steps": [
      "Lie on your side with your knees bent and your feet together.",
      "Keep your feet touching and lift your top knee as high as you can without moving your pelvis.",
      "Pause for a moment at the top of the movement, then slowly lower your knee back down.",
      "Repeat the movement for the desired number of repetitions, then switch to the other side."
    ],
    "notes": "Use a resistance band around your knees to increase the difficulty of the exercise."
  },
  {
    "pk": 214,
    "name": "Fire Hydrants",
    "slug": "fire-hydrants",
    "primaryMuscles": ["glute", "thigh - outer"],
    "secondaryMuscles": [],
    "steps": [
      "Start on all fours with your hands directly under your shoulders and your knees directly under your hips.",
      "Engage your core and keep your back straight throughout the exercise.",
      "Keeping your knee bent, lift one leg out to the side, keeping your foot flexed and parallel to the ground.",
      "Pause for a moment at the top of the movement, squeezing your glutes.",
      "Slowly lower your leg back down to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 215,
    "name": "Push-Up Against Wall",
    "slug": "push-up-against-wall",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Stand facing a wall with your feet shoulder-width apart.",
      "Place your hands on the wall at shoulder height, slightly wider than shoulder-width apart.",
      "Step back a few feet, keeping your body straight and your core engaged.",
      "Bend your elbows and lower your chest towards the wall, keeping your body in a straight line.",
      "Push through your palms and straighten your arms to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 216,
    "name": "Hip Adduction – Machine",
    "slug": "hip-adduction-machine",
    "primaryMuscles": ["thigh - inner"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the seat height of the hip adduction machine so that your knees are at a 90-degree angle when seated.",
      "Sit on the machine with your back against the backrest and your feet flat on the footrests.",
      "Place your thighs against the thigh pads, just above your knees.",
      "Grasp the handles on the sides of the machine for stability.",
      "Engage your core and squeeze your inner thighs together as you exhale.",
      "Hold the contraction for a second and then slowly release as you inhale.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 217,
    "name": "Pause Deadlift – Barbell",
    "slug": "pause-deadlift-barbell",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Stand with your feet hip-width apart and your toes pointing forward.",
      "Bend at the hips and knees to lower your body down, keeping your back straight and your chest lifted.",
      "Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Engage your core and lift the barbell off the ground, driving through your heels and keeping your back straight.",
      "Almost immediately during your lift, pause for a brief moment when the barbell is in front of your lower shins, maintaining tension in your muscles.",
      "Continue the lift until you're standing straight.",
      "Lower the barbell back down to the ground, maintaining control and keeping your back straight.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 218,
    "name": "Deadlift – Trap Bar Low Handles",
    "slug": "deadlift-trap-bar-low-handles",
    "primaryMuscles": ["glute", "hamstring", "lower back"],
    "secondaryMuscles": [
      "calf",
      "forearm - inner",
      "forearm - outer",
      "trap",
      "quad"
    ],
    "steps": [
      "Stand in the center of a loaded trap bar with your feet about hip-width apart.",
      "Bend at your hips and knees to lower your body, maintaining a flat back, to grasp the low handles of the trap bar.",
      "Look forward, keeping your chest up, and straighten your back to prepare for the lift.",
      "Drive through your heels to stand up straight, extending your hips and knees simultaneously while keeping the core engaged.",
      "At the top of the movement, stand fully upright with your shoulders back and the bar close to your body.",
      "Pause briefly at the top of the lift before initiating the return.",
      "Lower the bar by bending at the hips first, then the knees, maintaining a flat back and controlled movement until the weights are back on the ground.",
      "Reset your posture and prepare for the next repetition."
    ],
    "notes": ""
  },
  {
    "pk": 219,
    "name": "Runner's 5",
    "slug": "runners-5",
    "primaryMuscles": ["calf", "glute", "hamstring", "quad"],
    "secondaryMuscles": ["thigh - inner", "thigh - outer"],
    "steps": [
      "Stand with your feet hip-width apart. We're going to complete five, one-legged exercises on one side, then the other.",
      "First, One-legged Squats: Stand on one leg with the other leg extended slightly behind you. Slowly lower your body by bending the knee of the standing leg, keeping your back straight and chest up. Lower yourself as far as comfortable while maintaining balance, then return to the starting position. Repeat for the desired number of repetitions.",
      "Second, One-legged Romanian Deadlifts: Stand on one leg with a slight bend in your knee. Keeping your back straight, hinge at your hips to lower your upper body forward while extending the opposite leg straight behind you. Go as low as your flexibility allows, feeling a stretch in your hamstring. Return to the upright position. Repeat for the desired number of repetitions.",
      "Third, One-legged Lunges: Stand on one leg and take a step forward with the other leg. Lower your body by bending both knees until your front thigh is parallel to the ground (or as low as you can comfortably go). Keep your upper body upright, and push through your front heel to return to the starting position. Repeat for the desired number of repetitions.",
      "Fourth, One-legged Sidekicks: Stand on one leg with the other leg slightly lifted to the side. Perform a side kick by extending your lifted leg straight out to the side, then bring it back to the starting position. Maintain balance throughout. Repeat for the desired number of repetitions.",
      "Fifth, One-legged Front-Back Kicks: Stand on one leg with the other leg lifted slightly in front of you. Perform a front kick by extending your lifted leg forward, then immediately perform a back kick by extending it backward. Keep control and balance throughout the movement. Repeat for the desired number of repetitions.",
      "Repeat the five exercises on the other side."
    ],
    "notes": ""
  },
  {
    "pk": 220,
    "name": "Calf Raise – Barbell",
    "slug": "calf-raise-barbell",
    "primaryMuscles": ["calf"],
    "secondaryMuscles": [],
    "steps": [
      "Load a barbell. Also, find a raised platform or step to stand on.",
      "Place yourself with the step in front of you and the barbell behind you. Stand with your feet shoulder-width apart, toes pointing forward.",
      "Perform a Hack Squat to lift and hold the barbell behind your glutes.",
      "Step onto the platform or step with the balls of your feet, leaving your heels hanging off the edge. Your feet should be parallel to each other. This is your starting position.",
      "Slowly rise up on the balls of your feet, lifting your heels off the ground.",
      "Hold the raised position for a moment, feeling the contraction in your calf muscles.",
      "Lower your heels back down to the starting position in a controlled manner.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 221,
    "name": "Oblique Sit-Up",
    "slug": "oblique-sit-up",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Lie on your back with your knees bent and feet flat on the ground.",
      "Place your hands behind your head, with your elbows pointing out to the sides.",
      "Engage your core muscles by pulling your belly button in towards your spine.",
      "Slowly lift your upper body off the ground, twisting to one side, touching one elbow to the opposite knee.",
      "Exhale as you reach the top of the movement and hold for a second.",
      "Lower your upper body back down to the starting position, inhaling as you do so.",
      "Repeat the movement on the other side, twisting to the opposite side.",
      "Continue alternating sides for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 222,
    "name": "Sled Push",
    "slug": "sled-push",
    "primaryMuscles": ["calf", "glute", "hamstring", "quad"],
    "secondaryMuscles": ["chest", "shoulder - front", "tricep"],
    "steps": [
      "Position yourself behind the sled with your feet shoulder-width apart.",
      "Place your hands on the handles of the sled, gripping them firmly.",
      "Engage your core and drive through your legs to push the sled forward.",
      "Maintain a straight back and keep your head up as you push the sled.",
      "Continue pushing the sled for the desired steps, distance, or time.",
      "Once finished, release the handles and step away from the sled."
    ],
    "notes": ""
  },
  {
    "pk": 223,
    "name": "Overhead Tricep Extension – Barbell",
    "slug": "overhead-tricep-extension-barbell",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a barbell with an overhand grip.",
      "Bring the barbell behind your head, keeping your elbows close to your ears.",
      "Extend your arms upward, straightening your elbows and lifting the barbell above your head.",
      "Pause briefly at the top of the movement, then slowly lower the barbell back behind your head.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 224,
    "name": "Shrug –  Trap Bar",
    "slug": "shrug-trap-bar",
    "primaryMuscles": ["trap"],
    "secondaryMuscles": ["forearm - inner"],
    "steps": [
      "Stand inside a trap bar with your feet shoulder-width apart.",
      "Grasp the handles of the trap bar with an overhand grip.",
      "Keep your back straight and your core engaged.",
      "Exhale and lift your shoulders up towards your ears, squeezing your trapezius muscles.",
      "Hold the shrug position for a second.",
      "Inhale and slowly lower your shoulders back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 225,
    "name": "Tricep Pushdown – Cable With Rope",
    "slug": "tricep-pushdown-cable-with-rope",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Stand facing a cable machine with your feet shoulder-width apart and your knees slightly bent.",
      "Attach a rope handle to the high pulley of the cable machine.",
      "Grasp the rope with an overhand grip, palms facing each other.",
      "Keep your elbows close to your sides and your upper arms stationary throughout the exercise.",
      "Pull the rope towards the ground until your forearms are about parallel to the ground. This is your starting position.",
      "Exhale and push the rope down until your arms are fully extended, while keeping your upper arms stationary.",
      "Hold the contracted position for a brief pause, squeezing your triceps.",
      "Inhale and slowly allow the rope to return to the starting position, while maintaining tension in your triceps.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": "You can kneel in front of the cable machine, rather than stand, if the length of the cable and rope is too long for a full range of motion."
  },
  {
    "pk": 226,
    "name": "Bicycle Crunch",
    "slug": "bicycle-crunch",
    "primaryMuscles": ["abdominal", "oblique"],
    "secondaryMuscles": [],
    "steps": [
      "Lie flat on your back with your hands behind your head and your knees bent.",
      "Bring your right elbow towards your left knee while simultaneously straightening your right leg.",
      "Return to the starting position and repeat the movement on the opposite side, bringing your left elbow towards your right knee while straightening your left leg.",
      "Continue alternating sides in a pedaling motion, keeping your core engaged and your lower back pressed into the floor.",
      "Complete the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 227,
    "name": "One-Handed Lateral Raise – Cable",
    "slug": "one-handed-lateral-raise-cable",
    "primaryMuscles": ["shoulder - side"],
    "secondaryMuscles": ["shoulder - front"],
    "steps": [
      "Stand upright with your feet shoulder-width apart and your knees slightly bent.",
      "Hold the cable handle in one hand with an overhand grip.",
      "Keep your arm straight and your palm facing down.",
      "Engage your core and maintain a neutral spine.",
      "Exhale and slowly lift your arm out to the side until it reaches shoulder level.",
      "Pause for a moment and squeeze your shoulder muscles.",
      "Inhale and slowly lower your arm back down to the starting position.",
      "Repeat for the desired number of repetitions.",
      "Switch sides and perform the exercise with the other arm."
    ],
    "notes": ""
  },
  {
    "pk": 228,
    "name": "Eccentric Chest Press",
    "slug": "eccentric-chest-press",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust a chest press machine's seat height so that the handles are at chest level.",
      "Select the appropriate weight on the weight stack.",
      "Sit on the machine with your back flat against the backrest and your feet flat on the floor.",
      "Grasp the handles with an overhand grip and push them away from your chest with two hands until your arms are fully extended.",
      "Release the handle with your right hand; your right hand bears no weight.",
      "Slowly lower the handles back towards your chest with your left hand, keeping your elbow at a 90-degree angle. Note that this will only work on machines where the two handles are linked to each other and to the weight.",
      "Grasp the handles with both hands. Push to fully extend your arms.",
      "Release the handle with your left hand; your left hand bears no weight.",
      "Slowly lower the handles back towards your chest with your right hand. This marks one repetition.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 229,
    "name": "Squat – Box",
    "slug": "squat-box",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Stand with your feet shoulder-width apart, toes slightly turned out.",
      "Place a box or bench behind you at a height that allows you to squat to parallel or slightly below parallel.",
      "Engage your core and keep your chest lifted throughout the exercise.",
      "Lower your body by pushing your hips back and bending your knees, as if sitting back onto the box.",
      "Keep your weight on your heels and your knees in line with your toes.",
      "Pause briefly on the box, then push through your heels to stand back up, fully extending your hips and knees.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 230,
    "name": "Front Squat",
    "slug": "front-squat",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Load a barbell with weights on a rack at chest height.",
      "Start by standing with your feet shoulder-width apart and your toes slightly turned out.",
      "Hold a barbell across the front of your shoulders, resting it on your collarbone and shoulders. Keep your hands just outside your shoulders, holding the barbell with your palms facing up. Raise your elbows up and forward to create a shelf with your shoulders for the bar to rest on.",
      "Engage your core and keep your chest up as you lower your body down into a squat position.",
      "Bend your knees and push your hips back, keeping your weight in your heels.",
      "Lower your body until your thighs are parallel to the ground, or as low as you can comfortably go.",
      "Push through your heels to stand back up, keeping your core engaged and chest up throughout the movement.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 231,
    "name": "Seated Shoulder Press – Smith Machine",
    "slug": "seated-shoulder-press-smith-machine",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side", "tricep"],
    "steps": [
      "Sit on a back-supporting seat under a Smith Machine with your back straight and feet flat on the floor.",
      "Adjust the height of the barbell on the Smith Machine so that it is at shoulder level.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Engage your core and press the barbell upward until your arms are fully extended, but not locked.",
      "Pause for a moment at the top of the movement, then slowly lower the barbell back down to shoulder level.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 232,
    "name": "Lying Leg Raise",
    "slug": "lying-leg-raise",
    "primaryMuscles": ["abdominal"],
    "secondaryMuscles": ["oblique"],
    "steps": [
      "Lie flat on your back on a mat or bench.",
      "Place your hands by your sides or under your glutes for support.",
      "Keep your legs straight and together, with your toes pointed towards the ceiling.",
      "Engage your core muscles by drawing your belly button towards your spine.",
      "Slowly lift your legs off the ground, keeping them straight, until they are perpendicular to the floor.",
      "Pause for a moment at the top, squeezing your lower abs.",
      "Lower your legs back down to the starting position in a controlled manner.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 233,
    "name": "Eccentric Leg Extension",
    "slug": "eccentric-leg-extension",
    "primaryMuscles": ["quad"],
    "secondaryMuscles": [],
    "steps": [
      "Start by sitting on a leg extension machine with your back against the backrest and your feet flat on the footpad.",
      "Adjust the machine so that the knee joint is aligned with the axis of rotation.",
      "Place your hands on the side handles for stability.",
      "Slowly extend your legs by straightening your knees, pushing against the resistance of the weight stack.",
      "Once your legs are fully extended, pause briefly at the top of the movement.",
      "Withdraw one leg so that the other leg supports all the weight. Slowly lower the weight back down with one leg by bending a knee, resisting the weight as it pulls your legs back towards the starting position.",
      "Continue lowering the weight until your knees are at a 90-degree angle or slightly beyond.",
      "Repeat the movement for the desired number of repetitions then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 234,
    "name": "Power Snatch",
    "slug": "power-snatch",
    "primaryMuscles": ["glute", "lower back"],
    "secondaryMuscles": [
      "forearm - inner",
      "hamstring",
      "quad",
      "thigh - inner",
      "trap"
    ],
    "steps": [
      "Start with feet hip-width apart, toes slightly turned out, with a loaded barbell on the ground in front of you.",
      "Hold the barbell with a wide grip, hands outside the legs.",
      "Bend at the knees and hips, keeping the back straight and chest up.",
      "Explosively extend the hips, knees, and ankles, pulling the barbell upwards.",
      "As the barbell reaches hip level, quickly drop under it by pulling yourself down into a squat position.",
      "Catch the barbell overhead with arms fully extended, in a deep squat position.",
      "Stand up by extending the hips and knees, keeping the barbell overhead.",
      "Lower the barbell back to the starting position by reversing the movement."
    ],
    "notes": ""
  },
  {
    "pk": 235,
    "name": "Half Air Squat",
    "slug": "half-air-squat",
    "primaryMuscles": ["glute", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf"],
    "steps": [
      "Stand with your feet shoulder-width apart, toes pointing slightly outward.",
      "Engage your core and keep your chest lifted throughout the exercise.",
      "Lower your body by bending your knees and pushing your hips back.",
      "Continue lowering until your thighs approach parallel to the ground but do not go any deeper.",
      "Pause for a moment at the bottom of the squat.",
      "Push through your heels and extend your knees and hips to return to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 236,
    "name": "Front Hold – Plate",
    "slug": "front-hold-plate",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["shoulder - side"],
    "steps": [
      "Stand with your feet shoulder-width apart and hold a weight plate with both hands in front of your chest.",
      "Engage your core and keep your back straight.",
      "Extend your arms fully, keeping your arms parallel to the ground.",
      "Hold this position for the desired amount of time."
    ],
    "notes": ""
  },
  {
    "pk": 237,
    "name": "Burpee",
    "slug": "burpee",
    "primaryMuscles": ["chest", "glute", "quad", "shoulder - front"],
    "secondaryMuscles": ["abdominal", "lower back"],
    "steps": [
      "Start in a standing position with your feet shoulder-width apart.",
      "Lower your body into a squat position, placing your hands on the floor in front of you.",
      "Kick your feet back, landing in a plank position with your arms fully extended.",
      "Lower your chest and thighs to the floor, keeping your elbows close to your body.",
      "Push up to return to the plank position.",
      "Jump your feet back towards your hands, landing in a squat position.",
      "Jump up explosively, reaching your arms overhead.",
      "Land softly and immediately lower back into the squat position to begin the next repetition."
    ],
    "notes": ""
  },
  {
    "pk": 238,
    "name": "One-Handed Chest Press – Dumbbell",
    "slug": "one-handed-chest-press-dumbbell",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": [],
    "steps": [
      "Start by lying flat on a bench with your feet firmly planted on the ground.",
      "Hold a dumbbell in one hand, with your palm facing towards your feet.",
      "Extend your arm straight up towards the ceiling, keeping your elbow slightly bent.",
      "Inhale and slowly lower the dumbbell towards your chest, keeping your elbow at a 90-degree angle.",
      "Exhale and push the dumbbell back up to the starting position, fully extending your arm.",
      "Repeat for the desired number of repetitions, then switch to the other hand."
    ],
    "notes": ""
  },
  {
    "pk": 239,
    "name": "Wide Grip Seated Row – Cable",
    "slug": "wide-grip-seated-row-cable",
    "primaryMuscles": ["lat", "shoulder - back", "trap"],
    "secondaryMuscles": ["rotator cuff - back", "rotator cuff - front"],
    "steps": [
      "Adjust the cable machine to a low setting and attach a wide grip handle to the cable.",
      "Sit on the seat with your feet flat on the floor and your knees slightly bent.",
      "Grab the handle with an overhand grip, hands wider than shoulder-width apart.",
      "Keep your back straight and lean slightly forward from the hips.",
      "Pull the handle towards your lower chest, squeezing your shoulder blades together.",
      "Pause for a moment, then slowly extend your arms back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 240,
    "name": "Rope Wave",
    "slug": "rope-wave",
    "primaryMuscles": [
      "bicep",
      "forearm - inner",
      "forearm - outer",
      "shoulder - back",
      "shoulder - front",
      "shoulder - side",
      "trap"
    ],
    "secondaryMuscles": ["abdominal", "chest", "tricep"],
    "steps": [
      "Stand with your feet shoulder-width apart, knees slightly bent, in front of a heavy rope.",
      "Grip the ends of the rope with both hands. Your palms should be facing inward.",
      "Tighten your core to stabilize your spine.",
      "Begin to raise and lower both arms rapidly in unison. The motion should create waves in the rope.",
      "Keep the waves going consistently for the desired number of repetitions."
    ],
    "notes": "Keep your back straight and your head up throughout the exercise."
  },
  {
    "pk": 241,
    "name": "Alternating Rope Wave",
    "slug": "alternating-rope-wave",
    "primaryMuscles": [
      "bicep",
      "forearm - inner",
      "forearm - outer",
      "shoulder - back",
      "shoulder - front",
      "shoulder - side",
      "trap"
    ],
    "secondaryMuscles": ["abdominal", "chest", "tricep"],
    "steps": [
      "Stand with your feet shoulder-width apart, knees slightly bent, in front of a heavy rope.",
      "Grip the ends of the rope with both hands. Your palms should be facing inward.",
      "Tighten your core to stabilize your spine.",
      "Begin to alternately raise and lower each arm rapidly. The motion should create alternating waves in each of the two ropes.",
      "Keep the waves going consistently for the desired number of repetitions."
    ],
    "notes": "Keep your back straight and your head up throughout the exercise."
  },
  {
    "pk": 242,
    "name": "Squat – BOSU",
    "slug": "squat-bosu",
    "primaryMuscles": ["glute", "quad"],
    "secondaryMuscles": ["abdominal", "calf", "hamstring", "thigh - inner"],
    "steps": [
      "Place the BOSU ball on the ground with the flat side down.",
      "Stand on the BOSU ball with your feet shoulder-width apart for stability.",
      "Find your balance and engage your core muscles.",
      "Perform a squat by bending your knees and lowering your hips as if sitting back into a chair, keeping your back straight.",
      "Lower down as far as comfortable. Aim for your thighs to be parallel with the Bosu ball, but you may go lower for increased difficulty.",
      "Press through your heels to lift yourself back up to the starting position.",
      "Repeat the squat for the desired number of repetitions."
    ],
    "notes": "To increase the difficulty, perform the exercise with the BOSU's flat side up."
  },
  {
    "pk": 243,
    "name": "Perfect Hang",
    "slug": "perfect-hang",
    "primaryMuscles": ["forearm - inner", "forearm - outer", "lat"],
    "secondaryMuscles": ["abdominal", "bicep", "chest", "oblique", "trap"],
    "steps": [
      "Grasp a pull-up bar with both hands at shoulder-width apart using an overhand grip.",
      "Hang from the bar with your feet off the ground and your arms fully extended.",
      "Engage your shoulder blades by pulling them back and down to stabilize your shoulders and upper back.",
      "Lean back slightly to bring your chest parallel to the ground and your torso at a 45° angle to the ground.",
      "Curl your legs backwards. Imagine your body as the curve on the letter \"D\" if you were to see yourself from the side.",
      "Breathe deeply and hold the hang for as long as you can manage comfortably, ensuring your shoulder blades remain engaged."
    ],
    "notes": ""
  },
  {
    "pk": 244,
    "name": "Seated Incline Front Raise – Dumbbell",
    "slug": "seated-incline-front-raise-dumbbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["chest", "shoulder - side"],
    "steps": [
      "Sit on an incline bench set at a 45-degree angle, holding a dumbbell in each hand with palms facing each other.",
      "Keep your feet flat on the floor, back against the bench, and chest up.",
      "Start with the dumbbells hanging straight down towards the ground, arms extended.",
      "Raise the dumbbells in front of you, keeping your arms straight, palms facing down, until they are above shoulder height but not so high to take tension off the front shoulder muscle.",
      "Pause briefly at the top of the movement.",
      "Slowly lower the dumbbells back to the starting position.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 245,
    "name": "Prone Incline Front Raise – Dumbbell",
    "slug": "prone-incline-front-raise-dumbbell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": ["chest", "shoulder - side", "trap"],
    "steps": [
      "Set an incline bench to a 45-degree angle and lie face down with your chest against the bench.",
      "Hold a dumbbell in each hand, palms facing your knees, arms extended towards the ground.",
      "Keep the balls of your feet on the ground and your neck in a neutral position. Brace your core and maintain a straight back throughout the exercise.",
      "With your arms straight except for a slight elbow bend, slowly raise the dumbbells until they are above your head, parallel with your upper body.",
      "Pause briefly at the top of the movement.",
      "Slowly lower the dumbbells back to the starting position.",
      "Repeat the movement for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 246,
    "name": "Kickstand Squat – Kettlebell",
    "slug": "kickstand-squat-kettlebell",
    "primaryMuscles": ["glute", "hamstring", "lower back", "quad"],
    "secondaryMuscles": ["abdominal", "calf", "oblique"],
    "steps": [
      "Stand with your feet hip-width apart, holding a kettlebell with both hands in front of your chest.",
      "Shift your weight onto your left foot and place your right foot behind you, resting on the ball of your foot – this is your kickstand position.",
      "Hinge your hips back slightly, ensuring a straight back and engaged core.",
      "Bend at your left knee to lower down into a squat, keeping the weight in your left heel and the kettlebell steady in front of your chest.",
      "Lower down until your left thigh is nearly parallel to the ground, or as low as you can go comfortably.",
      "Drive through your left heel to stand back up to the starting position.",
      "Complete the desired number of repetitions on the left side before switching sides and repeating."
    ],
    "notes": ""
  },
  {
    "pk": 247,
    "name": "One-Handed Shoulder Press – Landmine",
    "slug": "one-handed-shoulder-press-landmine",
    "primaryMuscles": [
      "chest",
      "shoulder - front",
      "shoulder - side",
      "tricep"
    ],
    "secondaryMuscles": [
      "abdominal",
      "oblique",
      "rotator cuff - back",
      "rotator cuff - front",
      "trap"
    ],
    "steps": [
      "Position a barbell securely in a landmine attachment or securely in a corner to prevent it from sliding.",
      "Load the desired weight onto the free end of the barbell.",
      "Stand facing the barbell with your feet shoulder-width apart for stability.",
      "Bend slightly to grab the barbell with one hand directly where the barbell is loaded.",
      "Raise the barbell to your shoulder level, switching your grip so that your hand is under the barbell and your palm faces your chin over a bent and tucked elbow. This is your starting position.",
      "Brace your core, and exhale as you press the barbell upward and slightly forward by extending your arm.",
      "Keep your body straight and avoid rotating your hips or shoulders during the press.",
      "Inhale as you slowly return the barbell to the starting position at your shoulder.",
      "Complete all reps on one side before switching hands to work the opposite side."
    ],
    "notes": ""
  },
  {
    "pk": 248,
    "name": "External Shoulder Rotation – Cable",
    "slug": "external-shoulder-rotation-cable",
    "primaryMuscles": ["rotator cuff - back"],
    "secondaryMuscles": ["forearm - outer", "shoulder - back"],
    "steps": [
      "Stand side-on to a cable machine, with the machine arm set at the middle height. Attach a single handle.",
      "Grab the handle with the hand that's furthest from the machine, ensuring that your elbow is bent at a 90-degree angle.",
      "Step away from the machine so that the weight is lifted slightly from its stack and there is tension on the cable.",
      "Position your elbow so that it is close to your side and holding weight across your abdomen.",
      "Slowly rotate your arm outward, pulling the handle away from the machine while keeping your elbow fixed at your side.",
      "Rotate the arm until the hand as far as possible without releasing tension on your back rotator cuff and without compromising form.",
      "Pause for a moment at the maximum rotation point.",
      "Slowly return the handle to the starting position in a controlled manner without allowing the weight to pull your arm back too fast.",
      "Repeat the exercise for the desired number of reps before switching sides to ensure both back rotator cuffs are worked evenly."
    ],
    "notes": "Keep your feet shoulder-width apart for stable footing and engage your core. Keep your body straight and avoid rotating your hips or shoulders during the movement. Your forearm should be perpendicular to your torso throughout the exercise."
  },
  {
    "pk": 249,
    "name": "Internal Shoulder Rotation – Cable",
    "slug": "internal-shoulder-rotation-cable",
    "primaryMuscles": ["rotator cuff - front"],
    "secondaryMuscles": ["forearm - inner", "shoulder - front"],
    "steps": [
      "Stand side-on to a cable machine, with the machine arm set at the middle height. Attach a single handle.",
      "Grab the handle with the hand that's closest to the machine, ensuring that your elbow is bent at a 90-degree angle.",
      "Step away from the machine so that the weight is lifted slightly from its stack and there is tension on the cable.",
      "Position your elbow so that it is close to your side and your forearm points towards the machine as far as naturally possible.",
      "Slowly rotate your arm inward, pulling the handle away from the machine while keeping your elbow fixed at your side.",
      "Rotate the arm until the hand crosses your abdomen without releasing tension on your front rotator cuff and without compromising form.",
      "Pause for a moment at the maximum rotation point.",
      "Slowly return the handle to the starting position in a controlled manner without allowing the weight to pull your arm back too fast.",
      "Repeat the exercise for the desired number of reps before switching sides to ensure both front rotator cuffs are worked evenly."
    ],
    "notes": "Keep your feet shoulder-width apart for stable footing and engage your core. Keep your body straight and avoid rotating your hips or shoulders during the movement. Your forearm should be perpendicular to your torso throughout the exercise."
  },
  {
    "pk": 250,
    "name": "Pallof Press",
    "slug": "pallof-press",
    "primaryMuscles": ["abdominal", "oblique"],
    "secondaryMuscles": [
      "lower back",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - front",
      "shoulder - side"
    ],
    "steps": [
      "Stand side-on to a cable machine or secure a resistance band at chest height.",
      "Select an appropriate weight if using a cable machine.",
      "Grasp the handle (or end of the band) with both hands and take a step away to create tension.",
      "Position your feet shoulder-width apart for stability.",
      "Hold the handle or band close to your chest, keeping your hands centered in front of you.",
      "Engage your core muscles to stabilize your torso.",
      "Slowly press the handle or band straight out in front of your chest, keeping your arms straight.",
      "Ensure your hips and shoulders stay squared and facing forward throughout the movement.",
      "Hold the fully-pressed position for 1-2 seconds.",
      "Slowly return the handle or band back to your chest with control.",
      "Repeat for the desired number of repetitions.",
      "Switch sides and perform the exercise to work the core muscles evenly."
    ],
    "notes": ""
  },
  {
    "pk": 251,
    "name": "Landmine Rotation",
    "slug": "landmine-rotation",
    "primaryMuscles": ["abdominal", "oblique"],
    "secondaryMuscles": [
      "glute",
      "lower back",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - front",
      "shoulder - side"
    ],
    "steps": [
      "Place one end of a barbell securely into a landmine attachment or a corner to stabilize it.",
      "Stand with your feet shoulder-width apart, facing the end of the barbell, and grab the end of the bar with both hands.",
      "Press the barbell up and hold it in front of your head with your arms extended, while keeping your elbows slightly bent.",
      "Begin to rotate your torso to one side; as you do, allow your hands holding the barbell to drop towards the hip on the same side as the rotation. During the rotation, keep your arms in the same position, extended with elbows bent, as much as possible.",
      "Simultaneously, allow the foot you are rotating away from to rise up to the ball of the foot at the bottom of the rotation, facilitating a full rotation of the hips.",
      "Reverse the direction and rotate your torso to the opposite side, repeating the arm movement and foot pivot to complete one full repetition.",
      "Continue alternating the rotational movements for the desired number of repetitions, maintaining the appropriate arm and foot mechanics throughout."
    ],
    "notes": ""
  },
  {
    "pk": 252,
    "name": "Eccentric Bicep Curl – Machine",
    "slug": "eccentric-bicep-curl-machine",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner", "forearm - outer"],
    "steps": [
      "Select the appropriate weight on the machine and adjust the seat and arm pad to align with your elbow joint.",
      "Grip the handles with your palms facing upward in a supinated position.",
      "Sit or stand (depending on machine design) with your upper arm pressed against the arm pad, back straight, and feet flat on the floor for stability.",
      "Use both arms to lift the weight with a controlled motion, flexing the elbows without swinging the arms or leaning back.",
      "Release the handle with one hand. Your other arm completely controls the weight.",
      "Gradually release the weight back to the starting position, emphasizing the downward movement—this is the eccentric phase—taking 3 to 4 seconds to lower the load.",
      "Make sure to fully extend the arms at the bottom, but avoid locking the elbows.",
      "Grip the handles with both hands and use both arms to lift the weight again.",
      "Release the handle with the other hand.",
      "Gradually release the weight back to the starting position again, focusing on the eccentric phase of a single bicep. This completes one full repetition.",
      "Repeat the movement for the desired number of reps, maintaining good form and controlled speed."
    ],
    "notes": "Keep the tension on the biceps throughout the movement without resting at the bottom."
  },
  {
    "pk": 253,
    "name": "Slam – Medicine Ball",
    "slug": "slam-medicine-ball",
    "primaryMuscles": ["abdominal", "lat", "oblique", "shoulder - front"],
    "secondaryMuscles": [
      "calf",
      "chest",
      "forearm - inner",
      "forearm - outer",
      "glute",
      "hamstring",
      "lower back",
      "quad",
      "tricep"
    ],
    "steps": [
      "Stand with your feet shoulder-width apart, holding a medicine ball in front of you with both hands.",
      "Begin by raising the medicine ball above your head. As you lift the ball, come onto the balls of your feet, elevating your heels to maximize reach.",
      "From this fully extended position, drive your heels down to the ground as you explosively throw the ball onto the ground in front of you with as much force as possible, engaging your abs, shoulders, and arms.",
      "Squat down to pick up the ball after it bounces, keeping your back straight and chest up.",
      "Return to a standing position and lift the ball above your head again, coming onto your toes to prepare for the next slam.",
      "Repeat the sequence for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 254,
    "name": "Rotational Slam – Medicine Ball",
    "slug": "rotational-slam-medicine-ball",
    "primaryMuscles": ["abdominal", "lat", "oblique", "shoulder - front"],
    "secondaryMuscles": [
      "calf",
      "chest",
      "forearm - inner",
      "forearm - outer",
      "glute",
      "hamstring",
      "lower back",
      "quad",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - side",
      "tricep"
    ],
    "steps": [
      "Stand with your feet shoulder-width apart and knees slightly bent, holding the medicine ball with both hands near one hip.",
      "Begin the exercise by lifting the medicine ball in a circular motion on the same side, raising it up and over your head.",
      "Continue the circular motion bringing the ball down with force on the opposite side.",
      "As you bring the ball down, rotate your hips towards the opposite side, pivoting on the toes of one foot, while the other leg bends into a small squat.",
      "Release the medicine ball towards the ground as you near the opposite hip from where you started, channeling maximum force through the slam.",
      "Retrieve the medicine ball, return to the starting position on the opposite hip, and perform the exercise on the other side.",
      "Repeat the exercise for the desired number of repetitions."
    ],
    "notes": "Keep your arms extended, elbows slightly bent, throughout the exercise. Focus on creating big circles with your arms, avoiding the tendency to create smaller, easier circles, close to your chest."
  },
  {
    "pk": 255,
    "name": "Step-Up",
    "slug": "step-up",
    "primaryMuscles": ["glute", "quad"],
    "secondaryMuscles": ["calf", "hamstring", "thigh - inner", "thigh - outer"],
    "steps": [
      "Stand upright with a bench or bench-height platform in front of you, feet hip-width apart.",
      "Place your right foot on the bench, ensuring your entire foot is on the surface.",
      "Press through your right foot to lift your body up onto the bench, bringing your left foot to meet your right foot.",
      "Stand tall on the bench with both feet flat and your core engaged.",
      "Step back down with your left foot, returning to the floor.",
      "Follow by stepping down with your right foot, coming back to the starting position.",
      "Repeat the exercise for the desired number of repetitions before switching to lead with the left foot."
    ],
    "notes": "Hold weight in your hands to increase the exercise's resistance."
  },
  {
    "pk": 256,
    "name": "Box Step-Up",
    "slug": "box-step-up",
    "primaryMuscles": ["glute", "quad"],
    "secondaryMuscles": ["calf", "hamstring", "thigh - inner", "thigh - outer"],
    "steps": [
      "Stand upright with a platform in front of you, feet hip-width apart. The height of the platform marks the difficult of the exercise.",
      "Place your right foot on the platform, ensuring your entire foot is on the surface.",
      "Press through your right foot to lift your body up onto the platform, bringing your left foot to meet your right foot.",
      "Stand tall on the platform with both feet flat and your core engaged.",
      "Step back down with your left foot, returning to the floor.",
      "Follow by stepping down with your right foot, coming back to the starting position.",
      "Repeat the exercise for the desired number of repetitions before switching to lead with the left foot."
    ],
    "notes": "Increase the platform's height to increase the exercise's resistance."
  },
  {
    "pk": 257,
    "name": "Tire Flip",
    "slug": "tire-flip",
    "primaryMuscles": ["glute", "lower back", "quad", "thigh - inner"],
    "secondaryMuscles": ["bicep", "calf", "chest", "shoulder - front", "trap"],
    "steps": [
      "Stand facing the tire with your feet wider than shoulder-width apart, toes pointing slightly outwards to ensure a stable wide-leg squat stance.",
      "Bend at the hips and knees to squat down and grab the bottom of the tire with your fingers underneath and palms facing towards you.",
      "Keep your chest up, back straight, and engage your core to prepare to lift.",
      "Drive through your heels and legs, lifting the tire off the ground using your entire body, especially your glutes, hamstrings, and quads.",
      "Once the tire is lifted, quickly reposition your hands from underneath to a pushing position as the tire reaches knee to waist level.",
      "Extend your hips forward powerfully, and use the momentum to flip the tire over by pushing it away from you.",
      "Follow through with your arms to ensure the tire completes the flip and lands flat.",
      "Reposition your feet as necessary and reset your stance to repeat the process for the desired number of reps."
    ],
    "notes": ""
  },
  {
    "pk": 258,
    "name": "Push-Up – Medicine Ball",
    "slug": "push-up-medicine-ball",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["abdominal", "forearm - inner", "forearm - outer"],
    "steps": [
      "Place a medicine ball on the ground and assume a plank position with your hands placed on the ball directly beneath your chest. Keep your feet together or slightly apart for better stability.",
      "Engage your core and maintain a straight line from your head to your heels, avoiding any sagging or arching in your lower back.",
      "Lower your body towards the ball by bending your elbows, keeping them close to your body. Go as low as you can without compromising your form.",
      "Push through your hands and chest to extend your arms and raise your body back up to the starting position.",
      "Repeat the movement for the desired number of reps, making sure to maintain proper form throughout the set."
    ],
    "notes": ""
  },
  {
    "pk": 259,
    "name": "Rolling Push-Up – Medicine Ball",
    "slug": "rolling-push-up-medicine-ball",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": [
      "abdominal",
      "forearm - inner",
      "forearm - outer",
      "shoulder - side"
    ],
    "steps": [
      "Begin by placing a medicine ball on the floor in front of you.",
      "Assume a push-up position by getting into a plank, with your hands shoulder-width apart and feet extended back.",
      "Position one hand on the center of the medicine ball, while the other remains on the floor, keeping your body straight and core engaged.",
      "Perform a push-up, lowering your chest to the floor while maintaining balance and stability on the ball.",
      "Push back up to the starting position, keeping your body in a straight line.",
      "Carefully roll the medicine ball across to the other hand while remaining in the plank position.",
      "Place your opposite hand on the medicine ball and stabilize your body.",
      "Repeat the push-up with the medicine ball under the other hand.",
      "Continue alternating hands after each push-up for the desired number of repetitions or sets."
    ],
    "notes": ""
  },
  {
    "pk": 260,
    "name": "One-Handed Plank",
    "slug": "one-handed-plank",
    "primaryMuscles": ["abdominal", "shoulder - front"],
    "secondaryMuscles": ["chest", "lower back", "oblique"],
    "steps": [
      "Begin in a standard push-up position with your hands on the ground and elbows aligned below your shoulders, and your body forming a straight line from your head to your heels.",
      "Spread your legs slightly wider than hip-width apart to provide additional stability.",
      "Shift your weight onto your left hand as you slowly lift your right hand off the ground, wrapping it behind your back or under your sternum.",
      "Engage your core, glutes, and thigh muscles to prevent your hips from dropping or rotating.",
      "Hold the one-handed plank for the desired duration, breathing steadily throughout the exercise.",
      "Lower your right hand back to the starting plank position with control.",
      "Repeat the exercise by shifting your weight onto your right hand and wrapping your left hand behind your back or under your sternum."
    ],
    "notes": ""
  },
  {
    "pk": 261,
    "name": "Sled Pull",
    "slug": "sled-pull",
    "primaryMuscles": ["calf", "glute", "hamstring", "quad"],
    "secondaryMuscles": ["abdominal", "lower back"],
    "steps": [
      "Adjust the weight on the sled according to your fitness level and training goals.",
      "If using a pulling harness, strap it on securely, making sure it's comfortably snug. If using straps with handles, grip the handles firmly with both hands.",
      "Stand facing the sled with your feet hip-width apart. Make sure you have a smooth, level, unobstructed path behind you.",
      "Lower into a quarter-squat position, keeping your back straight, and brace your core.",
      "Begin walking backwards slowly, taking small steps while keeping the tension on the harness or handles.",
      "Push through the balls of your feet with each step, focusing on engaging your quadriceps, calves, and glutes.",
      "Keep your chest up and shoulders back throughout the movement to maintain proper posture.",
      "Continue pulling the sled for a number of steps or seconds.",
      "Carefully disengage from the harness or place down the handles."
    ],
    "notes": "Leaning back slightly allows your weight to help move the sled. Avoid leaning too far back, as you can injure yourself or lose benefits of the exercise."
  },
  {
    "pk": 262,
    "name": "Forearm Roll-Up – Barbell",
    "slug": "forearm-roll-up-barbell",
    "primaryMuscles": ["forearm - inner", "forearm - outer"],
    "secondaryMuscles": [],
    "steps": [
      "Set up a power rack placing a barbell at about chest height.",
      "Select a kettlebell and an appropriately sized resistance band that can be looped around it.",
      "Loop one end of the resistance band around the kettlebell securely.",
      "Loop the other end of the resistance band around one end of the barbell securely, wrapping it twice to ensure the kettlebell is suspended and the band is taut.",
      "Stand facing the barbell with your feet shoulder-width apart, positioning yourself slightly back to allow full range of motion for the barbell to roll.",
      "Extend your arms forward and grasp the barbell with both hands using an overhand grip, placing your hands slightly wider than shoulder-width for stability. Place one hand on either side of the band connected to the barbell.",
      "Begin with your right hand, rolling the barbell away from you as much as possible to contract your forearm muscles.",
      "After rolling with your right hand, switch to your left hand and perform the same rolling motion, alternating between hands with each roll.",
      "Continue this alternating pattern, rolling the barbell and lifting the kettlebell until you cannot roll any further or the kettlebell reaches its peak height.",
      "Carefully reverse the rolling motion using alternate hands again to lower the kettlebell back to the starting position in a controlled manner."
    ],
    "notes": ""
  },
  {
    "pk": 263,
    "name": "Forearm Twist – Dumbbell",
    "slug": "forearm-twist-dumbbell",
    "primaryMuscles": ["forearm - inner", "forearm - outer"],
    "secondaryMuscles": ["bicep"],
    "steps": [
      "Stand up straight with your feet shoulder-width apart.",
      "Hold a dumbbell in each hand and let your arms hang down in front of your quads, palms facing forward, with a slight bend in the elbows.",
      "Curl the dumbbells upwards by bending your elbows, stopping when your forearms are parallel to the ground. This is the starting position.",
      "While keeping your upper arms stationary, rotate your wrists to flip the dumbbells towards each other until your palms face down.",
      "Pause for a moment, then rotate your wrists in the opposite direction, turning the dumbbells back to the starting position.",
      "Repeat the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 264,
    "name": "Zottman Curl",
    "slug": "zottman-curl",
    "primaryMuscles": ["bicep", "forearm - inner", "forearm - outer"],
    "secondaryMuscles": [],
    "steps": [
      "Stand up straight with a dumbbell in each hand at arm's length. Keep your elbows close to your torso and palms facing upward.",
      "Without moving your upper arms, curl the weights while contracting your biceps. Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position briefly.",
      "While holding the dumbbells at shoulder height, rotate your wrists until your palms are facing downward.",
      "Keep your upper arms still, exhale, and start to lower the dumbbells back to the starting position with your palms facing downward in a reverse curl motion.",
      "Once you have reached the starting position, rotate your wrists back to the initial palms-up grip.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 265,
    "name": "Z Press – Dumbbell",
    "slug": "z-press-dumbbell",
    "primaryMuscles": ["shoulder - front", "shoulder - side"],
    "secondaryMuscles": [
      "abdominal",
      "lower back",
      "shoulder - back",
      "tricep"
    ],
    "steps": [
      "Sit down on the ground, legs extended in front of you and spaced apart for stability.",
      "Hold a dumbbell in each hand at shoulder height, palms facing forward.",
      "Plant your heels firmly on the ground and brace your core.",
      "Press the dumbbells vertically overhead, fully extending your arms without locking your elbows.",
      "Pause briefly at the top of the movement.",
      "Lower the dumbbells back to the starting position at shoulder height in a controlled manner.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": "Maintain core tension throughout the exercise to prevent arching your back or leaning back too far."
  },
  {
    "pk": 266,
    "name": "Z Press – Barbell",
    "slug": "z-press-barbell",
    "primaryMuscles": ["shoulder - front", "shoulder - side"],
    "secondaryMuscles": [
      "abdominal",
      "lower back",
      "shoulder - back",
      "tricep"
    ],
    "steps": [
      "Position a loaded barbell in a rack a little above knee height.",
      "Sit down on the floor so that the barbell touches your upper chest.",
      "Extend your legs straight in front of you. Ensure your back is straight.",
      "Grip the barbell just outside shoulder width with palms facing forward.",
      "Unrack the barbell so it is positioned in front of your chin with tension on your front shoulders. This is your starting position.",
      "Brace your core. Push your heels into the ground.",
      "Press the barbell upwards until your arms are fully extended, making sure the bar moves in a straight vertical line.",
      "Pause briefly at the top of the movement.",
      "Lower the bar back to the starting position in a controlled manner.",
      "Repeat for the desired number of reps."
    ],
    "notes": "Maintain core tension throughout the exercise to prevent arching your back or leaning back too far."
  },
  {
    "pk": 267,
    "name": "Incline Hex Press – Dumbbell",
    "slug": "incline-hex-press-dumbbell",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["tricep"],
    "steps": [
      "Select two dumbbells of suitable weight and an incline bench set to a 45-degree angle.",
      "Sit on the bench with a dumbbell in each hand, resting them on your thighs.",
      "Kick the weights to shoulder height as you lean back, positioning the dumbbells at chest level with your palms facing each other.",
      "Press the dumbbells up over your chest by extending your arms while actively pushing the dumbbells against one another the entire time.",
      "Pause briefly at the top of the movement, squeezing your chest muscles.",
      "Lower the weights slowly back to the starting position, maintaining control and keeping the dumbbells close together."
    ],
    "notes": "Lower the incline to reduce the load on your shoulders and make the exercise easier."
  },
  {
    "pk": 268,
    "name": "Skull Crusher – Barbell",
    "slug": "skull-crusher-barbell",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Lie down on a flat bench with a barbell in your hands. Your feet should be flat on the floor for stability.",
      "Grip the barbell with an overhand grip (palms facing towards your feet) slightly narrower than shoulder-width apart.",
      "Extend your arms fully so that the barbell is directly above your shoulders. This is your starting position.",
      "Keeping your upper arms stationary, inhale and slowly lower the barbell by bending your elbows until the barbell is just above your forehead.",
      "Pause when the barbell is closest to your forehead, ensuring your elbows are in position and only your forearms are moving.",
      "Exhale and raise the barbell back to the starting position by extending your elbows and contracting the triceps.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 269,
    "name": "Skull Crusher – Dumbbell",
    "slug": "skull-crusher-dumbbell",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Lie on a bench with your knees bent and feet flat on the ground. Hold a dumbbell in each hand directly above your shoulders with your arms fully extended.",
      "With your palms facing each other, engage your core and keep your wrists straight.",
      "Slowly bend your elbows to lower the dumbbells towards the sides of your forehead. Keep your upper arms stationary and elbows pointing straight up throughout the movement.",
      "Lower the weights until your forearms and biceps are at least at a 90-degree angle.",
      "Pause briefly at the bottom of the movement.",
      "Press the dumbbells back up to the starting position by extending your elbows while exhaling. Focus on using your triceps to move the weight.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 270,
    "name": "Overhead Tricep Extension – Machine",
    "slug": "overhead-tricep-extension-machine",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the seat height so your arms comfortably reach the handles with your elbows at a 90-degree angle.",
      "Sit down on the machine bench and grasp the handles with your palms facing each other.",
      "Keep your elbows close to your head and your back flat against the pad throughout the exercise.",
      "Exhale and extend your arms, pushing the handles overhead until your arms are fully extended but not locked.",
      "Pause momentarily at the top of the movement, focusing on contracting your triceps.",
      "Inhale as you slowly lower the handles back to the starting position, maintaining control and tension on the triceps.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 271,
    "name": "In-Out Rope Wave",
    "slug": "in-out-rope-wave",
    "primaryMuscles": [
      "bicep",
      "forearm - inner",
      "forearm - outer",
      "shoulder - back",
      "shoulder - front",
      "shoulder - side",
      "trap"
    ],
    "secondaryMuscles": ["abdominal", "chest", "tricep"],
    "steps": [
      "Stand with your feet shoulder-width apart, facing the anchor point of the battle rope.",
      "Hold one end of the rope in each hand, arms extended in front of you at about waist height.",
      "Begin with a slight bend in your knees, a straight back, and a tight core.",
      "Simultaneously move your arms outward to your sides, creating outward waves with each side of the rope.",
      "Quickly reverse the movement by bringing your arms back toward each other, creating inward waves.",
      "Keep your arms moving in and out quickly, maintaining the rhythm to continuously send waves down the rope.",
      "Ensure your movements are controlled and focused, utilizing your arm, shoulder, and core muscles.",
      "Continue the in-out motion for the desired duration or number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 272,
    "name": "Upright Downward Internal Rotation – Cable",
    "slug": "upright-downward-internal-rotation-cable",
    "primaryMuscles": ["rotator cuff - front"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the pulley on a cable machine to eye-level and attach a handle to it.",
      "Stand facing away from the machine, feet shoulder-width apart.",
      "Grab the handle with one hand, raising your arm so your upper arm is parallel to the ground and your forearm is pointing straight up, creating a 90-degree angle at your elbow.",
      "Brace your core and begin to rotate your hand forward at your shoulder, keeping your upper arm stable and parallel to the ground throughout the movement.",
      "Continue the rotation until your forearm is parallel to the ground, completing the internal rotation.",
      "Complete the desired number of repetitions before switching arms to perform the exercise on the opposite side."
    ],
    "notes": ""
  },
  {
    "pk": 273,
    "name": "Upright Upward External Rotation – Cable",
    "slug": "upright-upward-external-rotation-cable",
    "primaryMuscles": ["rotator cuff - back"],
    "secondaryMuscles": [],
    "steps": [
      "Adjust the pulley on a cable machine to sternum-level and attach a handle to it.",
      "Stand facing the machine, feet shoulder-width apart.",
      "Grab the handle with one hand, palm facing down, keeping your upper arm parallel to the ground and your forearm pointing towards the pulley, also parallel to the ground. This is your starting position.",
      "Begin to rotate your arm at the shoulder, moving your hand upward and backwards, keeping the upper arm stable and parallel to the ground throughout the movement.",
      "Continue the rotation until your forearm is pointing straight up, perpendicular to the ground, maintaining a 90-degree angle at your elbow.",
      "Lower the handle back down to the starting position in a controlled manner.",
      "Complete the desired number of repetitions before switching arms to perform the exercise on the opposite side."
    ],
    "notes": ""
  },
  {
    "pk": 274,
    "name": "Plank Pull Through",
    "slug": "plank-pull-through",
    "primaryMuscles": ["abdominal", "shoulder - front"],
    "secondaryMuscles": ["chest", "lower back", "oblique"],
    "steps": [
      "Start in a high plank position with your hands positioned directly under your shoulders, feet slightly wider than hip-width apart, and a dumbbell or kettlebell placed on the floor on one side of your body at sternum-level.",
      "Reach under your torso with your opposite hand to grab the dumbbell.",
      "Pull the weight across the floor to the other side of your body while keeping your hips as stable as possible.",
      "Place the weight on the floor and return your hand to the starting plank position.",
      "Repeat the movement by reaching with the other hand to pull the dumbbell back to the starting side.",
      "Continue alternating sides for the desired number of reps or time duration."
    ],
    "notes": ""
  },
  {
    "pk": 275,
    "name": "Reverse Curl – Barbell",
    "slug": "reverse-curl-barbell",
    "primaryMuscles": ["forearm - outer"],
    "secondaryMuscles": ["bicep"],
    "steps": [
      "Stand up straight with a shoulder-width grip on the barbell, palms facing down (pronated grip). Keep your elbows close to your torso.",
      "While keeping the upper arms stationary, contract your forearms by raising the bar towards your shoulders, hinging at your elbows. Your forearms should be the only part moving. Keep your wrists straight, focusing on a straight line from your elbow to your knuckles.",
      "Continue to raise the weight until bar is at shoulder level. Hold the forearm-contracting position for a brief pause.",
      "Inhale and slowly begin to lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": "Keep your elbows close to your body and avoid swinging the weight. This is a targetted exercise for a small, specific muscle. If you find yourself flaring your elbows, or using momentum to lift the weight, consider lowering the weight to maintain proper form."
  },
  {
    "pk": 276,
    "name": "Hammer Curl – Cable With Rope",
    "slug": "hammer-curl-cable-with-rope",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - outer"],
    "steps": [
      "Attach a rope to the low pulley of a cable machine.",
      "Stand facing the cable machine with your feet shoulder-width apart and a slight bend in your knees.",
      "Grab each end of the rope with a neutral grip (palms facing each other) and stand up straight. This is your starting position.",
      "Keeping your upper arms stationary, exhale as you curl the weights up towards your shoulders by flexing your biceps. Keep your elbows close to your body.",
      "Pause briefly at the top of the movement, squeezing your biceps.",
      "Inhale as you slowly lower the rope back to the starting position.",
      "Repeat for the desired number of reps."
    ],
    "notes": ""
  },
  {
    "pk": 277,
    "name": "Meadows Row",
    "slug": "meadows-row",
    "primaryMuscles": ["lat", "trap", "shoulder - back"],
    "secondaryMuscles": ["lower back", "rotator cuff - back"],
    "steps": [
      "Place one end of a barbell in a corner to secure it, or use a landmine attachment if available.",
      "Stand next to the barbell so it is to your side, with your feet shoulder-width apart.",
      "Bend your knees slightly and hinge at the hips to lean forward, keeping your back straight.",
      "Grasp the barbell with one hand using an overhand grip, just above the weight plates.",
      "Place your other hand on your thigh or knee for support.",
      "Brace your core and row the barbell towards your armpit, keeping your elbow tucked in.",
      "Squeeze your back muscles at the top of the movement.",
      "Slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions before switching sides."
    ],
    "notes": ""
  },
  {
    "pk": 278,
    "name": "One-Handed High-Cable Row",
    "slug": "one-handed-high-cable-row",
    "primaryMuscles": ["lat"],
    "secondaryMuscles": [
      "bicep",
      "forearm - inner",
      "rotator cuff - back",
      "shoulder - back"
    ],
    "steps": [
      "Adjust the cable machine pulley to a position above your head and attach a single handle.",
      "Stand facing the cable machine with your feet shoulder-width apart.",
      "Grab the handle with one hand, palm facing down.",
      "Step back slightly from the cable machine to create tension on the cable. Stretch your arm out in front of you. This is your starting position.",
      "Pull the handle towards your side, keeping your elbow close to your body. Rotate your palm to face your torso as you pull.",
      "Squeeze your back muscles when your hand is near your torso.",
      "Slowly extend your arm to return the handle to the starting position while controlling the weight.",
      "Repeat for the desired number of repetitions before switching arms."
    ],
    "notes": ""
  },
  {
    "pk": 279,
    "name": "Calf Raise – Leg Press Machine",
    "slug": "calf-raise-leg-press-machine",
    "primaryMuscles": ["calf"],
    "secondaryMuscles": [],
    "steps": [
      "Sit on the leg press machine and position your feet about hip-width apart on the lower part of the platform.",
      "Ensure that only the balls of your feet and your toes are making contact with the platform, with your heels hanging off.",
      "Straighten your legs to release the safety bars of the machine, keeping your knees slightly bent to avoid locking them.",
      "Press through the balls of your feet to push the platform away, raising your heels as high as possible and contracting your calf muscles.",
      "Pause at the top of the movement for a moment to maximize the contraction in the calves.",
      "Slowly lower your heels back below the level of the platform to return to the starting position and stretch your calf muscles.",
      "Repeat for the desired number of reps."
    ],
    "notes": ""
  },
  {
    "pk": 280,
    "name": "One-Handed Leaning Lateral Raise – Dumbbell",
    "slug": "one-handed-leaning-lateral-raise-dumbbell",
    "primaryMuscles": ["shoulder - side"],
    "secondaryMuscles": ["shoulder - front", "oblique"],
    "steps": [
      "Stand with your feet shoulder-width apart and a dumbbell in your left hand.",
      "Slightly lean your right shoulder against a wall or stable structure. Aim for a 60-degree angle between you and the ground.",
      "Keep your back straight and core engaged. This is your starting position.",
      "Slowly lift the dumbbell to the side, keeping your arm slightly bent. Raise it until your left arm is perpendicular with your body.",
      "Pause at the top of the movement, then slowly lower the dumbbell back to the starting position.",
      "Repeat the desired number of repetitions before switching to the other side."
    ],
    "notes": "Ensure not to bend your elbow excessively. Also, avoid leaning with your feet too far from the wall, as this can shift the emphasis from your shoulders to your core muscles, altering the primary focus of the exercise."
  },
  {
    "pk": 281,
    "name": "Horizontal Wood Chop – Cable",
    "slug": "horizontal-wood-chop-cable",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Set up the cable machine by adjusting the cable to just under chest height and attach a handle.",
      "Stand perpendicular to the cable machine with your feet shoulder-width apart, keeping your toes and head angled away from the machine.",
      "Grip the handle with both hands, extending your arms fully. Begin with your upper body twisted so that your arms and the handle are positioned on the side closest to the machine, while your head and toes continue to face away.",
      "Step away from the machine to create enough tension in the cable, ensuring it is taut before you start the exercise.",
      "Rotate your torso while keeping your arms straight, moving the handle in a horizontal motion across your body until your hands are aligned forward, matching the direction of your toes and head.",
      "Keep your core engaged throughout the movement to maintain stability and prevent any rotation in your hips or bending of the arms.",
      "Complete the twisting motion until your arms are fully extended in front of you, parallel to the direction your toes and head are facing.",
      "Slowly and with control, reverse the motion, returning to the twisted starting position while maintaining the alignment of your head and toes facing forward."
    ],
    "notes": ""
  },
  {
    "pk": 282,
    "name": "Single-Leg V-Up",
    "slug": "single-leg-v-up",
    "primaryMuscles": ["abdominal", "oblique"],
    "secondaryMuscles": [],
    "steps": [
      "Lie flat on your back on a mat with your arms extended overhead and your legs fully extended.",
      "Lift one leg towards a 60-degree angle with the floor while simultaneously raising your upper body, reaching your hands towards the raised foot.",
      "Keep both legs straight, with the non-moving leg remaining on the floor.",
      "Contract your abdominals as you lift your body, aiming to touch your toes with your hands.",
      "Hold the V position momentarily, maintaining balance and stability.",
      "Slowly lower your upper body and leg back to the starting position.",
      "Repeat the movement with the other leg, alternating legs with each repetition."
    ],
    "notes": ""
  },
  {
    "pk": 283,
    "name": "Single-Leg Tuck-Up",
    "slug": "single-leg-tuck-up",
    "primaryMuscles": ["abdominal", "oblique"],
    "secondaryMuscles": [],
    "steps": [
      "Start by lying flat on the floor with your arms extended overhead and your legs straight. This is your starting position.",
      "Simultaneously lift one knee towards your chest while crunching upwards, bringing your arms forward to reach past the raised knee towards the foot.",
      "Hold the crunch position briefly, ensuring your core is engaged and your hands are reaching towards the lifting foot.",
      "Slowly lower your arms, upper body, and leg back to the starting position.",
      "Repeat the movement with the opposite leg and alternate sides for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 284,
    "name": "Around the World – Kettlebell",
    "slug": "around-the-world-kettlebell",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal", "shoulder - front", "shoulder - side"],
    "steps": [
      "Hold the kettlebell in front of your body with arms extended and both hands on the handle.",
      "Move the kettlebell around your body; start by passing it to your right hand and move it behind your back.",
      "Receive the kettlebell with your left hand behind your back, and continue moving it around to the left side and back to the front.",
      "Continue this motion for the desired number of repetitions before switching direction."
    ],
    "notes": "Stay stable and centered as possible. Resisting the sway is a big part of the exercise."
  },
  {
    "pk": 285,
    "name": "Lu Raise – Dumbbell",
    "slug": "lu-raise-dumbbell",
    "primaryMuscles": ["shoulder - front", "shoulder - side"],
    "secondaryMuscles": ["rotator cuff - back", "rotator cuff - front", "trap"],
    "steps": [
      "Stand with your feet shoulder-width apart, holding a pair of dumbbells at your sides with your palms facing your body.",
      "Lift the dumbbells laterally with a slight bend in the elbows, rotating your thumbs upwards as the weights ascend.",
      "Continue lifting the weights above your head until your arms are fully extended and your thumbs are pointing towards each other.",
      "Pause briefly at the top of the movement.",
      "Lower the dumbbells back to the starting position in a controlled manner, reversing the thumb rotation."
    ],
    "notes": ""
  },
  {
    "pk": 286,
    "name": "Standing External Shoulder Rotation – Dumbbell",
    "slug": "standing-external-shoulder-rotation-dumbbell",
    "primaryMuscles": ["rotator cuff - back"],
    "secondaryMuscles": [
      "rotator cuff - front",
      "shoulder - back",
      "shoulder - front",
      "shoulder - side"
    ],
    "steps": [
      "Stand with feet shoulder-width apart, holding a dumbbell in one hand.",
      "Bend the arm at the shoulder to raise your upper arm, making it parallel to the floor and perpendicular to your body.",
      "Bend your forearm at the elbow to a 90-degree angle so that your forearm is parallel to the floor, creating an 'L' shape with your arm. This is the starting position.",
      "Keeping your upper arm stationary, rotate your shoulder, lifting the dumbbell towards the ceiling as far as possible without discomfort.",
      "Pause briefly at the top of the rotation, then slowly return the dumbbell to the starting position.",
      "Complete the desired number of repetitions, then switch arms and repeat the exercise."
    ],
    "notes": ""
  },
  {
    "pk": 287,
    "name": "Crush Grip Curl – Dumbbell",
    "slug": "crush-grip-curl-dumbbell",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner", "forearm - outer"],
    "steps": [
      "Select a single dumbbell and grip it with both hands, one on each end, pressing your palms against the sides of the dumbbell.",
      "Position yourself straight-armed on a preacher curl bench, ensuring that your elbows and upper arms are comfortably resting against the bench pad. This is your starting position.",
      "Keep pressing your hands together firmly to maintain a 'crush grip' on the dumbbell throughout the exercise.",
      "While maintaining the grip, exhale and curl the dumbbell upwards towards your shoulders, focusing on contracting the biceps.",
      "Hold the contraction briefly at the top of the movement, then inhale and slowly lower the dumbbell back to the starting position.",
      "Repeat the curl for the desired number of repetitions, ensuring the crush grip is maintained throughout each curl."
    ],
    "notes": ""
  },
  {
    "pk": 288,
    "name": "One-Handed Hammer Curl – Dumbbell",
    "slug": "one-handed-hammer-curl-dumbbell",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner", "forearm - outer"],
    "steps": [
      "Select a dumbbell of appropriate weight and position yourself at a preacher curl bench.",
      "Stand with one foot forward and the other back in a staggered stance.",
      "Lean slightly forward from the hips and place the back of your upper arm (of the arm that will be curling) on the sloped part of the preacher bench, ensuring your shoulders are open to the side.",
      "Grasp the dumbbell with a neutral grip (palm facing the wall) and fully extend your arm downwards. This is your starting position.",
      "Brace your core and curl the dumbbell upwards toward your shoulder, keeping the wrist stable and in a neutral position throughout the movement.",
      "Pause briefly at the top of the curl to contract the bicep, then slowly lower the dumbbell back to the starting position, controlling the weight as it descends.",
      "Complete the desired number of repetitions before switching arms."
    ],
    "notes": ""
  },
  {
    "pk": 289,
    "name": "One-Handed Hammer Isometric Hold – Dumbbell",
    "slug": "one-handed-hammer-isometric-hold-dumbbell",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner", "forearm - outer"],
    "steps": [
      "Select a dumbbell of appropriate weight and position yourself at a preacher curl bench.",
      "Stand with one foot forward and the other back in a staggered stance.",
      "Lean slightly forward from the hips and place the back of your upper arm (of the arm that will be curling) on the sloped part of the preacher bench, ensuring your shoulders are open to the side.",
      "Curl your arm up to achieve a 90-degree angle at the elbow. Your forearm should be roughly perpendicular to the floor.",
      "Hold the dumbbell at this angle, maintain the position firmly and ensure the muscle is under constant tension without movement for the desired time period.",
      "Once the hold is complete, slowly lower the dumbbell back to the starting position in a controlled manner.",
      "Repeat the process using the other arm."
    ],
    "notes": "Ensure that your wrist remains straight and stable throughout the duration of the exercise."
  },
  {
    "pk": 290,
    "name": "Hanging Side-To-Side Knee Drive",
    "slug": "hanging-side-to-side-knee-drive",
    "primaryMuscles": ["abdominal", "bicep", "lat", "oblique"],
    "secondaryMuscles": ["forearm - inner", "forearm - outer"],
    "steps": [
      "Grip the pull-up bar with a supinated grip (palms facing you) and arms fully extended.",
      "Pull yourself up to a halfway pull-up until your upper arms are parallel to the floor. This is the starting position.",
      "Start by cycle your knees towards your chest in a bicycle motion straight in front of you.",
      "Continue the cycling motion as you rotate your hips to the right, then the left, going as far as you can while maintaining the half pull-up. This is one repetition.",
      "Repeat the bicycle and rotating motions for the desired number of repetitions or seconds before lowering yourself to the ground."
    ],
    "notes": ""
  },
  {
    "pk": 291,
    "name": "Low Chest Fly – Cable",
    "slug": "low-chest-fly-cable",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["rotator cuff - front", "shoulder - front"],
    "steps": [
      "Attach single handle grips to the low pulleys on both sides of a cable machine.",
      "Set the weight on the stack to an appropriate level.",
      "Grab the handles with your palms facing forwards, and slightly bend your elbows.",
      "Stand in the middle of the cable machine and take one step forward so you're in a staggered stance.",
      "Lean slightly forward at your hips, keeping your back straight and core engaged.",
      "Start with your arms down towards the ground as low as the gripped cables allow. This is the starting position.",
      "Pull the handles together in a wide, upward arc until your hands meet in front of your chest.",
      "Squeeze your chest muscles and hold the contraction briefly.",
      "Slowly return your arms back to the starting position maintaining the slight bend in the elbows.",
      "Repeat the exercise for the desired number of repetitions."
    ],
    "notes": "Focus on moving the cables with your chest muscles. Avoid creating momentum with other parts of your body."
  },
  {
    "pk": 292,
    "name": "Lateral Lunge – Dumbbell",
    "slug": "lateral-lunge-dumbbell",
    "primaryMuscles": ["glute", "quad", "thigh - inner", "thigh - outer"],
    "secondaryMuscles": ["calf", "hamstring"],
    "steps": [
      "Stand with your feet hip-width apart, holding a dumbbell in each hand at your sides. This is the starting position.",
      "Take a big step out to the right, ensuring your toes on both feet are pointing forward.",
      "Shift your weight over your right leg, hinging at the hip and pushing your buttocks back while bending the right knee. Keep the left leg straight.",
      "Keep your back straight and chest up as you lunge, lowering until your right thigh is parallel to the floor. The dumbbells will lower with your arms on either side of your right calf.",
      "Push off your right foot to return to the starting position.",
      "Repeat for the desired number of repetitions before switching to the left side."
    ],
    "notes": ""
  },
  {
    "pk": 293,
    "name": "Single-Arm Bottoms-Up Overhead Press – Kettlebell",
    "slug": "single-arm-bottoms-up-overhead-press-kettlebell",
    "primaryMuscles": ["shoulder - front"],
    "secondaryMuscles": [
      "forearm - inner",
      "forearm - outer",
      "shoulder - side",
      "tricep"
    ],
    "steps": [
      "Stand with feet shoulder-width apart holding a kettlebell bottoms-up in one hand at shoulder height.",
      "Engage your core and make sure your wrist is straight and aligned directly under the kettlebell.",
      "Press the kettlebell overhead by extending your arm fully while keeping the bottom of the kettlebell facing up.",
      "Maintain a stable and upright position without leaning backward or sideways.",
      "Slowly lower the kettlebell back to shoulder height, keeping control of the movement.",
      "Repeat for desired number of reps, then switch to the other arm."
    ],
    "notes": ""
  },
  {
    "pk": 294,
    "name": "Close-Grip Incline Bench Press – Dumbbell",
    "slug": "close-grip-incline-bench-press-dumbbell",
    "primaryMuscles": ["chest", "tricep"],
    "secondaryMuscles": ["shoulder - front"],
    "steps": [
      "Set the incline bench to a 30-45 degree angle.",
      "Grab a pair of dumbbells with a neutral grip and sit on the bench.",
      "Lie back on the bench, positioning the dumbbells at shoulder width with palms facing each other.",
      "Engage your core and firmly plant your feet on the ground.",
      "Press the dumbbells above your chest until your arms are fully extended, making sure they are close to each other without touching.",
      "Slowly lower the dumbbells back to the starting position just above your chest.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": "Lower the incline to reduce the load on your shoulders and move it to your chest."
  },
  {
    "pk": 295,
    "name": "Copenhagen Plank with Leg Lift",
    "slug": "copenhagen-plank-with-leg-lift",
    "primaryMuscles": ["oblique", "thigh - inner"],
    "secondaryMuscles": ["abdominal", "glute", "hamstring", "quad"],
    "steps": [
      "Begin by positioning yourself on your side, propped up on your forearm and elbow directly beneath your shoulder.",
      "Extend your legs straight out with your top foot resting on a bench or elevated surface.",
      "Align your body in a straight line from head to heels, engaging your core and glutes.",
      "Lift your lower leg up and down without rotating your hips or losing alignment.",
      "Maintain a strong core throughout the movement to keep your hips elevated and stable.",
      "Repeat for desired number of reps, then switch to the other side."
    ],
    "notes": ""
  },
  {
    "pk": 296,
    "name": "Alternating Z Press – Double Kettlebell",
    "slug": "alternating-z-press-double-kettlebell",
    "primaryMuscles": ["shoulder - front", "shoulder - side"],
    "secondaryMuscles": [
      "abdominal",
      "lower back",
      "shoulder - back",
      "tricep"
    ],
    "steps": [
      "Select two kettlebells of appropriate weight.",
      "Sit on the floor with legs extended in front of you.",
      "Clean the kettlebells to the front rack position.",
      "Engage your core and ensure your spine is neutral.",
      "Press one kettlebell overhead while keeping the other in the front rack position.",
      "Lower the overhead kettlebell back to the front rack position.",
      "Simultaneously press the other kettlebell overhead.",
      "Continue to alternate pressing each kettlebell, creating a 'seesaw' motion.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": "Maintain core tension throughout the exercise to prevent arching your back or leaning back too far."
  },
  {
    "pk": 297,
    "name": "Feet-Elevated Bulgarian Row – Ring",
    "slug": "feet-elevated-bulgarian-row-ring",
    "primaryMuscles": ["bicep", "lat"],
    "secondaryMuscles": [
      "forearm - inner",
      "forearm - outer",
      "shoulder - back",
      "trap"
    ],
    "steps": [
      "Set the gymnastic rings to a suitable height, typically about waist height.",
      "Place a bench or elevated surface in front of you. The top of the surface should be about an arms-length lower than the rings.",
      "Hold onto the rings with an overhand grip and walk your feet forward to place them on the surface.",
      "Hang from the rings with your arms straight, creating a straight line from your feet to your shoulders that is parallel with the floor. This is your starting position.",
      "With your arms extended, pull yourself upwards by bending your elbows and drawing your chest towards the rings.",
      "Squeeze your shoulder blades together at the top of the movement, keeping your body stable.",
      "Slowly extend your arms to lower yourself back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 298,
    "name": "Alternating Arnold Press – Dumbbell",
    "slug": "alternating-arnold-press-dumbbell",
    "primaryMuscles": ["shoulder - front", "shoulder - side"],
    "secondaryMuscles": ["bicep", "rotator cuff - front", "tricep"],
    "steps": [
      "Begin standing with your feet shoulder-width apart, holding a dumbbell in each hand in front of each shoulder, palms facing your body. This is your starting position.",
      "Rotate your wrists as you press one dumbbell overhead, turning the palm away from your body during the movement.",
      "Simultaneously maintain the starting position with the other arm, keeping the dumbbell at shoulder height and palm facing your body.",
      "Fully extend the pressing arm until it is straight overhead.",
      "Lower the dumbbell back to the starting position, rotating the wrist back to the starting position.",
      "Immediately rotate the alternate hand’s wrist, pressing the other dumbbell overhead with the same motion.",
      "Continue alternating the press between each arm for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 299,
    "name": "Feet-Elevated Oblique Crunch – Stability Ball",
    "slug": "feet-elevated-oblique-crunch-stability-ball",
    "primaryMuscles": ["oblique"],
    "secondaryMuscles": ["abdominal"],
    "steps": [
      "Begin by lying on your back on the ground with your feet and calves resting on a stability ball placed by your glutes. This is the starting position.",
      "Place your arms crossed over your chest or hands behind your ears, ensuring not to pull on your head or neck.",
      "Engage your core muscles and rotate your right shoulder towards your left knee. Lift your shoulder as high as you can while keeping your lower back connected to the ground. Focus on contracting your right oblique muscles.",
      "Hold the position briefly at the top of the movement while squeezing your obliques.",
      "Lower your torso back down to the starting position in a controlled manner.",
      "Continue alternating crunches on each side for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 300,
    "name": "Nordic Hamstring Curl",
    "slug": "nordic-hamstring-curl",
    "primaryMuscles": ["hamstring"],
    "secondaryMuscles": ["calf", "glute", "lower back"],
    "steps": [
      "Kneel on a padded surface, with your body upright and legs bent at a 90-degree angle at the knees.",
      "Secure your lower legs or ankles under a sturdy object, or have a partner hold them down.",
      "Cross your arms over your chest or place your hands on your thighs.",
      "Engage your core and glutes to keep your body straight from your knees to your head.",
      "Slowly lower your upper body towards the ground by extending your knees, keeping your torso straight.",
      "Descend as far as you can control, ideally until your body is nearly parallel to the floor.",
      "Use your hamstrings to pull your body back up to the starting position."
    ],
    "notes": ""
  },
  {
    "pk": 301,
    "name": "Kneeling Cuban Rotation – Barbell",
    "slug": "kneeling-cuban-rotation-barbell",
    "primaryMuscles": ["rotator cuff - back", "rotator cuff - front"],
    "secondaryMuscles": ["forearm - outer", "shoulder - side"],
    "steps": [
      "Start in a tall kneeling position with your knees hip-width apart and your torso upright.",
      "Hold a barbell with a wide, pronated grip (palms facing forward) in both hands over your head.",
      "Lower the barbell towards your head by bending your elbows until your upper arms are parallel to the ground and your forearms are perpendicular to the ground. This is your starting position.",
      "Slowly lower the barbell by rotating your shoulders forward, keeping your elbows as stationary as possible.",
      "Pause briefly when your forearms have rotated parallel to the ground.",
      "Rotate your shoulders backwards, slowly raising the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": "Imagine that your upper arms are resting on a shelf as you perform the movement to focus the effort on your rotator cuffs."
  },
  {
    "pk": 302,
    "name": "Single-Arm Hang – Rings",
    "slug": "single-arm-hang-rings",
    "primaryMuscles": ["forearm - inner", "forearm - outer", "lat"],
    "secondaryMuscles": [
      "bicep",
      "oblique",
      "rotator cuff - back",
      "shoulder - side",
      "trap"
    ],
    "steps": [
      "Locate a ring that is securely anchored and can support your weight. Adjust the ring to a height where you can comfortably reach it while keeping your feet off the ground.",
      "Stand beneath the ring and reach up with one hand to grip it tightly. Lift your feet off the ground and let your body hang freely, maintaining a straight posture.",
      "Focus on holding the position while keeping your shoulder activated and core engaged, avoiding any twisting or rotating.",
      "Hold for the desired amount of time or for as long as you can maintain proper form before safely lowering yourself."
    ],
    "notes": ""
  },
  {
    "pk": 303,
    "name": "Single-Arm Front Rack Contralateral Walking Lunge – Kettlebell",
    "slug": "single-arm-front-rack-contralateral-walking-lunge-kettlebell",
    "primaryMuscles": ["glute", "quad"],
    "secondaryMuscles": [
      "abdominal",
      "calf",
      "oblique",
      "shoulder - front",
      "trap"
    ],
    "steps": [
      "Start standing with feet hip-width apart and a kettlebell in your right hand in a front rack position, resting the kettlebell on the back of your forearm with your elbow close to the body. This is your starting position.",
      "Engage your core and brace your body, maintaining a neutral spine throughout the movement.",
      "Step your left foot forward into a lunge position, ensuring your knee is aligned with your toe and creating a 90-degree angle at the knee joint.",
      "Lower your right knee toward the ground without letting it touch, keeping your front knee stacked over your ankle.",
      "Press through your left heel to return to the starting position, keeping the kettlebell stable in the front rack position.",
      "Repeat for the desired number of repetitions walking forward with your left foot.",
      "Switch sides to complete the same number of repetitions, holding the kettlebell with your left hand and walking forward with your right foot."
    ],
    "notes": ""
  },
  {
    "pk": 304,
    "name": "Front Rack Knee Over Toe Split Squat – Dumbbell",
    "slug": "front-rack-knee-over-toe-split-squat-dumbbell",
    "primaryMuscles": ["glute", "hamstring", "quad"],
    "secondaryMuscles": ["calf", "shoulder - front"],
    "steps": [
      "Select an appropriate pair of dumbbells and hold one in each hand.",
      "Clean the dumbbells to the front rack position, resting one end of each dumbbell on your shoulders with your elbows pointed forward and your palms facing each other.",
      "Position your feet in a split stance with one leg forward and the other leg behind you.",
      "Align your front knee with your second to fourth toes, ensuring your knee travels over your toes throughout the movement.",
      "Engage your core to maintain an upright torso and stabilize your position. This is your starting position.",
      "Lower your body by bending both knees, ensuring the front knee tracks over the toes and the back knee approaches the ground.",
      "Descend until the back knee is just above the ground and the front thigh is parallel to the floor.",
      "Press through the heel of your front foot to return to the starting position.",
      "Repeat the movement for the desired number of repetitions and then switch legs."
    ],
    "notes": ""
  },
  {
    "pk": 305,
    "name": "Single-Arm Bulgarian Split Squat – Dumbbell",
    "slug": "single-arm-bulgarian-split-squat-dumbbell",
    "primaryMuscles": ["glute", "hamstring", "quad"],
    "secondaryMuscles": ["abdominal", "calf", "oblique"],
    "steps": [
      "Stand a few feet in front of a bench with your back towards it.",
      "Hold a dumbbell in one hand on the same side as the working leg.",
      "Extend your opposite leg back and place the top of your foot on the bench.",
      "Keep your chest upright and core engaged throughout the movement.",
      "Slowly lower your hips by bending the knee of the working leg.",
      "Continue lowering until your front thigh is parallel to the ground.",
      "Push through the heel of your front foot to return to the starting position.",
      "Repeat for the desired number of repetitions before switching sides."
    ],
    "notes": ""
  },
  {
    "pk": 306,
    "name": "Single-Leg Romanian Deadlift – Landmine",
    "slug": "single-leg-romanian-deadlift-landmine",
    "primaryMuscles": ["glute", "hamstring"],
    "secondaryMuscles": ["abdominal", "calf", "lower back", "oblique", "quad"],
    "steps": [
      "Stand with your right side facing the end of a barbell secured in a landmine attachment, holding the bar with your right hand using a pronated (overhand) grip. The end of the barbell should be at arms-length in front of your quad. This is your starting position.",
      "Shift your weight onto your left leg, keeping a slight bend in the knee of your standing leg.",
      "Hinge at your hips and lean forward, extending your right leg straight back for balance.",
      "Lower the barbell toward the floor while keeping your back straight and core engaged, ensuring your hips remain square.",
      "Continue lowering until you feel a stretch in the hamstring of the standing leg or your upper body is nearly parallel to the floor.",
      "Drive through the heel of the standing leg to return to the starting position, engaging your glutes as you stand.",
      "Keep your gaze forward and chest lifted throughout the movement to maintain a flat back.",
      "Repeat for the desired number of reps before switching to the opposite leg."
    ],
    "notes": ""
  },
  {
    "pk": 307,
    "name": "Bench Press – Machine",
    "slug": "bench-press-machine",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["rotator cuff - front"],
    "steps": [
      "Adjust the bench and seat height so that your chest aligns with the bench press machine's handles and your feet are flat on the floor.",
      "Select the appropriate weight on the weight stack.",
      "Sit on the machine with your back flat against the back pad.",
      "Grasp the handles with a firm grip, keeping your wrists straight. This is the starting position.",
      "Press the handles away from your chest, keeping your elbows at about a 45-degree angle from your body, extending your arms fully without locking your elbows.",
      "Pause briefly at the top of the press.",
      "Slowly lower the handles back to the starting position, maintaining control throughout the movement.",
      "Repeat the press for the desired number of repetitions."
    ],
    "notes": "Ensure your back is flat against the bench, and your feet are firmly planted on the ground.  Keep your core tight. Exhale as you push the bar away from your chest, and inhale as you lower it down."
  },
  {
    "pk": 308,
    "name": "Incline Bench Press – Machine",
    "slug": "incline-bench-press-machine",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["rotator cuff - front"],
    "steps": [
      "Adjust the bench and seat height so that your chest aligns with the incline bench press machine's handles and your feet are flat on the floor.",
      "Select the appropriate weight on the weight stack.",
      "Sit on the machine with your back flat against the back pad.",
      "Grasp the handles with a firm grip, keeping your wrists straight. This is the starting position.",
      "Press the handles away from your chest, keeping your elbows at about a 45-degree angle from your body, extending your arms fully without locking your elbows.",
      "Pause briefly at the top of the press.",
      "Slowly lower the handles back to the starting position, maintaining control throughout the movement.",
      "Repeat the press for the desired number of repetitions."
    ],
    "notes": "Ensure your back is flat against the bench, and your feet are firmly planted on the ground.  Keep your core tight. Exhale as you push the bar away from your chest, and inhale as you lower it down."
  },
  {
    "pk": 309,
    "name": "Decline Bench Press – Machine",
    "slug": "decline-bench-press-machine",
    "primaryMuscles": ["chest", "shoulder - front", "tricep"],
    "secondaryMuscles": ["rotator cuff - front"],
    "steps": [
      "Adjust the bench and seat height so that your chest aligns with the decline bench press machine's handles and your feet are flat on the floor.",
      "Select the appropriate weight on the weight stack.",
      "Sit on the machine with your back flat against the back pad.",
      "Grasp the handles with a firm grip, keeping your wrists straight. This is the starting position.",
      "Press the handles away from your chest, keeping your elbows at about a 45-degree angle from your body, extending your arms fully without locking your elbows.",
      "Pause briefly at the top of the press.",
      "Slowly lower the handles back to the starting position, maintaining control throughout the movement.",
      "Repeat the press for the desired number of repetitions."
    ],
    "notes": "Ensure your back is flat against the bench, and your feet are firmly planted on the ground.  Keep your core tight. Exhale as you push the bar away from your chest, and inhale as you lower it down."
  },
  {
    "pk": 310,
    "name": "One-Handed Overhead Contralateral Step-Up – Dumbbell",
    "slug": "one-handed-overhead-contralateral-step-up-dumbbell",
    "primaryMuscles": ["glute", "quad"],
    "secondaryMuscles": [
      "abdominal",
      "calf",
      "hamstring",
      "oblique",
      "shoulder - front"
    ],
    "steps": [
      "Stand in front of a step or bench with feet hip-width apart and a dumbbell in one hand.",
      "Press the dumbbell overhead with the arm fully extended, keeping the core engaged.",
      "Place the opposite foot on the step, ensuring the entire foot is on the platform.",
      "Push through the heel of the foot on the step to lift your body up, while keeping the dumbbell arm extended overhead.",
      "Bring the trailing leg up to join the lead on the step, achieving a balanced position.",
      "Carefully step back down with the trailing leg first, followed by the lead leg.",
      "Maintain control and balance throughout the movement, keeping the dumbbell overhead.",
      "Repeat for desired reps, then switch arms and legs."
    ],
    "notes": ""
  },
  {
    "pk": 311,
    "name": "Sumo Squat – Dumbbell",
    "slug": "sumo-squat-dumbbell",
    "primaryMuscles": ["glute", "hamstring", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf", "lower back"],
    "steps": [
      "Hold a dumbbell in front of your chest with both hands.",
      "Stand with your feet wider than shoulder-width apart and toes pointed out at about a 45-degree angle.",
      "Keep your chest up, back straight, and weight primarily on your heels. This is your starting position.",
      "Bend your knees, keeping them in line with your toes, while lowerering your hips down until your thighs are at least parallel to the floor.",
      "Push through your heels to extend your legs and return to the starting position."
    ],
    "notes": ""
  },
  {
    "pk": 312,
    "name": "Sumo Squat – Barbell",
    "slug": "sumo-squat-barbell",
    "primaryMuscles": ["glute", "hamstring", "quad", "thigh - inner"],
    "secondaryMuscles": ["calf", "lower back"],
    "steps": [
      "Hold a barbell behind your neck, resting it on your shoulders with your elbows pointing down and your palms facing forward.",
      "Stand with your feet wider than shoulder-width apart and toes pointed out at about a 45-degree angle.",
      "Keep your chest up, back straight, and weight primarily on your heels. This is your starting position.",
      "Bend your knees, keeping them in line with your toes, while lowerering your hips down until your thighs are at least parallel to the floor.",
      "Push through your heels to extend your legs and return to the starting position."
    ],
    "notes": ""
  },
  {
    "pk": 313,
    "name": "One-Handed Suitcase Walking Lunge – Dumbbell",
    "slug": "one-handed-suitcase-walking-lunge-dumbbell",
    "primaryMuscles": ["glute", "hamstring", "quad"],
    "secondaryMuscles": [
      "abdominal",
      "calf",
      "forearm - inner",
      "forearm - outer",
      "lower back",
      "oblique",
      "trap"
    ],
    "steps": [
      "Stand upright with feet shoulder-width apart while holding a dumbbell in one hand by your side, similar to carrying a suitcase.",
      "Keep your chest up, shoulders back, and core engaged.",
      "Step forward with one leg into a lunge position, ensuring your front knee is directly above your ankle and your back knee is hovering just above the ground.",
      "Push through the heel of your front foot to bring your back leg forward into the starting position, keeping the dumbbell steady by your side.",
      "Continue the lunge by stepping forward with the opposite leg, maintaining balance and proper form.",
      "Repeat the walking lunge series for the desired number of repetitions or distance while keeping the dumbbell in the same hand.",
      "Switch the dumbbell to the other hand and repeat for balance after completing the set with one side."
    ],
    "notes": ""
  },
  {
    "pk": 314,
    "name": "One-Handed Standing Chest Fly – Cable",
    "slug": "one-handed-standing-chest-fly-cable",
    "primaryMuscles": ["chest", "shoulder - front"],
    "secondaryMuscles": ["abdominal", "oblique", "rotator cuff - front"],
    "steps": [
      "Adjust the cable machine pulley to shoulder height and attach a single handle.",
      "Stand with your side facing the cable machine and grab the handle with your nearest hand.",
      "Step away from the machine to create tension on the cable, feet shoulder-width apart and knees slightly bent for stability.",
      "Straighten your arm with a slight bend in the elbow, positioning it parallel to the floor.",
      "Brace your core and keep your hips and shoulders squared forward. This is your starting position.",
      "Pull the handle just across your sternum, allowing your chest muscles to fully contract while keeping your arm slightly bent.",
      "Slowly return the handle to the starting position while controlling the resistance.",
      "Complete the desired number of repetitions and then switch sides."
    ],
    "notes": ""
  },
  {
    "pk": 315,
    "name": "Kneeling Pallof Press",
    "slug": "kneeling-pallof-press",
    "primaryMuscles": ["abdominal", "oblique"],
    "secondaryMuscles": [
      "lower back",
      "rotator cuff - back",
      "rotator cuff - front",
      "shoulder - front",
      "shoulder - side"
    ],
    "steps": [
      "Kneel side-on to a cable machine or secure a resistance band at chest height.",
      "Grasp the handle (or end of the band) with both hands and take a kneeling step away to create tension.",
      "Position your knees shoulder-width apart for stability.",
      "Hold the handle or band close to your chest, keeping your hands centered in front of you.",
      "Engage your core muscles to stabilize your torso. This is your starting position.",
      "Slowly press the handle or band straight out in front of your chest, keeping your arms straight.",
      "Ensure your hips and shoulders stay squared and facing forward throughout the movement.",
      "Hold the fully-pressed position for 1-2 seconds.",
      "Slowly return the handle or band back to the starting position with control.",
      "Repeat for the desired number of repetitions.",
      "Switch sides and perform the exercise to work the core muscles evenly."
    ],
    "notes": ""
  },
  {
    "pk": 316,
    "name": "Isometric Pull-Up Hold",
    "slug": "isometric-pull-up-hold",
    "primaryMuscles": [
      "forearm - inner",
      "forearm - outer",
      "lat",
      "shoulder - back",
      "trap"
    ],
    "secondaryMuscles": ["abdominal", "bicep", "lower back", "oblique"],
    "steps": [
      "Grasp the pull-up bar with an overhand grip slightly wider than shoulder-width apart.",
      "Jump up or use a step to get into the top position of a pull-up with your chin above the bar.",
      "Hold your body up with your chin above the bar, ensuring your core is tight and legs straight.",
      "Keep your elbows bent and close to your body to engage the back muscles effectively.",
      "Maintain the position as long as possible while breathing steadily."
    ],
    "notes": ""
  },
  {
    "pk": 317,
    "name": "Jump Squat – Bodyweight",
    "slug": "jump-squat-bodyweight",
    "primaryMuscles": ["calf", "glute", "hamstring", "quad"],
    "secondaryMuscles": ["abdominal", "lower back"],
    "steps": [
      "Stand with feet shoulder-width apart, toes slightly pointing outward, knees slightly bent.",
      "Engage your core and keep your chest up. This is your starting position.",
      "Lower your body into a squat, bending at the hips and knees until your thighs are parallel to the ground.",
      "Ensure your knees do not extend past your toes.",
      "Keep weight distributed evenly across your feet.",
      "Once at the bottom of the squat, explosively push through your feet to jump upward.",
      "Swing your arms downward to gain momentum.",
      "Land softly, with knees slightly bent, returning to the starting position.",
      "Repeat the jump squat for desired repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 318,
    "name": "Quadruped Hip Extension",
    "slug": "quadruped-hip-extension",
    "primaryMuscles": ["glute", "hamstring"],
    "secondaryMuscles": ["lower back", "abdominal"],
    "steps": [
      "Begin on your hands and knees in the quadruped position with hands under shoulders and knees under hips.",
      "Engage your core and maintain a neutral spine throughout the exercise. This is your starting position.",
      "Maintaining a bent knee, squeeze your glute and extend one foot towards the ceiling. Imagine placing your foot flat on the ceiling.",
      "Squeeze your glutes at the top of the movement.",
      "Lower the leg back to the starting position without touching the ground.",
      "Perform the desired repetitions on one side before switching to the other leg."
    ],
    "notes": "Placing a band around both knees is a good way to add resistance to this exercise."
  },
  {
    "pk": 319,
    "name": "Single-Arm Front Rack Walking Lunge – Dumbbell",
    "slug": "single-arm-front-rack-walking-lunge-dumbbell",
    "primaryMuscles": ["glute", "quad"],
    "secondaryMuscles": [
      "abdominal",
      "calf",
      "oblique",
      "shoulder - front",
      "trap"
    ],
    "steps": [
      "Stand with feet hip-width apart holding a dumbbell in one hand at shoulder height, with your elbow close to your body, palm facing inward.",
      "Engage your core to maintain balance and ensure your shoulders are level.",
      "Step forward with the opposite leg to the dumbbell and lower your body into a lunge until both knees are at around 90-degree angles.",
      "Ensure your front knee does not extend past your toes and your back knee hovers just above the ground.",
      "Push off the front foot to bring your rear leg forward, coming back to the standing position.",
      "Continue the movement by alternating legs as you walk forward, maintaining balance and control throughout.",
      "Perform an even number of repetitions with the dumbbell in one hand before switching the dumbbell to the other hand and doing the same number of repetitions again."
    ],
    "notes": ""
  },
  {
    "pk": 320,
    "name": "Single-Leg Romanian Deadlift Jump",
    "slug": "single-leg-romanian-deadlift-jump",
    "primaryMuscles": ["calf", "glute", "hamstring", "quad"],
    "secondaryMuscles": ["abdominal", "lower back"],
    "steps": [
      "Stand on your right leg, keeping a slight bend in the right knee. Bend your right arm in front of your chest and keep your left arm straight down by your side. This is your starting position.",
      "Lean forward at your hips, extending your left leg behind you for balance. Keep your back straight, bend your left arm bent in front of your chest, and straighten your right arm behind you in rough alignment with your left leg.",
      "Lower your torso and lift your left leg until your body forms a 'T' shape, or go as low as your flexibility allows.",
      "Push through the heel of your right foot and prepare to explode upwards. Thrust your left arm down towards the ground while bringing your right arm up towards your chest to gain momentum for the jump.",
      "Jump upwards, driving force through your right leg and using the motion of your arms to enhance the lift.",
      "Land softly on your right leg, absorbing the impact with a slight bend in your knee, and reset your arms to their starting positions.",
      "Repeat for the desired number of repetitions on one leg before switching to the other."
    ],
    "notes": "To increase difficulty, try to remain balanced on the working leg throughout the set."
  },
  {
    "pk": 321,
    "name": "Single-Arm Thruster – Landmine",
    "slug": "single-arm-thruster-landmine",
    "primaryMuscles": ["glute", "quad", "shoulder - front"],
    "secondaryMuscles": ["abdominal", "lat", "oblique", "tricep"],
    "steps": [
      "Start by placing a barbell into a landmine attachment or securely anchor it into a corner.",
      "Stand with feet shoulder-width apart, holding the unattached end of the barbell with one hand at shoulder height. This is your starting position.",
      "Perform a squat by pushing your hips back, keeping your chest up, and bending your knees until your thighs are parallel to the floor.",
      "Explode upward from the squat position, using leg drive to assist in pressing the barbell overhead.",
      "Extend your arm fully overhead while keeping the opposite arm by your side for balance.",
      "Slowly lower the barbell back to shoulder height, controlling the descent, returning to the starting position.",
      "Repeat for the desired number of repetitions, then switch to the other arm."
    ],
    "notes": ""
  },
  {
    "pk": 322,
    "name": "Forearm Plank Knee to Elbow",
    "slug": "forearm-plank-knee-to-elbow",
    "primaryMuscles": ["abdominal", "oblique"],
    "secondaryMuscles": ["chest", "glute", "quad", "shoulder - front"],
    "steps": [
      "Begin in a forearm plank position with elbows directly beneath shoulders and body in a straight line from head to heels.",
      "Engage core muscles and maintain a neutral spine position throughout the exercise. This is your starting position.",
      "Lift one foot off the ground and bring the knee towards the same side elbow, maintaining plank position.",
      "Return the foot back to the starting plank position.",
      "Repeat the movement on the opposite side, bringing the other knee towards its respective elbow. This is one repetition.",
      "Continue alternating knees to elbows while maintaining stability in the plank position."
    ],
    "notes": ""
  },
  {
    "pk": 323,
    "name": "Skull Crusher – Cable with Rope",
    "slug": "skull-crusher-cable-with-rope",
    "primaryMuscles": ["tricep"],
    "secondaryMuscles": ["forearm - inner", "forearm - outer"],
    "steps": [
      "Begin by setting a flat bench in front of a cable machine with a low pulley.",
      "Lie down on the bench with your head closest to the cable machine.",
      "Grab the rope with an overhand grip, arms fully extended above your forehead. This is your starting position.",
      "Ensure your elbows are shoulder-width apart and remain in a fixed position throughout the exercise.",
      "Engage your core as you slowly lower the rope towards your forehead by bending your elbows.",
      "Pause briefly once the rope is close to your forehead.",
      "Press back to the starting position by extending your elbows and contracting your triceps.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  },
  {
    "pk": 324,
    "name": "One-Handed Bayesian Curl – Cable",
    "slug": "one-handed-bayesian-curl-cable",
    "primaryMuscles": ["bicep"],
    "secondaryMuscles": ["forearm - inner", "forearm - outer"],
    "steps": [
      "Stand facing away from a cable machine with the pulley set to the lowest height.",
      "Select an appropriate weight on the machine for your fitness level.",
      "Grip the handle attached to the cable with one hand, your palm facing forward.",
      "Keep your feet shoulder-width apart, back straight, and shoulders back.",
      "Curl the handle towards your chest, focusing on contracting the biceps while keeping your elbow stationary and close to your body.",
      "Pause at the top of the curl to squeeze the bicep muscle intensely.",
      "Slowly lower the handle back to the starting position, controlling the movement throughout the descent.",
      "Repeat the movement for the desired number of repetitions before switching arms."
    ],
    "notes": ""
  },
  {
    "pk": 325,
    "name": "Bottoms Up Seesaw Overhead Press – Kettlebell",
    "slug": "bottoms-up-seesaw-overhead-press-kettlebell",
    "primaryMuscles": ["shoulder - front", "shoulder - side"],
    "secondaryMuscles": [
      "rotator cuff - back",
      "rotator cuff - front",
      "tricep"
    ],
    "steps": [
      "Stand with feet shoulder-width apart, holding a kettlebell in each hand by the horns on the floor between your legs.",
      "Swing both kettlebells up, bending your elbows, so that the kettlebells end up in front of your shoulders in the bottoms-up position. This is your starting position.",
      "Begin the press by pushing one kettlebell upward, over your head, until your arm is staight with a slight bend in the elbow.",
      "Lower the raised kettlebell to your shoulder while simultaneously raising the lowered kettlebell over your head.",
      "Alternate the press between the kettlebells in a seesaw motion, ensuring one is always moving up as the other moves down.",
      "Complete the desired number of repetitions, ensuring that each hand pushes the kettlebell the same number of times, then safely lower both kettlebells to the ground."
    ],
    "notes": ""
  },
  {
    "pk": 326,
    "name": "Stability Ball Pullover – Dumbbell",
    "slug": "stability-ball-pullover-dumbbell",
    "primaryMuscles": ["chest", "lat"],
    "secondaryMuscles": ["abdominal", "tricep"],
    "steps": [
      "Select an appropriate weight dumbbell and a stability ball.",
      "Sit on the stability ball and place the dumbbell on your lap.",
      "Roll down the ball until your upper back and shoulders are supported by it, keeping your hips lifted, your body in a straight line, and your feet flat on the ground.",
      "Hold the dumbbell over your chest with both hands, gripping one end of the dumbbell while the other end points towards your chest. This is your starting position.",
      "Slowly lower the dumbbell in an arc behind your head, keeping your arms mostly straight, but slightly bent, throughout.",
      "Stretch your arms back as far as comfortably possible while maintaining control of the weight.",
      "Bring the dumbbell back up over your chest along the same arc.",
      "Repeat for the desired number of repetitions."
    ],
    "notes": ""
  }
]
